Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.Common/Resources/xlf/Resources.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DataCollectionMessageFormat
source: Data collection : {0}
cs: Shromažďování dat: {0}
de: Datensammlung: {0}
fr: Collecte de données : {0}
it: Raccolta dei dati: {0}
ja: データ コレクション : {0}
ko: 데이터 수집: {0}
pl: Zbieranie danych: {0}
pt_br: Coleção de dados: {0}
ru: Сбор данных: {0}
tr: Veri toplama: {0}
zh_hans: 数据收集: {0}
zh_hant: 資料收集: {0}

# DataCollectorMessageFormat
source: Data collector '{0}' message: {1}.
cs: Zpráva kolekce dat {0}: {1}
de: Datensammler "{0}" – Meldung: {1}.
fr: Message du collecteur de données '{0}' : {1}.
it: Messaggio '{0}' dell'agente di raccolta dati: {1}.
ja: データ コレクター '{0}' メッセージ: {1}。
ko: 데이터 수집기 '{0}' 메시지: {1}.
pl: Komunikat modułu zbierającego dane „{0}”: {1}.
pt_br: Coletor de dados '{0}' mensagem: {1}.
ru: Сообщение сборщика данных "{0}": {1}.
tr: '{0}' veri toplayıcısı iletisi: {1}.
zh_hans: 数据收集器“{0}”消息: {1}。
zh_hant: 資料收集器 '{0}' 的訊息: {1}。

# DuplicateExtensionUri
source: Duplicate test extension URI '{0}'. Ignoring the duplicate extension.
cs: Duplicitní identifikátor URI testu rozšíření {0}. Duplicitní rozšíření se ignoruje.
de: Doppelter Testerweiterungs-URI "{0}". Die doppelte Erweiterung wird ignoriert.
fr: L'URI d'extension de test '{0}' est dupliquée. L'extension dupliquée est ignorée.
it: L'URI dell'estensione di test '{0}' è duplicato. L'estensione duplicata verrà ignorata.
ja: テスト拡張 URI '{0}' は重複しています。重複する拡張を無視しています。
ko: 테스트 확장 URI '{0}'이(가) 중복됩니다. 중복 확장을 무시합니다.
pl: Zduplikowany identyfikator URI rozszerzenia testu „{0}”. Zduplikowane rozszerzenie zostanie zignorowane.
pt_br: URI da extensão do teste '{0}' duplicada. Ignorando a extensão duplicada.
ru: Повторяющийся URI расширения теста "{0}". Повторяющееся расширение пропускается.
tr: Yinelenen test uzantısı URI’si '{0}'. Yinelenen uzantı yoksayılıyor.
zh_hans: 测试扩展 URI“{0}”重复。忽略重复的扩展。
zh_hant: 重複的測試延伸模組 URI '{0}'。忽略重複的延伸模組。

# DuplicateSettingsName
source: Duplicate settings provider named '{0}'. Ignoring the duplicate provider.
cs: Duplicitní poskytovatel nastavení s názvem {0}. Duplicitní poskytovatel se ignoruje.
de: Doppelter Einstellungsanbieter namens "{0}". Der doppelte Anbieter wird ignoriert.
fr: Le fournisseur de paramètres nommé '{0}' est dupliqué. Le fournisseur dupliqué est ignoré.
it: Il provider di impostazioni denominato '{0}' è duplicato. Il provider duplicato verrà ignorato.
ja: '{0}' という名前の設定プロバイダーが重複しています。重複するプロバイダーを無視しています。
ko: 설정 공급자 '{0}'이(가) 중복됩니다. 중복 공급자를 무시합니다.
pl: Zduplikowany dostawca ustawień o nazwie „{0}”. Zduplikowany dostawca zostanie zignorowany.
pt_br: Provedor de configurações denominado '{0}' duplicado. Ignorando o provedor duplicado.
ru: Повторяющийся поставщик параметров с именем "{0}". Повторяющийся поставщик пропускается.
tr: '{0}' adlı yinelenen ayar sağlayıcısı. Yinelenen sağlayıcı yoksayılıyor.
zh_hans: 名为“{0}”的设置提供程序重复。忽略重复的提供程序。
zh_hant: 名為 '{0}' 的重複的設定提供者。忽略重複的提供者。

# DuplicateSettingsProvided
source: Duplicate run settings section named '{0}' found. Ignoring the duplicate settings.
cs: Našel se duplicitní oddíl nastavení běhu s názvem {0}. Duplicitní nastavení se ignoruje.
de: Duplizierter Abschnitt mit Ausführungseinstellungen "{0}". Die Einstellungsduplikate werden ignoriert.
fr: La section de paramètres d'exécution nommée '{0}' est dupliquée. Les paramètres dupliqués sont ignorés.
it: La sezione delle impostazioni esecuzione test denominata '{0}' è duplicata. Le impostazioni duplicate verranno ignorate.
ja: '{0}' という名前の重複した実行設定セクションが見つかりました。重複する設定を無視しています。
ko: 중복 실행 설정 섹션 '{0}'이(가) 있습니다. 중복 설정을 무시합니다.
pl: Znaleziono zduplikowaną sekcję parametrów uruchomieniowych o nazwie „{0}”. Zduplikowane ustawienia zostaną zignorowane.
pt_br: Foi encontrada uma seção de configurações de execução denominada '{0}' duplicada. Ignorando as configurações duplicadas.
ru: Обнаружен повторяющийся раздел параметров запуска с именем "{0}". Повторяющиеся параметры пропускаются.
tr: '{0}' adlı yinelenen çalıştırma ayarları bölümü bulundu. Yinelenen ayarlar yoksayılıyor.
zh_hans: 名为“{0}”的运行设置部分重复。请忽略重复的设置。
zh_hant: 找到名為 '{0}' 的重複執行設定區段。忽略重複的設定。

# EmptyParenthesis
source: Error: Empty parenthesis ( )
cs: Chyba: Prázdné závorky ( )
de: Fehler: Leere Klammern ( )
fr: Erreur : parenthèses vides ( )
it: Errore: parentesi vuote ( )
ja: エラー: かっこ ( ) が空です
ko: 오류: 빈 괄호 ( )
pl: Błąd: puste nawiasy ( )
pt_br: Erro: parênteses vazios ( )
ru: Ошибка: пустые круглые скобки ()
tr: Hata: Boş ayraç ( )
zh_hans: 错误: 空括号 ( )
zh_hant: 錯誤: 空的括弧 ( )

# InvalidCondition
source: Error: Invalid Condition '{0}'
cs: Chyba: Neplatná podmínka {0}
de: Fehler: Ungültige Bedingung "{0}".
fr: Erreur : condition non valide '{0}'
it: Errore: condizione non valida '{0}'
ja: エラー: 条件 '{0}' が無効です
ko: 오류: 잘못된 조건 '{0}'
pl: Błąd: nieprawidłowy warunek „{0}”
pt_br: Erro: condição inválida '{0}'
ru: Ошибка: недопустимое условие "{0}"
tr: Hata: Geçersiz Koşul '{0}'
zh_hans: 错误: 无效条件“{0}”
zh_hant: 錯誤: 條件 '{0}' 無效

# InvalidExtensionUriFormat
source: Test Extension has an invalid URI '{0}': {1}
cs: Rozšíření testu má neplatný identifikátor URI {0}: {1}
de: Die Testerweiterung weist einen ungültigen URI "{0}" auf: {1}
fr: L'URI d'extension de test est non valide '{0}' : {1}
it: L'URI '{0}' dell'estensione di test non è valido: {1}
ja: テスト拡張に無効な URI '{0}' があります: {1}
ko: 테스트 확장의 URI '{0}'이(가) 잘못되었습니다. {1}
pl: Rozszerzenie testu ma nieprawidłowy identyfikator URI „{0}”: {1}
pt_br: A Extensão do Teste tem um URI inválido '{0}': {1}
ru: Расширение теста имеет недопустимый URI "{0}": {1}
tr: Test Uzantısı geçersiz bir '{0}' URI’sine sahip: {1}
zh_hans: 测试扩展具有无效的 URI“{0}”: {1}
zh_hant: 測試延伸模組的 URI '{0}' 無效: {1}

# InvalidOperator
source: Error: Invalid operator '{0}'
cs: Chyba: Neplatný operátor {0}
de: Fehler: Ungültiger Operator "{0}".
fr: Erreur : opérateur non valide '{0}'
it: Errore: operatore non valido '{0}'
ja: エラー: 演算子 '{0}' が無効です
ko: 오류: 잘못된 연산자 '{0}'
pl: Błąd: nieprawidłowy operator „{0}”
pt_br: Erro: operador inválido '{0}'
ru: Ошибка: недопустимый оператор "{0}"
tr: Hata: Geçersiz işleç '{0}'
zh_hans: 错误: 运算符“{0}”无效
zh_hant: 錯誤: 運算子 '{0}' 無效

# LoggerInitializationError
source: Exception occurred while initializing logger with {0}: '{1}'. The logger will not be used. Exception: {2}
cs: Během inicializace protokolovače s {0}: {1} došlo k výjimce. Protokolovač se nepoužije. Výjimka: {2}
de: Ausnahme beim Initialisieren der Protokollierung mit "{0}": "{1}". Die Protokollierung wird nicht verwendet. Ausnahme: {2}
fr: Une exception s'est produite durant l'initialisation de l'enregistreur d'événements avec {0} : '{1}'. L'enregistreur d'événements ne sera pas utilisé. Exception : {2}
it: Si è verificata un'eccezione durante l'inizializzazione del logger con {0}: '{1}'. Il logger non verrà usato. Eccezione: {2}
ja: {0}: '{1}' でのロガーの初期化中に例外が発生しました。ロガーは使用されません。例外: {2}
ko: {0}: '{1}'인 로거를 초기화하는 동안 예외가 발생했습니다. 로거가 사용되지 않습니다. 예외: {2}
pl: Wystąpił wyjątek podczas inicjowania rejestratora o identyfikatorze {0}: „{1}”. Rejestrator nie będzie używany. Wyjątek: {2}
pt_br: Ocorreu uma exceção durante a inicialização do agente com {0}: ‘{1}’. O agente não será usado. Exceção: {2}
ru: Возникло исключение при инициализации средства ведения журнала с {0}: "{1}". Средство ведения журнала не будет использоваться. Исключение: {2}
tr: Günlükçü, '{0}' ile başlatılırken özel durum oluştu: '{1}'. Günlükçü kullanılmayacak. Özel durum: {2}
zh_hans: 初始化带有 {0} 的记录器时发生异常: "{1}"。将不会使用该记录器。异常: {2}
zh_hant: 初始化具有 '{0}' 的記錄器時，發生例外狀況: '{1}'。將不會使用此記錄器。例外狀況: {2}

# LoggerNotFound
source: Could not find a test logger with AssemblyQualifiedName, URI or FriendlyName '{0}'.
cs: Nepovedlo se najít protokolovač testu s kvalifikovaným názvem sestavení (AssemblyQualifiedName), identifikátorem URI (uri) nebo popisným názvem (FriendlyName) {0}.
de: Es wurde keine Testprotokollierung mit AssemblyQualifiedName, URI oder FriendlyName "{0}" gefunden.
fr: Impossible de localiser un enregistreur d'événements de test ayant pour AssemblyQualifiedName, URI ou FriendlyName '{0}'.
it: Non è stato trovato alcun logger di test con AssemblyQualifiedName, URI o FriendlyName '{0}'.
ja: AssemblyQualifiedName、URI または FriendlyName が '{0}' のテスト ロガーは見つかりませんでした。
ko: AssemblyQualifiedName, URI 또는 FriendlyName이 '{0}'인 테스트 로거를 찾을 수 없습니다.
pl: Nie można odnaleźć rejestratora testów z atrybutem AssemblyQualifiedName, identyfikatorem URI lub przyjazną nazwą „{0}”.
pt_br: Não foi possível localizar um agente de teste com o AssemblyQualifiedName, o URI ou o FriendlyName '{0}'.
ru: Не удалось найти средство ведения журнала тестирования с AssemblyQualifiedName, URI или FriendlyName "{0}".
tr: AssemblyQualifiedName, URI veya FriendlyName değeri '{0}' olan bir test günlükçüsü bulunamadı.
zh_hans: 找不到 AssemblyQualifiedName、URI 或 FriendlyName 为 "{0}" 的测试记录器。
zh_hant: 找不到具有 AssemblyQualifiedName、URI 或 FriendlyName '{0}' 的測試記錄器。

# MissingCloseParenthesis
source: Error: Missing ')'
cs: Chyba: Chybí ).
de: Fehler: Fehlende Klammer ")"
fr: Erreur : ')' manquante
it: Errore: manca ')'
ja: エラー: ')' がありません
ko: 오류: ')' 누락
pl: Błąd: brak znaku „)”
pt_br: Erro: ')' ausente
ru: Ошибка: отсутствует ")"
tr: Hata: ')' eksik
zh_hans: 错误: 缺少 ")"
zh_hant: 錯誤: 遺漏 ')'

# MissingOpenParenthesis
source: Error: Missing '('
cs: Chyba: Chybí (.
de: Fehler: Fehlende Klammer "("
fr: Erreur : '(' manquante
it: Errore: manca '('
ja: エラー: '(' がありません
ko: 오류: '(' 누락
pl: Błąd: brak znaku „(”
pt_br: Erro: '(' ausente
ru: Ошибка: отсутствует "("
tr: Hata: '(' eksik
zh_hans: 错误: 缺少 "("
zh_hant: 錯誤: 遺漏 '('

# MissingOperand
source: Error: Missing operand
cs: Chyba: Chybí operand.
de: Fehler: Fehlender Operand.
fr: Erreur : opérande manquant
it: Errore: manca l'operando
ja: エラー: オペランドがありません
ko: 오류: 피연산자 누락
pl: Błąd: brak argumentu operacji
pt_br: Erro: operando ausente
ru: Ошибка: отсутствует операнд
tr: Hata: İşlenen eksik
zh_hans: 错误: 缺少操作数
zh_hant: 錯誤: 遺漏運算元

# MissingOperator
source: Missing Operator '|' or '&'
cs: Chybějící operátor | nebo &
de: Operator "|" oder "&" fehlt
fr: Opérateur manquant '|' ou '&'
it: Manca l'operatore '|' o '&'
ja: 演算子 '|' または '&' がありません
ko: '|' 또는 '&' 연산자 누락
pl: Brak operatora „|” lub „&”
pt_br: Faltando operador '|' ou '&'
ru: Отсутствует оператор "|" или "&"
tr: '|' veya '&' işleci eksik
zh_hans: 缺少运算符 '|' 或 '&'
zh_hant: 遺漏運算子 '|' 或 '&'

# RunSettingsAlreadyLoaded
source: The Run Settings have already been loaded.
cs: Parametry spouštění jsou už načtené.
de: Die Laufzeiteinstellungen wurden bereits geladen.
fr: Les paramètres d'exécution ont déjà été chargés.
it: Le impostazioni esecuzione test sono già state caricate.
ja: 実行設定は既に読み込まれています。
ko: 실행 설정이 이미 로드되었습니다.
pl: Parametry uruchomieniowe zostały już załadowane.
pt_br: As Configurações de Execução já foram carregadas.
ru: Параметры запуска уже загружены.
tr: Çalıştırma Ayarları zaten yüklendi.
zh_hans: 已加载运行设置。
zh_hant: 已載入 [回合設定]。

# RunSettingsParseError
source: An error occurred while loading the run settings. Error: {0}
cs: Při načítání parametrů spouštění se stala chyba. Chyba: {0}
de: Fehler beim Laden der Laufzeiteinstellungen. Fehler: {0}
fr: Une erreur s'est produite durant le chargement des paramètres d'exécution. Erreur : {0}
it: Errore durante il caricamento delle impostazioni esecuzione test. Errore: {0}
ja: 実行設定の読み込み中にエラーが発生しました。エラー: {0}
ko: 실행 설정을 로드하는 동안 오류가 발생했습니다. 오류: {0}
pl: Wystąpił błąd podczas ładowania parametrów uruchomieniowych. Błąd: {0}
pt_br: Ocorreu um erro ao carregar as configurações de execução. Erro: {0}
ru: Произошла ошибка при загрузке параметров запуска. Ошибка: {0}
tr: Çalıştırma ayarları yüklenirken bir hata oluştu. Hata: {0}
zh_hans: 加载运行设置时出错。错误: {0}
zh_hant: 載入回合設定時發生錯誤。錯誤: {0}

# SettingsNodeInvalidName
source: Invalid settings node specified. The name property of the settings node must be non-empty.
cs: Zadal se neplatný uzel nastavení. Vlastnost name uzlu nastavení nesmí být prázdná.
de: Es wurde ein ungültiger Einstellungsknoten angegebenen. Die Eigenschaft "name" eines Einstellungsknotens darf nicht leer sein.
fr: Le nœud de paramètres spécifié est non valide. La propriété name du nœud de paramètres ne doit pas être vide.
it: Il nodo impostazioni specificato non è valido. La proprietà del nome del nodo impostazioni non deve essere vuota.
ja: 無効な設定ノードが指定されました。設定ノードの名前プロパティを空白にしないようにしてください。
ko: 잘못된 설정 노드를 지정했습니다. 설정 노드의 이름 속성이 비어 있어서는 안 됩니다.
pl: Określono nieprawidłowy węzeł ustawień. Właściwość name węzła ustawień nie może być pusta.
pt_br: Nó de configurações inválido especificado. A propriedade de nome do nó de configurações não deve estar vazia.
ru: Указан недопустимый узел параметров. Узел параметров должен иметь допустимое значение для свойства имени.
tr: Belirtilen ayar düğümü geçersiz. Ayar düğümünün ad özelliği boş olmamalıdır.
zh_hans: 指定了无效的设置节点。设置节点的名称属性必须为非空。
zh_hant: 指定的設定節點無效。設定節點的名稱屬性必須為非空白。

# SettingsProviderInitializationError
source: An error occurred while initializing the settings provider named '{0}'. Error: {1}
cs: Při inicializaci poskytovatele nastavení s názvem {0} se stala chyba. Chyba: {1}
de: Fehler beim Initialisieren des Einstellungsanbieters namens "{0}". Fehler: {1}
fr: Une erreur s'est produite durant l'initialisation du fournisseur de paramètres nommé '{0}'. Erreur : {1}
it: Si è verificato un errore durante l'inizializzazione del provider di impostazioni denominato '{0}'. Errore: {1}
ja: '{0}' という名前の設定プロバイダーを初期化中にエラーが発生しました。エラー: {1}
ko: 설정 공급자 '{0}'을(를) 초기화하는 동안 오류가 발생했습니다. 오류: {1}
pl: Wystąpił błąd podczas inicjowania dostawcy ustawień o nazwie „{0}”. Błąd: {1}
pt_br: Ocorreu um erro ao inicializar o provedor de configurações denominado '{0}'. Erro: {1}
ru: При инициализации поставщика параметров с именем "{0}" произошла ошибка. Ошибка: {1}
tr: '{0}' adlı ayar sağlayıcısı başlatılırken bir hata oluştu. Hata: {1}
zh_hans: 初始化名为“{0}”的设置提供程序时出错。错误: {1}
zh_hant: 將名為 '{0}' 的設定提供者初始化時發生錯誤。錯誤: {1}

# SettingsProviderNotFound
source: Settings Provider named '{0}' was not found. The settings can not be loaded.
cs: Poskytovatel nastavení s názvem {0} se nenašel. Nastavení nešlo načíst.
de: Der Einstellungsanbieter namens "{0}" wurde nicht gefunden. Die Einstellungen können nicht geladen werden.
fr: Le fournisseur de paramètres nommé '{0}' est introuvable. Impossible de charger les paramètres.
it: Il provider di impostazioni denominato '{0}' non è stato trovato. Non è possibile caricare le impostazioni.
ja: '{0}' という名前の設定プロバイダーが見つかりませんでした。設定を読み込めません。
ko: 설정 공급자 '{0}'을(를) 찾을 수 없습니다. 설정을 로드할 수 없습니다.
pl: Nie znaleziono dostawcy ustawień o nazwie „{0}”. Nie można załadować ustawień.
pt_br: O Provedor de Configurações denominado '{0}' não foi encontrado. Não é possível carregar as configurações.
ru: Поставщик параметров с именем "{0}" не найден. Невозможно загрузить параметры.
tr: '{0}' adlı Ayar Sağlayıcısı bulunamadı. Ayarlar yüklenemiyor.
zh_hans: 找不到名为“{0}”的设置提供程序。无法加载设置。
zh_hant: 找不到名為 '{0}' 的設定提供者。無法載入設定。

# TestCaseFilterFormatException
source: Incorrect format for TestCaseFilter {0}. Specify the correct format and try again. Note that the incorrect format can lead to no test getting executed.
cs: Nesprávný formát pro TestCaseFilter {0}. Zadejte správný formát a zkuste to znovu. Poznámka: Nesprávný formát může vést k tomu, že se nespustí žádný test.
de: Ungültiges Format für TestCaseFilter {0}. Geben Sie das richtige Format an, und versuchen Sie es erneut. Beachten Sie, dass das falsche Format dazu führen kann, dass kein Test ausgeführt wird.
fr: Format incorrect pour le TestCaseFilter {0}. Spécifiez le format approprié, puis réessayez. Notez que si le format est incorrect, aucun test n'est exécuté.
it: Il formato per TestCaseFilter {0} non è corretto. Specificare il formato corretto e riprovare. Se il formato non è corretto, potrebbe non essere eseguito alcun test.
ja: TestCaseFilter {0} の形式が正しくありません。正しい形式を指定してもう一度お試しください。形式が正しくないと、テストが実行されないことがあります。
ko: TestCaseFilter {0}의 형식이 잘못되었습니다. 올바른 형식을 지정하고 다시 시도하세요. 잘못된 형식을 사용하면 테스트가 실행되지 않을 수 있습니다.
pl: Niepoprawny format elementu TestCaseFilter {0}. Określ poprawny format i spróbuj ponownie. Należy pamiętać, że niepoprawny format może spowodować, że żadne testy nie zostaną wykonane.
pt_br: Formato incorreto para TestCaseFilter {0}. Especifique o formato correto e tente novamente. Observe que o formato incorreto pode fazer com que nenhum teste seja executado.
ru: Неверный формат фильтра TestCaseFilter {0}. Задайте правильный формат и повторите попытку. Обратите внимание, что использование неверного формата может привести к тому, что ни один из тестов не будет выполнен.
tr: TestCaseFilter {0} için yanlış biçim. Doğru biçimi belirtin ve yeniden deneyin. Yanlış biçim hiçbir testin yürütülmemesine neden olabilir.
zh_hans: TestCaseFilter {0} 的格式不正确。请指定正确的格式并重试。请注意，格式不正确会导致不执行任何测试。
zh_hant: TestCaseFilter {0} 的格式不正確。請指定正確的格式後再試一次。請注意，格式不正確可能會導致無法執行測試。

# DataCollectorErrorOnGetVariable
source: Data collector '{0}' failed to provide initialization information. Error: {1}
cs: Kolekce dat {0} neposkytla informace o inicializaci. Chyba: {1}
de: Vom Datensammler "{0}" wurden keine Initialisierungsinformationen bereitgestellt. Fehler: {1}
fr: Le collecteur de données '{0}' n'a pas pu fournir les informations d'initialisation. Erreur : {1}
it: L'agente di raccolta dati '{0}' non ha fornito le informazioni di inizializzazione. Errore: {1}
ja: データ コレクター '{0}' で初期化情報を表示できませんでした。エラー: {1}
ko: 데이터 수집기 '{0}'에서 초기화 정보를 제공하지 못했습니다. 오류: {1}
pl: Dostarczenie informacji o inicjowaniu przez moduł zbierający dane „{0}” nie powiodło się. Błąd: {1}
pt_br: O coletor de dados '{0}' falhou ao fornecer informações de inicialização. Erro: {1}
ru: Сборщик данных "{0}" не предоставил сведения для инициализации. Ошибка: {1}
tr: '{0}' veri toplayıcısı başlatma bilgilerini sağlayamadı. Hata: {1}
zh_hans: 数据收集器“{0}”未能提供初始化信息。错误: {1}
zh_hant: 資料收集器 '{0}' 無法提供初始化資訊。錯誤: {1}

# DataCollectorInitializationError
source: Data collector '{0}' threw an exception during type loading, construction, or initialization: {1}.
cs: Kolekce dat {0} během načítání typu, konstrukce nebo inicializace vyvolala výjimku: {1}
de: Der Datensammler "{0}" hat beim Laden, bei der Konstruktion oder bei der Initialisierung des Typs eine Ausnahme ausgelöst: {1}.
fr: Le collecteur de données '{0}' a levé une exception pendant le chargement, la construction ou l'initialisation du type : {1}.
it: L'agente di raccolta dati '{0}' ha generato un'eccezione durante la costruzione, l'inizializzazione o il caricamento dei tipi: {1}.
ja: データ コレクター '{0}' が型の読み込み、作成、または初期化中に例外をスローしました: {1}。
ko: 형식 로드, 생성 또는 초기화 중에 데이터 수집기 '{0}'에서 예외를 throw했습니다. {1}.
pl: Moduł zbierający dane „{0}” zgłosił wyjątek w trakcie ładowania, konstruowania lub inicjowania typu: {1}.
pt_br: O coletor de dados '{0}' lançou uma exceção durante a inicialização, construção ou carregamento de tipo: {1}.
ru: В сборщике данных "{0}" возникло исключение во время загрузки типа, создания или инициализации: {1}.
tr: '{0}' veri toplayıcısı tür yükleme, oluşturma veya başlatma sırasında bir özel durum oluşturdu: {1}.
zh_hans: 在类型加载、构造或初始化期间，数据收集器“{0}”引发了异常: {1}。
zh_hant: 載入、建構或初始化類型期間，資料收集器 '{0}'擲回例外狀況: {1}。

# DataCollectorNotFound
source: Could not find data collector '{0}'
cs: Nepovedlo se najít kolekci dat {0}.
de: Datensammler "{0}" wurde nicht gefunden
fr: Collecteur de données '{0}' introuvable
it: L'agente di raccolta dati '{0}' non è stato trovato
ja: データ コレクター '{0}' が見つかりませんでした
ko: 데이터 수집기 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć modułu zbierającego dane „{0}”
pt_br: Não foi possível encontrar o coletor de dados '{0}'
ru: Не удалось найти сборщик данных "{0}"
tr: '{0}' veri toplayıcısı bulunamadı
zh_hans: 找不到数据收集器“{0}”
zh_hant: 找不到資料收集器 '{0}'

# DataCollectorRequestedDuplicateEnvironmentVariable
source: The data collector '{0}' requested environment variable '{1}' with value '{2}' to be set in test execution environment, but another data collector '{3}' has already requested same environment variable with different value '{4}'.
cs: Kolekce dat {0} si v prostředí provedení testu vyžádala nastavení proměnné prostředí {1} na hodnotu {2}, ale jiná kolekce dat {3} si už vyžádala stejnou proměnnou prostředí s rozdílnou hodnotou {4}.
de: Der Datensammler "{0}" hat das Festlegen der Umgebungsvariablen "{1}" mit dem Wert "{2}" in der Testausführungsumgebung angefordert, ein anderer Datensammler "{3}" hat jedoch die gleiche Umgebungsvariable mit dem anderen Wert "{4}" angefordert.
fr: Le collecteur de données '{0}' exige que la variable d'environnement '{1}' avec la valeur '{2}' soit définie dans un environnement d'exécution de test, mais un autre collecteur de données '{3}' a déjà exigé la même variable d'environnement avec une autre valeur '{4}'.
it: L'agente di raccolta dati '{0}' ha richiesto che la variabile di ambiente '{1}' con valore '{2}' fosse impostata nell'ambiente di esecuzione dei test, ma un altro agente di raccolta dati '{3}' ha già richiesto la stessa variabile di ambiente con un valore diverso '{4}'.
ja: データ コレクター '{0}' が値 '{2}' の環境変数 '{1}' をテスト実行時環境で設定するように要求しましたが、別のデータ コレクター '{3}' が既に別の値 '{4}' を持つ同じ環境変数を要求しています。
ko: 데이터 수집기 '{0}'에서 값이 '{2}'인 환경 변수 '{1}'을(를) 테스트 실행 환경에서 설정하도록 요청했는데, 다른 데이터 수집기 '{3}'이(가) 다른 값('{4}')을 포함하는 동일 환경 변수를 이미 요청했습니다.
pl: Moduł zbierający dane „{0}” zażądał ustawienia zmiennej środowiskowej „{1}” o wartości „{2}” w środowisku wykonywania testu, ale inny moduł zbierający dane „{3}” już zażądał ustawienia tej zmiennej środowiskowej na wartość „{4}”.
pt_br: O coletor de dados '{0}' solicitou a variável de ambiente '{1}' com valor '{2}' para ser definida no ambiente de execução de teste, mas outro coletor de dados '{3}' já solicitou a mesma variável de ambiente com um valor diferente '{4}'.
ru: Сборщик данных "{0}" запросил, чтобы в окружении выполнения тестов была установлена переменная окружения "{1}" со значением "{2}", но другой сборщик данных "{3}" уже запросил эту переменную окружения со значением "{4}".
tr: '{0}' veri toplayıcısı, test yürütme ortamında değeri '{2}' olan '{1}' ortam değişkeninin ayarlanması için istekte bulundu, ancak başka bir veri toplayıcısı ('{3}') zaten farklı bir değerle ('{4}') aynı ortam değişkeni için istekte bulunmuştu.
zh_hans: 数据收集器“{0}”已请求具有将在测试执行环境中设置的值“{2}”的环境变量“{1}”，但另一个数据收集器“{3}”已请求具有其他值“{4}”的同一环境变量。
zh_hant: 資料收集器 '{0}' 要求要在測試執行環境中將環境變數 '{1}' 的值設為 '{2}'，但另一個資料收集器 '{3}' 已要求了同一個環境變數，但具有不同的值 '{4}'。
