Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.Common/Resources/xlf/Resources.*.xlf
Languages: cs, de, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# IgnoredDuplicateConfiguration
source: There are multiple configurations that have data collector FriendlyName as '{0}'. Duplicate configurations will be ignored in the test run.
cs: Existuje více konfigurací, které mají popisný název kolekce dat {0}. Duplicitní konfigurace se budou v testovacím běhu ignorovat.
de: Es gibt mehrere Konfigurationen mit dem Datensammler-FriendlyName "{0}". Doppelte Konfigurationen werden beim Testlauf ignoriert.
fr: Plusieurs configurations ont comme FriendlyName de collecteur de données '{0}'. Les configurations dupliquées seront ignorées dans la série de tests.
it: Sono presenti più configurazioni in cui il nome descrittivo dell'agente di raccolta dati è '{0}'. Le configurazioni duplicate verranno ignorate nell'esecuzione dei test.
ja: データ コレクターの FriendlyName が '{0}' の構成が複数あります。テストの実行では、重複した構成は無視されます。
ko: 데이터 수집기 FriendlyName이 '{0}'인 여러 개의 구성이 있습니다. 중복 구성은 테스트 실행에서 무시됩니다.
pl: Istnieje wiele konfiguracji, które zawierają przyjazną nazwę modułu zbierającego dane „{0}”. Zduplikowane konfiguracje będą ignorowane w przebiegu testu.
pt_br: Existem várias configurações que têm o FriendlyName do coletor de dados como '{0}'. Configurações duplicadas serão ignoradas na execução de teste.
ru: Существует несколько конфигураций со значением "{0}" для FriendlyName сборщика данных. Повторяющиеся конфигурации будут пропущены в тестовом запуске.
tr: Veri toplayıcısı FriendlyName değeri '{0}' olan birden çok yapılandırma var. Yinelenen yapılandırmalar test çalıştırmasında yoksayılacak.
zh_hans: 有多个配置的数据收集器 FriendlyName 为“{0}”。测试运行中将忽略重复的配置。
zh_hant: 有多個組態的資料收集器 FriendlyName 為 '{0}'。在測試回合中，重複的組態將予忽略。

# ReportDataCollectorException
source: Data collector caught an exception of type '{0}': '{1}'. More details: {2}.
cs: Kolekce dat zachytila výjimku typu {0}: {1}. Další podrobnosti: {2}
de: Der Datensammler hat eine Ausnahme vom Typ "{0}" aufgefangen: "{1}". Weitere Informationen: {2}.
fr: Le collecteur de données a intercepté une exception de type '{0}' : '{1}'. Plus de détails : {2}.
it: L'agente di raccolta dati ha rilevato un'eccezione di tipo '{0}': '{1}'. Altri dettagli: {2}.
ja: データ コレクターが型 '{0}' の例外をキャッチしました: '{1}'。詳細: {2}。
ko: 데이터 수집기에서 '{0}': '{1}' 형식의 예외를 catch했습니다. 자세한 정보: {2}.
pl: Moduł zbierający dane przechwycił wyjątek typu „{0}”: „{1}”. Więcej szczegółów: {2}.
pt_br: O coletor de dados capturou uma exceção do tipo '{0}': '{1}'. Mais detalhes: {2}.
ru: В сборщике данных возникло исключение типа "{0}": "{1}". Дополнительные сведения: {2}.
tr: Veri toplayıcısı '{0}' türünde bir özel durum yakaladı: '{1}'. Diğer ayrıntılar:'{2}'.
zh_hans: 数据收集器已捕获类型为“{0}”的异常:“{1}”。更多详细信息: {2}。
zh_hant: 資料收集器攔截到類型為 '{0}' 的例外狀況: '{1}'。更多詳細資料: {2}。

# WrongDataCollectionContextType
source: Types deriving from the data collection context cannot be used for sending data and messages. The DataCollectionContext used for sending data and messages must come from one of the events raised to the data collector.
cs: Typy odvozené z kontextu shromažďování dat nelze použít pro posílání zpráv a dat. DataCollectionContext použitý pro posílání dat a zpráv musí pocházet z jedné z událostí vyvolaných na kolekci dat.
de: Typen, die vom Datensammlungskontext abgeleitet werden, können nicht zum Senden von Daten und Meldungen verwendet werden. Der DataCollectionContext für das Senden von Daten und Meldungen muss aus einem der Ereignisse stammen, die für den Datensammler ausgelöst wurden.
fr: Impossible d'utiliser les types qui dérivent du contexte de collecte de données pour envoyer des données et des messages. La valeur DataCollectionContext utilisée pour envoyer des données et des messages doit provenir de l'un des événements déclenchés par le collecteur de données.
it: Non è possibile usare i tipi che derivano da DataCollectionContext per inviare dati e messaggi. L'elemento DataCollectionContext usato per inviare dati e messaggi deve provenire da uno degli eventi generati per l'agente di raccolta dati.
ja: データ コレクション コンテキストから派生する型をデータおよびメッセージの送信に使用することはできません。データおよびメッセージの送信に使用される DataCollectionContext は、データ コレクターに対して発生したイベントの 1 つからのものである必要があります。
ko: 데이터 컬렉션 컨텍스트에서 파생된 형식을 사용하여 데이터 및 메시지를 보낼 수 없습니다. 데이터 및 메시지를 보내는 데 사용되는 DataCollectionContext는 데이터에 대해 발생한 이벤트 중 하나에서 가져와야 합니다.
pl: Typy pochodzące od kontekstu kolekcji danych nie mogą być używane do wysyłania danych i komunikatów. Element DataCollectionContext służący do wysyłania danych i komunikatów musi pochodzić z jednego ze zdarzeń wywołanych dla modułu zbierającego dane.
pt_br: Tipos derivados de DataCollectionContext não podem ser usados para enviar dados e mensagens. Os DataCollectionContext usado para enviar dados e mensagens devem vir de um dos eventos adicionados ao coletor de dados.
ru: Нельзя использовать типы, производные от контекста сбора данных, для отправки данных и сообщений. Используемый для отправки данных и сообщений DataCollectionContext должен происходить от одного из событий, возникших для сборщика данных.
tr: Veri koleksiyonu bağlamından türetilen türler, veri ve ileti göndermek için kullanılamaz. Veri ve ileti göndermek için kullanılan DataCollectionContext veri toplayıcısı yükseltilmiş olayların birinden gelmelidir.
zh_hans: 从数据收集上下文派生的类型不能用于发送数据和消息。 用于发送数据和消息的 DataCollectionContext 必须来自向数据收集器引发的某个事件。
zh_hant: 衍生自資料收集內容的類型無法用於傳送資料和訊息。用於傳送資料和訊息的 DataCollectionContext 必須來自其中一個引發資料收集器的事件。

# LoggerUriInvalid
source: The Test Logger URI '{0}' is not valid. The Test Logger will be ignored.
cs: Identifikátor URI {0} protokolovače testu není platný. Protokolovač testu se bude ignorovat.
de: Der Testprotokollierungs-URI "{0}" ist ungültig. Die Testprotokollierung wird ignoriert.
fr: L'URI de l'enregistreur d'événements de tests '{0}' est non valide. L'enregistreur d'événements de tests va être ignoré.
it: L'URI del logger di test '{0}' non è valido. Il logger di test verrà ignorato.
ja: テスト ロガーの URI '{0}' は無効です。テスト ロガーは無視されます。
ko: 테스트 로거 URI '{0}'이(가) 잘못되었습니다. 테스트 로거를 무시합니다.
pl: Podany identyfikator URI rejestratora testów „{0}” jest nieprawidłowy. Rejestrator testów zostanie zignorowany.
pt_br: O URI do Agente de Teste '{0}' não é válido. O Agente de Teste será ignorado.
ru: URI средства ведения журнала тестирования "{0}" недопустимо. Это средство ведения журнала тестирования будет игнорироваться.
tr: Test Günlükçüsünün '{0}' URI’si geçerli değil. Test Günlükçüsü yoksayılacak.
zh_hans: 测试记录器 URI“{0}”无效。将忽略该测试记录器。
zh_hant: 測試記錄器 URI '{0}' 無效。將忽略測試記錄器。

# FailedToFindInstalledUnitTestExtensions
source: Failed to find the list of installed unit test extensions. Reason: {0}
cs: Nepovedlo se najít seznam nainstalovaných rozšíření testu jednotek. Důvod: {0}
de: Die Liste installierter Komponententesterweiterungen wurde nicht gefunden. Ursache: {0}
fr: La liste des extensions de test unitaire installées est introuvable. Raison : {0}
it: L'elenco delle estensioni degli unit test installate non è stato trovato. Motivo: {0}
ja: インストール済みの単体テスト拡張の一覧が見つかりませんでした。理由: {0}
ko: 설치된 단위 테스트 확장 목록을 찾지 못했습니다. 이유: {0}
pl: Nie można znaleźć listy zainstalowanych rozszerzeń testów jednostkowych. Przyczyna: {0}
pt_br: Falha ao encontrar a lista de extensões de teste de unidade. Motivo: {0}
ru: Не удалось найти список установленных расширений модульных тестов. Причина: {0}
tr: Yüklenen birim testi uzantılarının listesi bulunamadı. Neden: {0}
zh_hans: 找不到已安装的单元测试扩展列表。原因: {0}
zh_hant: 無法找到已安裝之單元測試延伸模組的清單。原因: {0}

# VSInstallationNotFound
source: This option works only with vstest.console.exe installed as part of Visual Studio.
cs: Tato možnost funguje jenom se souborem vstest.console.exe nainstalovaným jako součást sady Visual Studio.
de: Diese Option funktioniert nur, wenn "vstest.console.exe" als Teil von Visual Studio installiert wurde.
fr: Cette option fonctionne uniquement si vstest.console.exe est installé dans le cadre de Visual Studio.
it: Questa opzione funziona solo se vstest.console.exe è installato con Visual Studio.
ja: このオプションは Visual Studio の一部として vstest.console.exe がインストールされている場合のみ使用できます。
ko: 이 옵션은 Visual Studio의 일부로 설치된 vstest.console.exe에서만 실행됩니다.
pl: Ta opcja działa wyłącznie z elementem vstest.console.exe zainstalowanym jako część programu Visual Studio.
pt_br: Essa opção funciona somente com vstest.console.exe instalado como parte do Visual Studio.
ru: Этот параметр работает, только если в рамках Visual Studio установлена служебная программа vstest.console.exe.
tr: Bu seçenek yalnızca Visual Studio’nun bir parçası olarak yüklenen vstest.console.exe ile birlikte çalışır.
zh_hans: 此选项仅适用于作为 Visual Studio 一部分安装的 vstest.console.exe。
zh_hant: 此選項僅適用於隨 Visual Studio 安裝的 vstest.console.exe。

# FastFilterException
source: An error occurred while creating Fast filter.
cs: Při vytváření rychlého filtru došlo k chybě.
de: Fehler beim Erstellen eines Schnellfilters.
fr: Une erreur s'est produite durant la création du filtre rapide.
it: Si è verificato un errore durante la creazione del filtro Fast.
ja: 高速フィルターを作成中にエラーが発生しました。
ko: 빠른 필터를 만드는 중 오류가 발생했습니다.
pl: Wystąpił błąd podczas tworzenia szybkiego filtru.
pt_br: Ocorreu um erro ao criar o filtro Rápido.
ru: При создании быстрого фильтра произошла ошибка.
tr: Hızlı filtre oluşturulurken bir hata oluştu.
zh_hans: 创建“快”筛选器时遇到错误。
zh_hant: 建立快速篩選時發生錯誤。

# CancellationRequested
source: Cancelling the operation as requested.
cs: Operace se ruší na základě žádosti.
de: Der Vorgang wird gemäß Anforderung abgebrochen.
fr: Annulation de l'opération, comme demandé.
it: L'operazione verrà annullata come richiesto.
ja: 操作のキャンセルが要求されたため、キャンセルしています。
ko: 요청한 대로 작업을 취소하는 중입니다.
pl: Anulowanie operacji zgodnie z żądaniem.
pt_br: Cancelando a operação conforme solicitado.
ru: Операция отменяется в соответствии с запросом.
tr: İşlem istek üzerine iptal ediliyor.
zh_hans: 按要求取消该操作。
zh_hant: 正在應要求取消作業。

# UnableToFetchUriString
source: Unable to find a datacollector with friendly name '{0}'.
cs: Nepovedlo se najít datacollector s popisným názvem {0}.
de: datacollector mit dem Anzeigenamen "{0}" wurde nicht gefunden.
fr: Le datacollector ayant le nom convivial '{0}' est introuvable.
it: Non è possibile trovare un oggetto datacollector con nome descrittivo '{0}'.
ja: フレンドリ名が '{0}' の datacollector が見つかりません。
ko: 이름이 '{0}'인 datacollector를 찾을 수 없습니다.
pl: Nie można znaleźć elementu datacollector o przyjaznej nazwie „{0}”.
pt_br: Não é possível localizar um datacollector com o nome amigável '{0}'.
ru: Не удается найти datacollector с понятным именем "{0}".
tr: '{0}' kolay adına sahip bir datacollector bulunamadı.
zh_hans: 找不到友好名称为“{0}”的 datacollector。
zh_hant: 找不到易記名稱為 '{0}' 的 datacollector。

# FailedToLoadAdapaterFile
source: Failed to load extensions from file '{0}'. Please use /diag for more information.
cs: Nepovedlo se načíst rozšíření ze souboru {0}. Další informace získáte pomocí parametru /diag.
de: Fehler beim Laden von Erweiterungen aus der Datei "{0}". Verwenden Sie "/diag", um weitere Informationen zu erhalten.
fr: Le chargement des extensions à partir du fichier '{0}' a échoué. Pour plus d'informations, utilisez /diag.
it: Non è stato possibile caricare le estensioni dal file '{0}'. Per altre informazioni, usare /diag.
ja: ファイル '{0}' から拡張機能を読み込めませんでした。詳細な情報を得るには、/diag をご使用ください。
ko: '{0}' 파일에서 확장을 로드하지 못했습니다. 자세한 내용을 보려면 /diag를 사용하세요.
pl: Nie można załadować rozszerzeń z pliku „{0}”. Aby uzyskać więcej informacji, użyj opcji /diag.
pt_br: Falha ao carregar as extensões do arquivo '{0}'. Use /diag para obter mais informações.
ru: Не удалось загрузить расширения из файла "{0}". Для получения дополнительных сведений используйте /diag.
tr: Uzantılar '{0}' dosyasından yüklenemedi. Daha fazla bilgi için lütfen /diag kullanın.
zh_hans: 未能从文件 "{0}" 加载扩展。有关详细信息，请使用 /diag。
zh_hant: 無法從檔案 '{0}' 載入延伸模組。如需詳細資訊，請使用 /diag。

# AccessDenied
source: {0} Access denied while trying to create "TestResults" folder in mentioned location. You are getting this exception because you are running vstest.console.exe from a folder which requires having write access. To solve the issue: please run vstest.console.exe from a folder where you have write privileges. For more information, please look at the error message:
cs: {0} Při pokusu o vytvoření složky TestResults v uvedeném umístění došlo k odepření přístupu. Tato výjimka se vyvolala, protože spouštíte vstest.console.exe ze složky, která vyžaduje, abyste měli přístup pro zápis. Pokud chcete problém vyřešit, spusťte prosím vstest.console.exe ze složky, ve které máte oprávnění k zápisu. Další informace najdete v chybové zprávě:
de: {0} Beim Erstellen des Ordners "TestResults" am angegebenen Speicherort wurde der Zugriff verweigert. Sie erhalten diese Ausnahme, weil Sie "vstest.console.exe" von einem Ordner aus ausführen, für den Schreibzugriff erforderlich ist. So beheben Sie das Problem: Führen Sie "vstest.console.exe" in einem Ordner aus, für den Sie Schreibberechtigungen besitzen. Weitere Informationen finden Sie in der Fehlermeldung:
fr: {0} Accès refusé durant la tentative de création du dossier "TestResults" à l'emplacement indiqué. Vous obtenez cette exception, car vous exécutez vstest.console.exe à partir d'un dossier qui nécessite un accès en écriture. Pour résoudre le problème, exécutez vstest.console.exe à partir d'un dossier sur lequel vous disposez de privilèges d'accès en écriture. Pour plus d'informations, consultez le message d'erreur :
it: {0} Accesso negato durante il tentativo di creare la cartella "TestResults" nel percorso indicato. Si riceve questa eccezione perché si esegue vstest.console.exe da una cartella per cui è necessario l'accesso in scrittura. Per risolvere il problema, eseguire vstest.console.exe da una cartella per cui si hanno privilegi di scrittura. Per altre informazioni, vedere il messaggio di errore:
ja: {0} 記載した場所に "TestResults" フォルダーを作成しようとしたときにアクセスが拒否されました。書き込みアクセスを必要とするフォルダーから vstest.console.exe を実行しているため、この例外が発生しています。この問題を解決するには、書き込み権限のあるフォルダーから vstest.console.exe を実行してください。詳細については、次のエラー メッセージをご覧ください。
ko: {0} "TestResults" 폴더를 언급된 위치에 만드는 동안 액세스가 거부되었습니다. 쓰기 권한이 필요한 폴더에서 vstest.console.exe를 실행하고 있으므로 이 예외가 발생했습니다. 이 문제를 해결하려면 쓰기 권한이 있는 폴더에서 vstest.console.exe를 실행하세요. 자세한 내용은 다음 오류 메시지를 확인하세요.
pl: {0} Odmowa dostępu podczas próby utworzenia folderu „TestResults” w określonej lokalizacji. Widzisz ten wyjątek, ponieważ program vstest.console.exe został uruchomiony z folderu wymagającego dostępu do zapisu. Aby rozwiązać ten problem: uruchom program vstest.console.exe z folderu, w którym masz uprawnienia do zapisu. Więcej informacji można znaleźć w komunikacie o błędzie:
pt_br: {0} Acesso negado ao tentar criar a pasta "TestResults" no local mencionado. Você está recebendo esta exceção porque está executando o vstest.console.exe em uma pasta que requer acesso para gravação. Para resolver o problema: execute vstest.console.exe em uma pasta na qual você tenha privilégios de gravação. Para obter mais informações, verifique a mensagem de erro:
ru: {0} Отказано в доступе при попытке создания папки "TestResults" в указанном расположении. Это исключение возникло, так как вы запускаете файл vstest.console.exe из папки, для которой требуется доступ на запись. Чтобы устранить эту проблему, запустите vstest.console.exe из папки, для которой у вас есть разрешения на запись. Дополнительные сведения см. в сообщении об ошибке:
tr: {0} Belirtilen konumda "TestResults" klasörü oluşturulmaya çalışılırken erişim engellendi. Yazma erişimi gerektiren bir klasörden vstest.console.exe çalıştırdığınız için bu özel durumu aldınız. Sorunu çözmek için: Lütfen yazma ayrıcalıklarına sahip olduğunuz bir klasörden vstest.console.exe dosyasını çalıştırın. Daha fazla bilgi için lütfen hata iletisine bakın:
zh_hans: {0} 尝试在所述位置创建 "TestResults" 文件夹时，访问被拒。你收到此异常是因为你正在从需要具有写入权限的文件夹运行 vstest.console.exe。若要解决此问题，请从你具有写入权限的文件夹运行 vstest.console.exe。有关详细信息，请查看错误消息:
zh_hant: {0} 嘗試在提及的位置上建立 "TestResults" 資料夾時存取被拒。因為您正從需要寫入存取權的資料夾執行 vstest.console.exe，所以收到此例外狀況。若要解決此問題: 請從您有權寫入的資料夾執行 vstest.console.exe。如需詳細資訊，請參閱錯誤訊息:

source: Inner exception:
cs: Vnitřní výjimka:

source: Stack trace:
cs: Trasování zásobníku:

# SerialTestRunInvalidScenario
source: <ForceOneTestAtTimePerTestHost>true</ForceOneTestAtTimePerTestHost> is not supported for sources test run.
cs: <ForceOneTestAtTimePerTestHost>true</ForceOneTestAtTimePerTestHost> se pro testovací běh zdrojů nepodporuje.
