Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.Extensions.BlameDataCollector/Resources/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AbortedTestRun
source: The active Test Run was aborted because the host process exited unexpectedly. Please inspect the call stack above, if available, to get more information about where the exception originated from. The test running when the crash occurred: {0} This test may, or may not be the source of the crash.
cs: Aktivní testovací běh se přerušil, protože proces hostitele se neočekávaně ukončil. Prověřte prosím výše zásobník volání, pokud je k dispozici. Nabídne vám další informace o původu výjimky. Test, který běžel, když došlo k chybovému ukončení: {0} Tento test může a nemusí být příčinou chybového ukončení.
de: Der aktive Testlauf wurde abgebrochen, weil der Hostprozess unerwartet beendet wurde. Überprüfen Sie die oben aufgeführte Aufrufliste, falls verfügbar, um weitere Informationen zur Ursache der Ausnahme zu erhalten. Beim Absturz ausgeführter Test: {0} Dieser Test kann, muss aber nicht unbedingt die Absturzursache sein.
es: La serie de pruebas activa se anuló porque el proceso de host se cerró de forma inesperada. Compruebe la pila de llamadas anterior, si está disponible, para obtener más información sobre el origen de la excepción. Prueba en ejecución cuando se produjo el bloqueo: {0} Esta prueba puede ser el origen del bloqueo o no serlo.
it: L'esecuzione dei test attiva è stata interrotta perché il processo host è stato terminato in modo imprevisto. Esaminare lo stack di chiamate in alto, se disponibile, per ottenere altre informazioni sull'origine dell'eccezione. Test in esecuzione quando si è verificato l'arresto anomalo: {0} Il test potrebbe essere l'origine dell'arresto anomalo.
ko: 호스트 프로세스가 예기치 않게 종료되어 활성 테스트 실행이 중단되었습니다. 사용 가능한 경우 예외가 발생한 위치에 대한 자세한 정보를 보려면 위의 호출 스택을 검사하세요. 크래시가 발생했을 때 실행 중이었던 테스트: {0} 이 테스트는 크래시의 원인이거나 원인이 아닐 수 있습니다.
pl: Aktywny przebieg testu został przerwany, ponieważ proces hosta nieoczekiwanie zakończył działanie. Sprawdź powyższy stos wywołań, jeśli jest dostępny, aby uzyskać więcej informacji na temat miejsca, z którego pochodzi wyjątek. Test uruchomiony w momencie wystąpienia awarii: {0} Ten test może, ale nie musi być źródłem awarii.
pt_br: A Execução de Teste ativa foi anulada porque o processo do host foi encerrado inesperadamente. Inspecione a pilha de chamadas acima, caso ela esteja disponível, para obter mais informações sobre a origem da exceção. O teste em execução quando a falha ocorreu: {0} Esse teste pode ser a origem da falha ou não.
ru: Активный тестовый запуск был прерван из-за непредвиденного завершения хост-процесса. Просмотрите стек вызовов выше (если он доступен), чтобы получить дополнительные сведения об источнике исключения. Тест, который выполнялся в момент возникновения сбоя: {0} Этот тест может являться источником сбоя.

# ProcDumpEnvVarEmpty
source: Required environment variable PROCDUMP_PATH was null or empty. Set PROCDUMP_PATH to path of folder containing appropriate procdump executable.
cs: Vyžadovaná proměnná prostředí PROCDUMP_PATH má hodnotu Null nebo je prázdná. Nastavte pro ni cestu ke složce obsahující příslušný spustitelný soubor ProcDump.
de: Die erforderliche Umgebungsvariable PROCDUMP_PATH war NULL oder leer. Legen Sie PROCDUMP_PATH auf den Pfad des Ordners fest, der die geeignete ausführbare procdump-Datei enthält.
es: La variable de entorno PROCDUMP_PATH requerida era NULL o estaba vacía. Establezca PROCDUMP_PATH en la ruta de acceso de la carpeta que contiene el ejecutable procdump correcto.
fr: La variable d'environnement exigée PROCDUMP_PATH était null ou vide. Affectez à PROCDUMP_PATH le chemin du dossier contenant l'exécutable procdump approprié.
it: La variabile di ambiente PROCDUMP_PATH richiesta è Null o vuota. Impostare PROCDUMP_PATH sul percorso della cartella che contiene il file eseguibile appropriato di procdump.
ja: 必須の環境変数 PROCDUMP_PATH は Null または空でした。PROCDUMP_PATH を、適切な procdump 実行可能ファイルを含むフォルダーのパスに設定してください。
ko: 필요한 환경 변수 PROCDUMP_PATH가 null이거나 비어 있습니다. 적절한 procdump 실행 파일이 포함된 폴더의 경로에 PROCDUMP_PATH를 설정하세요.
pl: Wymagana zmienna środowiskowa PROCDUMP_PATH miała wartość null lub była pusta. Ustaw zmienną PROCDUMP_PATH na ścieżkę lub folder zawierające odpowiedni plik wykonywalny procdump.
pt_br: A variável de ambiente obrigatória PROCDUMP_PATH era nula ou estava vazia. Defina PROCDUMP_PATH para o caminho da pasta que contém o executável procdump apropriado.
ru: Требуемая переменная среды PROCDUMP_PATH была пустой или имела значение NULL. Задайте для PROCDUMP_PATH путь к папке, содержащей нужный исполняемый файл procdump.
tr: Gerekli ortam değişkeni PROCDUMP_PATH null veya boştu. PROCDUMP_PATH değişkenini uygun yürütülebilir procdump içeren klasörün yoluna ayarlayın.
zh_hans: 所需环境变量 PROCDUMP_PATH 为空。请将 PROCDUMP_PATH 设为包含适当的可执行进程转储的文件夹路径。
zh_hant: 必要的環境變數 PROCDUMP_PATH 為 null 或是空的。請將 PROCDUMP_PATH 設定為包含適當之 procdump 可執行檔之資料夾的路徑。

# DumpFileNotGeneratedErrorMessage
source: Collect dump was enabled but no dump file was generated.
cs: Bylo povoleno shromáždění výpisu, ale nebyl vygenerován žádný soubor výpisu.
de: Die Abbilderfassung war aktiviert, aber es wurde keine Abbilddatei generiert.
es: La opción para recopilar un volcado de memoria estaba habilitada, pero no se generó ningún archivo de volcado de memoria.
fr: La collecte de fichiers dump a été activée, mais aucun fichier dump n'a été généré.
it: La raccolta del dump è stata abilitata ma non è stato generato alcun file di dump.
ja: ダンプの収集は有効化されましたが、ダンプ ファイルは生成されませんでした。
ko: 덤프 수집이 사용하도록 설정되었지만 덤프 파일이 생성되지 않았습니다.
pl: Zbieranie zrzutów zostało włączone, ale nie wygenerowano żadnego pliku zrzutu.
pt_br: A coleta de despejo estava habilitada, mas não foi gerado nenhum arquivo de despejo.
ru: Сбор дампа включен, но файл дампа не создан.
tr: Döküm toplama etkindi, ancak hiçbir döküm dosyası oluşturulmamıştı.
zh_hans: 收集转储已启用，但是未生成转储文件。
zh_hant: 已啟用了收集傾印，但未產生任何傾印檔。

# BlameParameterKeyIncorrect
source: The blame parameter key specified {0} is not valid. Ignoring this key.
cs: Zadaný klíč parametru blame {0} není platný. Tento klíč se bude ignorovat.
de: Der angegebene blame-Parameterschlüssel "{0}" ist ungültig. Dieser Schlüssel wird ignoriert.
es: La clave de parámetro blame especificada {0} no es válida. Se omitirá esta clave.
fr: La clé de paramètre blame spécifiée {0} n'est pas valide. Cette clé est ignorée.
it: La chiave specificata {0} del parametro di Blame non è valida e verrà ignorata.
ja: 指定された blame パラメーター キー {0} は無効です。このキーは無視されます。
ko: 지정된 blame 매개 변수 키 {0}이(가) 잘못되었습니다. 이 키를 무시합니다.
pl: Podany klucz parametru blame {0} nie jest prawidłowy. Ten klucz jest ignorowany.
pt_br: A chave de parâmetro de blame especificada {0} é inválida. Ignorando esta chave.
ru: Указанный ключ {0} параметра Blame недопустим. Он будет пропущен.
tr: Belirtilen blame parametresi anahtarı {0} geçerli değil. Bu anahtar yoksayılıyor.
zh_hans: 指定的追责参数键 {0} 无效。忽略此键。
zh_hant: 指定的 blame 參數索引鍵 {0} 無效。即將忽略此索引鍵。

# BlameParameterValueIncorrect
source: The blame parameter key {0}, has incorrect value: {1}. Supported values are: {2}
cs: Klíč parametru blame {0} má nesprávnou hodnotu: {1}. Podporované hodnoty jsou: {2}
de: Der \"blame\"-Parameterschlüssel {0}, hat einen falschen Wert: {1}. Unterstützte Werte: {2}
es: La clave del parámetro de culpa {0} tiene un valor incorrecto: {1}. Los valores admitidos son: {2}
it: La chiave del parametro di errore {0}, ha un valore non corretto: {1}. I valori supportati sono: {2}
ko: 원인 매개 변수 키 {0}에 잘못된 값 {1}이(가) 있습니다. 지원되는 값은 {2}입니다.
pl: Klucz parametru blame {0} ma niepoprawną wartość: {1}. Obsługiwane wartości to: {2}
pt_br: A chave de parâmetro {0}, tem um valor incorreto: {1}. Os valores com suporte são: {2}
ru: Ключ параметра вины {0} имеет неверное значение{1}: . Поддерживаемые значения:{2}

# ProcDumpCouldNotStart
source: Could not start process dump: {0}
cs: Nešlo spustit výpis procesu: {0}
de: Prozesssicherung konnte nicht gestartet werden: {0}
es: No se ha podido iniciar el volcado de proceso: {0}
fr: Impossible de démarrer le fichier dump du processus : {0}
it: Non è stato possibile avviare il dump del processo: {0}
ja: プロセス ダンプを開始できませんでした: {0}
ko: 프로세스 덤프를 시작할 수 없음: {0}
pl: Nie można rozpocząć zrzutu procesu: {0}
pt_br: Não foi possível iniciar o processo de despejo: {0}
ru: Не удалось запустить дамп процесса: {0}
tr: İşlem dökümü başlatılamadı: {0}
zh_hans: 无法启动进程转储: {0}
zh_hant: 無法啟動處理序傾印: {0}

# ProcDumpNotGenerated
source: CollectDump was enabled but dump file was not generated.
cs: Byla povolena funkce CollectDump, ale soubor výpisu nebyl vygenerován.
de: CollectDump war aktiviert, aber es wurde keine Abbilddatei generiert.
es: CollectDump estaba habilitado pero no se ha generado el archivo de volcado.
fr: CollectDump a été activé, mais le fichier dump n'a pas été généré.
it: CollectDump è stato abilitato ma non è stato generato alcun file di dump.
ja: CollectDump は有効になりましたが、ダンプ ファイルは生成されませんでした。
ko: CollectDump가 사용하도록 설정되었지만 덤프 파일이 생성되지 않았습니다.
pl: Opcja CollectDump została włączona, ale nie wygenerowano pliku zrzutu.
pt_br: CollectDump foi habilitado, mas o arquivo de despejo não foi gerado.
ru: Параметр CollectDump включен, но файл дампа не был создан.
tr: CollectDump etkindi, ancak döküm dosyası oluşturulmamıştı.
zh_hans: CollectDump 已启用，但是未生成转储文件。
zh_hant: CollectDump 已啟用，但未產生傾印檔案。

# InactivityTimeout
source: The specified inactivity time of {0} {1} has elapsed. Collecting hang dumps from testhost and its child processes
cs: Zadaná doba nečinnosti {0} {1} vypršela. Shromažďují se výpisy při zablokování z hostitele testhost a jeho podřízených procesů.
de: Die angegebene Inaktivitätszeit von {0} {1} ist abgelaufen. Vom Testhost und den untergeordneten Prozessen werden Stillstandsicherungen erfasst.
es: El tiempo de inactividad de {0} {1} que se ha especificado ha transcurrido. Recopilando volcados de bloqueos del host de pruebas y sus procesos secundarios
fr: Le délai d'inactivité spécifié ({0} {1}) s'est écoulé. Collecte d'images mémoire des plantages de l'hôte de test et de ses processus enfants
it: Il tempo di inattività specificato di {0} {1} è scaduto. Verranno raccolti i dump in sospeso da testhost e dai relativi processi figlio
ja: 指定された非アイドル時間 {0} {1} が経過しました。testhost およびその子プロセスからのハング ダンプを収集しています
ko: 지정한 비활성 시간({0}{1})이 경과되었습니다. Testhost 및 해당 자식 프로세스에서 중단 덤프를 수집하는 중
pl: Upłynął czas nieaktywności {0} {1}. Zbieranie zrzutów podczas zawieszenia z procesu testhost i jego procesów podrzędnych
pt_br: O tempo de inatividade especificado de {0} {1} foi decorrido. Coletando os despejos do travamento do testhost e dos processos filho
ru: Указанное время неактивности {0} {1} истекло. Сбор дампов зависаний из тестового узла и его дочерних процессов.
tr: Belirtilen {0} {1} etkinlik dışı kalma süresi geçti. Testhost ve alt işlemlerinden askı dökümleri toplanıyor
zh_hans: 指定的非活动时间({0} {1})已过。正在从测试主机及其子进程中收集挂起的转储
zh_hant: 指定的非使用狀態時間已經過 {0} {1}。正在從 testhost 及其子處理序收集停止回應的傾印

# UnexpectedValueForInactivityTimespanValue
source: Unexpected value '{0}' provided as timeout. Please provide a value in this format: 1.5h / 90m / 5400s / 5400000ms / 5400000
cs: Jako časový limit se přidala neočekávaná hodnota {0}. Zadejte prosím hodnotu v tomto formátu: 1.5h / 90m / 5400s / 5400000ms / 5400000
de: Unerwarteter Wert "{0}" als Timeout angegeben. Geben Sie einen Wert in folgendem Format an: 1.5h / 90m / 5400s / 5400000ms / 5400000
es: Valor inesperado "{0}" proporcionado como tiempo de espera. Indique un valor en este formato: 1.5h / 90m / 5400s / 5400000ms / 5400000
fr: Valeur inattendue '{0}' fournie en tant que délai d'expiration. Indiquez une valeur au format suivant : 1.5h / 90m / 5400s / 5400000ms / 5400000
it: Il valore '{0}', specificato come timeout, è imprevisto. Specificare un valore in questo formato: 1.5h / 90m / 5400s / 5400000ms / 5400000
ja: 予期しない値 '{0}' がタイムアウトとして指定されました。次の形式で値を指定してください: 1.5h、90m、5400s、5400000ms、5400000
ko: 예기치 않은 값 '{0}'이(가) 시간 제한으로 제공되었습니다. 1.5h/90m/5400s/5400000ms/5400000 형식으로 값을 제공하세요.
pl: Podano nieoczekiwaną wartość „{0}” jako limit czasu. Podaj wartość w następującym formacie: 1.5h / 90m / 5400s / 5400000ms / 5400000
pt_br: Valor inesperado '{0}' fornecido como tempo limite. Forneça um valor neste formato: 1.5h/90m/5400s/5400000ms/5400000
ru: В качестве времени ожидания указано непредвиденное значение "{0}". Укажите значение в следующем формате: 1.5h / 90m / 5400s / 5400000ms / 5400000
tr: Zaman aşımı olarak beklenmeyen '{0}' değeri sağlandı. Lütfen şu biçimde bir değer girin: 1.5h / 90m / 5400s / 5400000ms / 5400000
zh_hans: 提供了意外的值“{0}”作为超时。请按以下格式提供值: 1.5h / 90m / 5400s / 5400000ms / 5400000
zh_hant: 提供了非預期的值 '{0}' 作為逾時。請提供以下格式的值: 1.5h / 90m / 5400s / 5400000ms / 5400000

# NotGeneratingSequenceFile
source: All tests finished running, Sequence file will not be generated
cs: Všechny testy se dokončily. Soubor sekvence se nevygeneruje.
de: Alle Tests wurden ausgeführt. Die Datei "Sequence" wird nicht generiert.
es: Todas las pruebas han terminado de ejecutarse; no se generará el archivo Sequence.
fr: Tous les tests ont fini de s'exécuter. Le fichier de séquence ne sera pas généré
it: L'esecuzione di tutti i test è stata completata. Il file di sequenza non verrà generato
ja: すべてのテストの実行が完了しました。Sequence ファイルは生成されません
ko: 모든 테스트 실행이 완료되었지만, 시퀀스 파일이 생성되지 않습니다.
pl: Wszystkie testy zakończyły działanie, plik sekwencji nie zostanie wygenerowany
pt_br: A execução de todos os testes foi concluída. O arquivo de sequência não será gerado.
ru: Все тесты завершены, файл последовательности не будет создан.
tr: Tüm testlerin çalışması tamamlandı. Dizi dosyası oluşturulmayacak.
zh_hans: 所有测试都已运行完毕，将不生成序列文件
zh_hant: 所有測試皆已執行完成，將不會產生 Sequence 檔案

# Dumping
source: Dumping {0} - {1}
cs: Vytváří se výpis pro {0} – {1}
de: "{1}" ({0}) wird gesichert.
es: Volcando {0} - {1}
fr: Création d'une image mémoire {0} - {1}
it: Dump di {0} - {1}
ja: {0} - {1} をダンプしています
ko: 덤프 {0} - {1}
pl: Tworzenie zrzutu: {0} — {1}
pt_br: Despejando {0} – {1}
ru: Создание дампа {0} — {1}
tr: {0} - {1} dökümü oluşturuluyor
zh_hans: 正在转储 {0} - {1}
zh_hant: 正在傾印 {0} - {1}

# DumpingTree
source: Dumping this process tree (from bottom)
cs: Vytváří se výpis tohoto stromu procesu (zespod)
de: Diese Prozessstruktur wird gesichert (von unten).
es: Volcando este árbol de procesos (desde abajo)
fr: Création d'une image mémoire de cette arborescence de processus (à partir du bas)
it: Dump di questo albero processi (dal basso)
ja: このプロセス ツリーをダンプしています (下から)
ko: 이 프로세스 트리 덤핑(아래쪽에서)
pl: Tworzenie zrzutu tego drzewa procesów (od dołu)
pt_br: Despejando esta árvore de processos (da parte inferior)
ru: Создание дампа для этого дерева процессов (из нижней части)
tr: Bu işlem ağacının dökümü alınıyor (alttan)
zh_hans: 正在转储此进程树(从底部)
zh_hant: 正在傾印此處理序樹狀結構 (從底部)

source: minutes
cs: minuty
de: Minuten
es: minutos
it: minuti
ja: 分
ko: 분
pl: min
pt_br: minutos
ru: мин
tr: dakika
zh_hans: 分钟
zh_hant: 分鐘

source: seconds
cs: sekundy
de: Sekunden
es: segundos
fr: secondes
it: secondi
ja: 秒
ko: 초
pl: s
pt_br: segundos
ru: с
tr: saniye
zh_hans: 秒
zh_hant: 秒

# ProcDumpNotFound
source: {0} could not be found, please make sure that the executable is available on PATH. Alternatively set PROCDUMP_PATH environment variable to a directory that contains {0} executable
cs: {0} nelze najít. Zkontrolujte, zda je spustitelný soubor k dispozici v cestě PATH, případně nastavte proměnnou prostředí PROCDUMP_PATH na adresář, který obsahuje spustitelný soubor {0}.
de: {0} wurde nicht gefunden. Stellen Sie sicher, dass die ausführbare Datei unter PATH verfügbar ist. Legen Sie alternativ die Umgebungsvariable PROCDUMP_PATH auf ein Verzeichnis fest, das {0} ausführbare Datei enthält.
es: no se encontró {0}. Cerciórese de que el ejecutable está disponible en PATH o establezca variable de entorno PROCDUMP_PATH en un directorio que contenga {0} ejecutable
it: {0} non è stato trovato, verificare che il file eseguibile sia disponibile in PATH. In alternativa, impostare la variabile di ambiente PROCDUMP_PATH su una directory che contiene {0} eseguibile
ko: {0}을(를) 찾을 수 없습니다. 실행 파일을 PATH에서 사용할 수 있는지 확인합니다. 또는 PROCDUMP_PATH 환경 변수를 {0} 실행 파일이 포함된 디렉터리로 설정하세요.
pl: Nie można odnaleźć pliku wykonywalnego {0}. Upewnij się, że plik wykonywalny jest dostępny w ścieżce PATH. Możesz też ustawić zmienną środowiskową PROCDUMP_PATH na katalog zawierający plik wykonywalny {0}.
pt_br: {0} não pôde ser encontrado, verifique se o executável está disponível no CAMINHO. Alternativamente, defina a variável de ambiente PROCDUMP_PATH para um diretório que contenha o executável {0}
ru: Не удалось найти {0}. Убедитесь, что исполняемый файл доступен в PATH. Также можно настроить переменную среды PROCDUMP_PATH, указав каталог, содержащий исполняемый файл {0}.

# MonitorPostmortemDebuggerInvalidDumpDirectoryPathParameter
source: Invalid 'DumpDirectoryPath' for postmortem debugger monitor
cs: Neplatná vlastnost DumpDirectoryPath pro monitorování ladicího programu postmortem
de: Ungültiger "DumpDirectoryPath" für Postmortemdebuggermonitor
es: 'DumpDirectoryPath' no válido para el monitor del depurador post mortem
it: Il valore di 'DumpDirectoryPath' non è valido per il monitoraggio del debugger effettuato dopo che l'applicazione è terminata.
ko: 사후 디버거 모니터에 대한 잘못된 'DumpDirectoryPath'
pl: Nieprawidłowy element „DumpDirectoryPath” dla monitora debugera postmortem
pt_br: 'DumpDirectoryPath' inválido para o monitor do depurador postmortem
ru: Недопустимый DumpDirectoryPath для монитора отладчика с разбором итогов

# AbortedTestRun
source: The active Test Run was aborted because the host process exited unexpectedly. Please inspect the call stack above, if available, to get more information about where the exception originated from. The test running when the crash occurred: {0} This test may, or may not be the source of the crash.
fr: La série de tests active a été abandonnée, car le processus hôte s'est arrêté de manière inattendue. Inspectez la pile des appels ci-dessus, le cas échéant, pour obtenir plus d'informations sur l'origine de l'exception. Test en cours d'exécution au moment du plantage : {0} Ce test est éventuellement à l'origine du plantage.
ja: ホスト プロセスが予期せずに終了したため、アクティブなテストの実行が中止されました。(使用可能な場合) 上記の呼び出し履歴を調べて、例外の発生元に関する詳細情報を取得してください。 クラッシュの発生時に実行中だったテスト: {0} このテストは、必ずしもクラッシュの原因ではない場合もあります。
tr: Konak işleminden beklenmedik şekilde çıkış yapıldığından etkin Test Çalıştırması durduruldu. Özel durumun kaynağı hakkında daha fazla bilgi almak için varsa yukarıdan çağrı yığınını inceleyin. Kilitlenme oluştuğunda çalışan test: {0} Bu test, kilitlenmenin kaynağı olmayabilir veya olmayabilir.
zh_hans: 活动的测试运行已中止，因为主机进程意外退出。请检查上面的调用堆栈(如果有)，以获取有关异常来源的详细信息。 发生崩溃时运行的测试: {0} 此测试可能是(也可能不是)崩溃的来源。
zh_hant: 因為主機處理序在未預期的狀況下結束，所以已中止使用中的測試回合。請檢查上方的呼叫堆疊 (若有的話)，以取得例外狀況來源的詳細資訊。 發生損毀時正在執行的測試: {0} 此測試可能是或不是損毀的來源。

# BlameParameterValueIncorrect
source: The blame parameter key {0} can only support values {1}/{2}. Ignoring this key.
fr: La clé de paramètre blame {0} peut prendre en charge uniquement les valeurs {1}/{2}. Cette clé est ignorée.
ja: blame パラメーター キー {0} は値 {1}/{2} のみをサポートします。このキーは無視されます。
tr: Belirtilen blame parametresi anahtarı {0} yalnızca {1}/{2} değerlerini destekleyebilir. Bu anahtar yoksayılıyor.
zh_hans: 追责参数键 {0} 只支持值 {1}/{2}。忽略此键。
zh_hant: blame 參數索引鍵 {0} 僅支援值 {1}/{2}。即將忽略此索引鍵。
