Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# RunSettingsArgumentHelp
source: --Settings|/Settings:<Settings File> Settings to use when running tests.
de: --Settings|/Settings: <Einstellungsdatei> Beim Ausführen von Tests zu verwendende Einstellungen.
es: --Settings|/Settings:<archivoConfiguración> Configuración que se usará cuando se ejecuten pruebas.
fr: --Settings|/Settings:<fichier de paramètres> Paramètres à utiliser durant l'exécution des tests.
it: --Settings|/Settings:<FileImpostazioni> Impostazioni da usare per l'esecuzione dei test.
ja: --Settings|/Settings:<Settings File> テストを実行する際に使用する設定です。
pl: --Settings|/Settings:<plik ustawień> Ustawienia, które mają być używane podczas uruchamiania testów.
pt_br: --Settings|/Settings:<Settings File> Configurações a serem usadas ao executar testes.
ru: --Settings|/Settings:<файл параметров> Параметры для использования при запуске тестов.
tr: --Settings|/Settings:<Ayarlar Dosyası> Testleri çalıştırırken kullanılacak ayarlar.
zh_hant: --Settings|/Settings:<設定檔> 執行測試時要使用的設定。

# RunSettingsRequired
source: The /Settings parameter requires a settings file to be provided.
de: Für den Parameter "/Settings" muss eine Einstellungsdatei angegeben werden.
es: El parámetro /Settings requiere que se proporcione un archivo de configuración.
fr: Le paramètre /Settings nécessite un fichier de paramètres.
it: Con il parametro /Settings è necessario specificare un file di impostazioni.
ja: /Settings パラメーターには、設定ファイルを指定する必要があります。
pl: Parametr /Settings wymaga podania pliku ustawień.
pt_br: O parâmetro /Settings exige que um arquivo de configurações seja fornecido.
ru: Для параметра /Settings требуется указать файл параметров.
tr: /Settings parametresi bir ayarlar dosyasının belirtilmesini gerektirir.
zh_hant: /Settings 參數要求必須提供設定檔。

# RunSettingsFileNotFound
source: The Settings file '{0}' could not be found.
de: Die Einstellungsdatei "{0}" wurde nicht gefunden.
es: No se encuentra el archivo de configuración '{0}'.
fr: Le fichier de paramètres '{0}' est introuvable.
it: Il file di impostazioni '{0}' non è stato trovato.
ja: 設定ファイル '{0}' が見つかりませんでした。
pl: Nie można odnaleźć pliku ustawień „{0}”.
pt_br: O arquivo de Configurações '{0}' não pôde ser encontrado.
ru: Не удалось найти файл параметров "{0}".
tr: '{0}' Ayarlar dosyası bulunamadı.
zh_hant: 找不到設定檔 '{0}'。

source: Test Run Failed.
de: Fehler beim Testlauf.
es: No se pudo ejecutar la serie de pruebas.
fr: Échec de la série de tests.
it: L'esecuzione dei test non è riuscita.
ja: テストの実行に失敗しました。
pl: Przebieg testu nie powiódł się.
pt_br: Falha na Execução de Teste.
ru: Сбой тестового запуска.
tr: Test Çalıştırması Başarısız.
zh_hant: 測試回合失敗。

source: Test Run Successful.
de: Der Testlauf war erfolgreich.
es: La serie de pruebas se ejecutó correctamente.
fr: Série de tests réussie.
it: L'esecuzione dei test è riuscita.
ja: テストの実行に成功しました。
pl: Przebieg testu zakończony powodzeniem.
pt_br: Execução de Teste Bem-sucedida.
ru: Тестовый запуск выполнен.
tr: Test Çalıştırması Başarılı.
zh_hant: 測試回合成功。

# InvalidInIsolationCommand
source: Argument {0} is not expected in the 'InIsolation' command. Specify the command without the argument (Example: vstest.console.exe myTests.dll /InIsolation) and try again.
de: Das Argument "{0}" wird im Befehl "InIsolation" nicht erwartet. Geben Sie den Befehl ohne das Argument an (Beispiel: vstest.console.exe myTests.dll /InIsolation), und versuchen Sie es erneut.
es: El argumento {0} no se espera en el comando 'InIsolation'. Especifique el comando sin este argumento (por ejemplo: vstest.console.exe myTests.dll /InIsolation) y vuelva a intentarlo.
fr: L'argument {0} n'est pas attendu dans la commande 'InIsolation'. Spécifiez la commande sans l'argument (exemple : vstest.console.exe myTests.dll /InIsolation), puis réessayez.
it: L'argomento {0} non è previsto nel comando 'InIsolation'. Specificare il comando senza l'argomento, ad esempio: vstest.console.exe myTests.dll /InIsolation, quindi riprovare.
ja: 'InIsolation' コマンドでは、引数 {0} は適切ではありません。引数なしでコマンドを指定し (例: vstest.console.exe myTests.dll /InIsolation)、もう一度お試しください。
pl: Argument {0} nie jest oczekiwany w poleceniu „InIsolation”. Określ polecenie bez argumentu (przykład: vstest.console.exe mojeTesty.dll /InIsolation) i spróbuj ponownie.
pt_br: O argumento {0} não é esperado no comando 'InIsolation'. Especifique o comando sem o argumento (exemplo: vstest.console.exe myTests.dll /InIsolation) e tente novamente.
ru: Аргумент {0} не ожидается в команде InIsolation. Укажите команду без аргумента (например, vstest.console.exe myTests.dll /InIsolation) и повторите попытку.
tr: {0} bağımsız değişkeni 'InIsolation' komutunda beklenmiyor. Komutu bağımsız değişken olmadan belirtin (Örnek: vstest.console.exe myTests.dll /InIsolation) ve yeniden deneyin.
zh_hant: 'InIsolation' 命令中不應該使用引數 {0}。請指定不加引數的命令 (範例: vstest.console.exe myTests.dll /InIsolation)，並再試一次。

# UseVsixExtensionsValueRequired
source: The /UseVsixExtensions parameter requires a value. If 'true', the installed VSIX extensions (if any) will be used in the test run. If false, they will be ignored. Example: /UseVsixExtensions:true
de: Der /UseVsixExtensions-Parameter erfordert einen Wert. Wenn TRUE, werden die installierten VSIX-Extensions (falls vorhanden) im Testlauf verwendet. Wenn FALSE, werden sie ignoriert. Beispiel: /UseVsixExtensions:true
es: El parámetro /UseVsixExtensions requiere un valor. Si es “true”, se usarán las extensiones VSIX instaladas (si las hay) en la serie de pruebas. Si es “false”, se omitirá. Ejemplo: /UseVsixExtensions:true
fr: Le paramètre /UseVsixExtensions nécessite une valeur. Si la valeur est 'true', les extensions VSIX installées (le cas échéant) sont utilisées dans la série de tests. Si la valeur est false, elles sont ignorées. Exemple : /UseVsixExtensions:true
it: Con il parametro /UseVsixExtensions è richiesto un valore. Se è 'true', le estensioni VSIX eventualmente installate verranno usate nell'esecuzione dei test. Se è false, verranno ignorate. Esempio: /UseVsixExtensions:true
ja: /UseVsixExtensions パラメーターに値を指定する必要があります。'true' を指定すると、インストール済みの VSIX 拡張機能 (ある場合) がテストの実行で使用されます。false を指定すると、これらは無視されます。例: /UseVsixExtensions:true
pl: Parametr /UseVsixExtensions wymaga podania wartości. Jeśli wartość to „true”, zainstalowane rozszerzenia VSIX (jeśli istnieją) zostaną użyte w ramach przebiegu testu. Jeśli wartość to „false”, rozszerzenia zostaną zignorowane. Przykład: /UseVsixExtensions:true
pt_br: O parâmetro /UseVsixExtensions requer um valor. Se ele for 'true', as extensões VSIX instaladas (caso haja alguma) serão usadas na execução de teste. Se ele for false, elas serão ignoradas. Exemplo: /UseVsixExtensions:true
ru: Для параметра /UseVsixExtensions требуется значение. Если задано значение true, установленные расширения VSIX (при наличии) будут использоваться в тестовом запуске. Если задано значение false, то они будут игнорироваться. Пример: /UseVsixExtensions:true
tr: /UseVsixExtensions parametresi bir değer gerektiriyor. Değer 'true' ise test çalıştırmasında yüklü VSIX uzantıları (varsa) kullanılır. Değer false ise uzantılar yoksayılır. Örnek: /UseVsixExtensions:true
zh_hant: /UseVsixExtensions 參數需要一個值。如果為 'true'，已安裝的 VSIX 延伸模組 (如果有的話) 將用於測試回合。如果為 false，則會加以忽略。範例: /UseVsixExtensions:true

# InvalidUseVsixExtensionsCommand
source: Argument {0} is not expected in the 'UseVsixExtensions' command. Specify the command indicating whether the vsix extensions should be used or skipped (Example: vstest.console.exe myTests.dll /UseVsixExtensions:true) and try again.
de: Das Argument "{0}" wird im Befehl "UseVsixExtensions" nicht erwartet. Geben Sie den Befehl mit der Angabe an, ob die VSIX-Extensions verwendet oder übersprungen werden sollen (Beispiel: vstest.console.exe myTests.dll /UseVsixExtensions:true), und versuchen Sie es erneut.
es: El argumento {0} no se espera en el comando 'UseVsixExtensions'. Especifique el comando indicando si deben usarse u omitirse las extensiones vsix (ejemplo: vstest.console.exe myTests.dll /UseVsixExtensions:true) y vuelva a intentarlo.
fr: L'argument {0} n'est pas attendu dans la commande 'UseVsixExtensions'. Spécifiez la commande indiquant si les extensions vsix doivent être utilisées ou ignorées (exemple : vstest.console.exe myTests.dll /UseVsixExtensions:true), puis réessayez.
it: L'argomento {0} non è previsto nel comando 'UseVsixExtensions'. Specificare il comando indicando se le estensioni vsix devono essere usate o ignorate, ad esempio vstest.console.exe myTests.dll /UseVsixExtensions:true, quindi riprovare.
ja: 'UseVsixExtensions' コマンドでは、引数 {0} は適切ではありません。vsix 拡張機能を使用するのかスキップするのかを示すコマンドを指定し (例: vstest.console.exe myTests.dll /UseVsixExtensions:true)、もう一度お試しください。
pl: Argument {0} nie jest oczekiwany w poleceniu „UseVsixExtensions”. Określ polecenie wskazujące, czy rozszerzenia vsix mają zostać użyte, czy pominięte (przykład: vstest.console.exe mojeTesty.dll /UseVsixExtensions:true), a następnie spróbuj ponownie.
pt_br: O argumento {0} não é esperado no comando 'UseVsixExtensions'. Especifique o comando que indica se as extensões vsix devem ser usadas ou ignoradas (exemplo: vstest.console.exe myTests.dll /UseVsixExtensions:true) e tente novamente.
ru: Аргумент {0} не ожидается в команде UseVsixExtensions. Укажите команду, определяющую, требуется ли использовать или игнорировать расширения VSIX (например, vstest.console.exe myTests.dll /UseVsixExtensions:true), и повторите попытку.
tr: {0} bağımsız değişkeni 'UseVsixExtensions' komutunda beklenmiyor. Komutta vsix uzantılarının kullanılacağını veya atlanacağını belirtin (Örnek: vstest.console.exe myTests.dll /UseVsixExtensions:true) ve yeniden deneyin.
zh_hant: 'UseVsixExtensions' 命令中不應該使用引數 {0}。請指定命令指出應該使用或略過 VSIX 延伸模組 (範例: vstest.console.exe myTests.dll /UseVsixExtensions:true) 並再試一次。

# InIsolationHelp
source: --InIsolation|/InIsolation Runs the tests in an isolated process. This makes vstest.console.exe process less likely to be stopped on an error in the tests, but tests may run slower.
de: /InIsolation/InIsolation Führt die Tests in einem isolierten Prozess aus. Auf diese Weise ist es unwahrscheinlicher, dass der Prozess "vstest.console.exe" bei einem Fehler in den Tests beendet wird. Tests werden aber ggf. langsamer ausgeführt.
es: --InIsolation|/InIsolation Ejecuta las pruebas en un proceso aislado. De ese modo, es menos probable que el proceso vstest.console.exe se detenga ante un error en las pruebas, pero es posible que las pruebas se ejecuten con más lentitud.
fr: --InIsolation|/InIsolation Exécute les tests dans un processus isolé. Le processus vstest.console.exe est moins susceptible de s'arrêter en cas d'erreur durant les tests, mais ces derniers risquent de s'exécuter plus lentement.
it: --InIsolation|/InIsolation Esegue i test in un processo isolato. In questo modo è meno probabile che il processo vstest.console.exe venga arrestato in caso di errore nei test, che però potrebbero risultare più lenti.
ja: --InIsolation|/InIsolation 分離プロセスでテストを実行します。これにより、vstest.console.exe プロセスがテスト時にエラーで停止する可能性は低くなりますが、 テストの速度が遅くなる場合があります。
pl: --InIsolation|/InIsolation Uruchamia testy w procesie izolowanym. Dzięki temu mniej prawdopodobne jest zatrzymanie procesu vstest.console.exe po wystąpieniu błędu w testach, ale testy mogą działać wolniej.
pt_br: --InIsolation|/InIsolation Executa os testes em um processo isolado. Isso diminui a probabilidade de que o processo vstest.console.exe seja interrompido em um erro nos testes, mas os testes podem ficar mais lentos.
ru: --InIsolation|/InIsolation Запуск тестов в изолированном процессе. Это снижает вероятность остановки процесса vstest.console.exe из-за ошибки в тестах, но тесты могут выполняться медленнее.
tr: --InIsolation|/InIsolation Testleri yalıtılmış bir işlemde çalıştırır. Bu, vstest.console.exe işleminin testlerdeki bir hata nedeniyle durdurulması olasılığını azaltır, ancak testler daha yavaş çalışabilir.
zh_hant: --InIsolation|/InIsolation 在隔離的處理序中執行測試。這樣會降低 vstest.console.exe 處理序在測試中發生錯誤而停止的可能性，但是測試 可能會執行得較慢。

# UseVsixExtensionsHelp
source: /UseVsixExtensions This makes vstest.console.exe process use or skip the VSIX extensions installed(if any) in the test run. Example /UseVsixExtensions:true
de: /UseVsixExtensions Bewirkt, dass der Prozess "vstest.console.exe" die installierten VSIX-Extensions (sofern vorhanden) im Testlauf verwendet oder überspringt. Beispiel /UseVsixExtensions:true
es: /UseVsixExtensions Hace que el proceso vstest.console.exe utilice u omita las extensiones VSIX instaladas (si las hay) en la serie de pruebas. Ejemplo: /UseVsixExtensions:true
fr: /UseVsixExtensions Le processus vstest.console.exe utilise ou ignore les extensions VSIX installées (le cas échéant) durant la série de tests. Exemple : /UseVsixExtensions:true
it: /UseVsixExtensions Determina se il processo vstest.console.exe usa o ignora le estensioni VSIX eventualmente installate nell'esecuzione dei test. Esempio: /UseVsixExtensions:true
ja: /UseVsixExtensions これにより、テストの実行で vstest.console.exe プロセスによってインストール済みの VSIX 拡張機能 (ある場合) が使用またはスキップされます。 例 /UseVsixExtensions:true
pl: /UseVsixExtensions Powoduje to, że proces vstest.console.exe używa lub pomija zainstalowane rozszerzenia VSIX (jeśli istnieją) w przebiegu testu. Przykład: /UseVsixExtensions:true
pt_br: /UseVsixExtensions Faz o processo vstest.console.exe usar ou ignorar as extensões VSIX instaladas (caso haja alguma) na execução de teste. Exemplo /UseVsixExtensions:true
ru: /UseVsixExtensions Определяет использование или пропуск процессом vstest.console.exe установленных расширений VSIX (при наличии) в тестовом запуске. Пример: /UseVsixExtensions:true
tr: /UseVsixExtensions Bu işlem vstest.console.exe işleminin test çalıştırmasında yüklü VSIX uzantılarını (varsa) kullanmasını veya atlamasını sağlar. Örnek /UseVsixExtensions:true
zh_hant: /UseVsixExtensions 這可讓 vstest.console.exe 處理序使用或略過測試回合中 已安裝的 VSIX 延伸模組 (如果有的話)。 範例 /UseVsixExtensions:true

# BatchSizeRequired
source: The /BatchSize argument requires the size of the batch. Example: /BatchSize:10
de: Das Argument "/BatchSize" erfordert die Größe des Batches. Beispiel: /BatchSize:10
es: El argumento /BatchSize requiere el tamaño del lote. Ejemplo: /BatchSize:10
fr: L'argument /BatchSize nécessite la taille du lot. Exemple : /BatchSize:10
it: Con l'argomento /BatchSize sono richieste le dimensioni del batch. Esempio: /BatchSize:10
ja: /BatchSize 引数には、バッチのサイズが必要です。例: /BatchSize:10
pl: Argument /BatchSize wymaga podania wielkości partii. Przykład: /BatchSize:10
pt_br: O argumento /BatchSize requer o tamanho do lote. Exemplo: /BatchSize:10
ru: Для аргумента /BatchSize требуется указать размер пакета. Пример: /BatchSize:10
tr: /BatchSize bağımsız değişkeni toplu iş boyutunu gerektirir. Örnek: /BatchSize:10
zh_hant: /BatchSize 引數必須有批次的大小。範例: /BatchSize:10

# InvalidBatchSize
source: Invalid batch size {0}. The batch size should be greater than zero. Example: /BatchSize:10
de: Ungültige Batchgröße {0}. Die Batchgröße muss größer als null sein. Beispiel: /BatchSize:10
es: Tamaño de lote no válido ({0}). El tamaño de lote debe ser mayor que cero. Ejemplo: /BatchSize:10
fr: Taille de lot non valide {0}. La taille du lot doit être supérieure à zéro. Exemple : /BatchSize:10
it: Le dimensioni {0} del batch non sono valide. Devono essere maggiori di zero. Esempio: /BatchSize:10
ja: バッチ サイズ {0} は無効です。バッチ サイズには、0 より大きい値を指定してください。例: /BatchSize:10
pl: Rozmiar partii {0} jest nieprawidłowy. Rozmiar partii powinien być większy niż zero. Przykład: /BatchSize:10
pt_br: Tamanho do lote inválido {0}. O tamanho do lote deve ser maior que zero. Exemplo: /BatchSize:10
ru: Недопустимый размер пакета {0}. Размер пакета должен быть больше нуля. Пример: /BatchSize:10
tr: {0} toplu iş boyutu geçersiz. Toplu iş boyutu sıfırdan büyük olmalıdır. Örnek: /BatchSize:10
zh_hant: 批次大小無效 {0}。批次大小應該大於零。範例: /BatchSize:10

# Examples
source: To run tests: >vstest.console.exe tests.dll To run tests with additional settings such as data collectors: >vstest.console.exe tests.dll /Settings:Local.RunSettings
de: Zum Ausführen von Tests: >vstest.console.exe tests.dll Zum Ausführen von Tests mit zusätzlichen Einstellungen wie etwa Datensammlern: >vstest.console.exe tests.dll /Settings:Local.RunSettings
es: Para ejecutar pruebas: >vstest.console.exe tests.dll Para ejecutar pruebas con configuración adicional como recolectores de datos: >vstest.console.exe tests.dll /Settings:Local.RunSettings
fr: Pour exécuter les tests : >vstest.console.exe tests.dll Pour exécuter les tests avec des paramètres supplémentaires, par exemple des collecteurs de données : >vstest.console.exe tests.dll /Settings:Local.RunSettings
it: Per eseguire test: >vstest.console.exe tests.dll Per eseguire test con impostazioni aggiuntive, quali agenti di raccolta dati: >vstest.console.exe tests.dll /Settings:Local.RunSettings
ja: テストを実行する: >vstest.console.exe tests.dll テストをデータ コレクターなどの追加設定を指定して実行する: >vstest.console.exe tests.dll /Settings:Local.RunSettings
pl: Aby uruchomić testy: >vstest.console.exe tests.dll Aby uruchomić testy z użyciem ustawień dodatkowych, takich jak moduły zbierające dane: >vstest.console.exe tests.dll /Settings:Local.RunSettings
pt_br: Para executar testes: >vstest.console.exe tests.dll Para executar testes com configurações adicionais, como coletores de dados: >vstest.console.exe tests.dll /Settings:Local.RunSettings
ru: Для запуска тестов: >vstest.console.exe tests.dll Для запуска тестов с дополнительными параметрами, например со сборщиками данных: >vstest.console.exe tests.dll /Settings:Local.RunSettings
tr: Testleri çalıştırmak için: >vstest.console.exe tests.dll Testleri veri toplayıcılar gibi ek ayarlarla çalıştırmak için: >vstest.console.exe tests.dll /Settings:Local.RunSettings
zh_hant: 若要執行測試: >vstest.console.exe tests.dll 若要使用資料收集器一類的其他設定執行測試: >vstest.console.exe tests.dll /Settings:Local.RunSettings

# ListDiscoverersHelp
source: /ListDiscoverers Lists installed test discoverers.
de: / ListDiscoverers Listet die installierten Testdiscoverer auf.
es: /ListDiscoverers Enumera los programas de detección de pruebas instalados.
fr: /ListDiscoverers Liste les découvreurs de tests installés.
it: /ListDiscoverers Elenca gli agenti di individuazione test installati.
ja: /ListDiscoverers インストール済みのテスト探索プログラムを一覧表示します。
pl: /ListDiscoverers Wyświetla listę zainstalowanych wykrywaczy testów.
pt_br: /ListDiscoverers Lista os discoverers de teste instalados.
ru: /ListDiscoverers Список установленных средств обнаружения тестов.
tr: /ListDiscoverers Yüklü test bulucuları listeler.
zh_hant: /ListDiscoverers 列出已安裝的測試探索程式。

# ListExecutorsHelp
source: /ListExecutors Lists installed test executors.
de: / ListExecutors Listet die installierten Testexecutors auf.
es: /ListExecutors Enumera los ejecutores de pruebas instalados.
fr: /ListExecutors Liste les exécuteurs de tests installés.
it: /ListExecutors Elenca gli executor di test installati.
ja: /ListExecutors インストール済みのテスト実行プログラムを一覧表示します。
pl: /ListExecutors Wyświetla listę zainstalowanych modułów wykonywania testów.
pt_br: /ListExecutors Lista os executores de teste instalados.
ru: /ListExecutors Список установленных исполнителей тестов.
tr: /ListExecutors Yüklü test yürütücülerini listeler.
zh_hant: /ListExecutors 列出已安裝的測試執行程式。

# ListLoggersHelp
source: /ListLoggers Lists installed test loggers.
de: / ListLoggers Listet die installierten Testprotokollierungen auf.
es: /ListLoggers Enumera los registradores de pruebas instalados.
fr: /ListLoggers Liste les enregistreurs d'événements de tests installés.
it: /ListLoggers Elenca i logger di test installati.
ja: /ListLoggers インストール済みのテスト ロガーを一覧表示します。
pl: /ListLoggers Wyświetla listę zainstalowanych rejestratorów testów.
pt_br: /ListLoggers Lista os agentes de teste instalados.
ru: /ListLoggers Список установленных средств ведения журналов тестирования.
tr: /ListLoggers Yüklü test günlükçülerini listeler.
zh_hant: /ListLoggers 列出已安裝的測試記錄器。

# ListSettingsProvidersHelp
source: /ListSettingsProviders Lists installed test settings providers.
de: / ListSettingsProviders Listet die installierten Testeinstellungenanbieter auf.
es: /ListSettingsProviders Enumera los proveedores de configuración de pruebas instalados.
fr: /ListSettingsProviders Liste les fournisseurs de paramètres de test installés.
it: /ListSettingsProviders Elenca i provider di impostazioni test installati.
ja: /ListSettingsProviders インストール済みのテスト設定プロバイダーを一覧表示します。
pl: /ListSettingsProviders Wyświetla listę zainstalowanych dostawców ustawień testów.
pt_br: /ListSettingsProviders Lista os provedores de configurações de teste instalados.
ru: /ListSettingsProviders Список установленных поставщиков параметров тестирования.
tr: /ListSettingsProviders Yüklü test ayarları sağlayıcılarını listeler.
zh_hant: /ListSettingsProviders 列出已安裝的測試設定提供者。

# ListTestsHelp
source: -lt|--ListTests|/lt|/ListTests:<File Name> Lists all discovered tests from the given test container.
de: -lt|--ListTests|/lt|/ListTests:<Dateiname> Listet alle ermittelten Tests aus dem angegebenen Testcontainer auf.
es: -lt|--ListTests|/lt|/ListTests:<nombreArchivo Muestra todas las pruebas detectadas del contenedor de pruebas especificado.
fr: -lt|--ListTests|/lt|/ListTests:<nom de fichier> Liste tous les tests découverts dans le conteneur de tests spécifié.
it: -lt|--ListTests|/lt|/ListTests:<Nome file> Elenca tutti i test individuati dal contenitore di test specificato.
ja: -lt|--ListTests|/lt|/ListTests:<ファイル名> 指定されたテスト コンテナーから、すべての探索されたテストを一覧表示します。
pl: -lt|--ListTests|/lt|/ListTests:<nazwa pliku> Wyświetla listę wszystkich wykrytych testów z danego kontenera testów.
pt_br: -lt|--ListTests|/lt|/ListTests:<Nome do Arquivo> Lista todos os testes descobertos do contêiner de testes fornecido.
ru: -lt|--ListTests|/lt|/ListTests:<имя файла> Список всех обнаруженных тестов из определенного контейнера для тестирования.
tr: -lt|--ListTests|/lt|/ListTests:<Dosya Adı> Verilen test kapsayıcısında bulunan tüm testleri listeler.
zh_hant: -lt|--ListTests|/lt|/ListTests:<檔案名稱> 列出從指定測試容器探索到的所有測試。

source: Time elapsed :
de: Verstrichene Zeit:
es: Tiempo transcurrido:
fr: Temps écoulé :
it: Tempo trascorso:
ja: 経過時間:
pl: Czas, który upłynął:
pt_br: Tempo decorrido:
ru: Прошло времени:
tr: Geçen süre:
zh_hant: 經過時間:

# SpecificTestsRequired
source: The /Tests argument requires one or more specific test names or their substrings. Examples: /Tests:TestsMethod1, /Tests:TestMethod1,method2
de: Das /Tests-Argument erfordert mindestens einen bestimmten Testnamen oder seine Teilzeichenfolgen. Beispiele: /Tests:TestsMethod1, /Tests:TestMethod1,method2
es: El argumento /Tests requiere uno o varios nombres de pruebas específicas o sus subcadenas. Ejemplos: /Tests:MétodoDePrueba1, /Tests:MétodoDePrueba1,método2
fr: L'argument /Tests nécessite un ou plusieurs noms de tests spécifiques ou leurs sous-chaînes. Exemples : /Tests:TestsMethod1, /Tests:TestMethod1,method2
it: Con l'argomento /Tests sono richiesti uno o più nomi di test specifici o relative sottostringhe. Esempi: /Tests:TestsMethod1, /Tests:TestMethod1,method2
ja: /Tests 引数には、1 つ以上の特定のテスト名またはその部分文字列が必要です。 例: /Tests:TestsMethod1、/Tests:TestMethod1,method2
pl: Argument /Tests wymaga co najmniej jednej określonej nazwy testu lub jej podciągu. Przykłady: /Tests:MetodaTestowa1, /Tests:MetodaTestowa1,metoda2
pt_br: O argumento /Tests requer um ou mais nomes de teste específicos ou suas subcadeias de caracteres. Exemplos: /Tests:TestsMethod1, /Tests:TestMethod1,method2
ru: Для аргумента /Tests требуется указать один или несколько конкретных имен тестов или их подстрок. Примеры: /Tests:TestsMethod1, /Tests:TestMethod1, method2
tr: /Tests bağımsız değişkeni, alt dizelerinde bir veya daha fazla belirli test adının olmasını gerektirir. Örnekler: /Tests:TestsMethod1, /Tests:TestMethod1,method2
zh_hant: /Tests 引數必須有一或多個特定的測試名稱或它們的子字串。 範例: /Tests:TestsMethod1, /Tests:TestMethod1,method2
