Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# DisablingCodeCoverageInAppContainerTestExecution
source: Code coverage is not available for Windows Store apps. Code coverage analysis skipped for this test run.
de: Code Coverage ist für Windows Store-Apps nicht verfügbar. Die Code Coverage-Analyse wird für diesen Testlauf übersprungen.
es: La cobertura de código no está disponible para aplicaciones de la Tienda Windows. Se omitirá el análisis de cobertura de código para esta serie de pruebas.
fr: La couverture du code n'est pas disponible pour les applications du Windows Store. L'analyse de la couverture du code a été ignorée pour cette série de tests.
it: Il code coverage non è disponibile per le app di Windows Store. L'analisi del code coverage verrà ignorata per questa esecuzione dei test.
ja: Windows ストア アプリではコード カバレッジを使用できません。このテスト実行ではコード カバレッジ分析はスキップされました。
pl: Pokrycie kodu nie jest dostępne dla aplikacji ze Sklepu Windows. Pominięto analizę pokrycia kodu dla tego przebiegu testu.
pt_br: A cobertura do teste não está disponível para aplicativos da Windows Store. Análise de cobertura de código ignorada nesta execução de teste.
ru: Покрытие кода недоступно для приложений для Магазина Windows. Анализ покрытия кода пропущен для этого тестового запуска.
tr: Kod kapsamı Windows Mağazası uygulamaları için kullanılamaz. Bu test çalıştırması için kod kapsamı analizi atlandı.
zh_hant: Windows 市集應用程式無法使用程式碼涵蓋範圍。將略過這個測試回合的程式碼涵蓋範圍分析。

# SomeTestsUnavailableAfterFiltering
source: A total of {0} tests were discovered but some tests do not match the specified selection criteria({1}). Use right value(s) and try again.
de: Insgesamt {0} Tests wurden ermittelt, aber einige Tests stimmen nicht mit den angegebenen Auswahlkriterien ({1}) überein. Verwenden Sie die richtigen Werte, und versuchen Sie es erneut.
es: Se ha detectado un total de {0} pruebas, pero algunas no coinciden con los criterios de selección especificados ({1}). Use valores correctos y vuelva a intentarlo.
fr: Au total, {0} tests ont été découverts mais certains d'entre eux ne correspondent pas aux critères de sélection spécifiés ({1}). Utilisez les valeurs appropriées, puis réessayez.
it: In totale sono stati individuati {0} test, ma alcuni test non corrispondono ai criteri di selezione specificati ({1}). Usare i valori corretti e riprovare.
ja: 合計 {0} 個のテストが検出されましたが、指定された選択条件 ({1}) に一致しないテストがあります。適切な値を使用して、もう一度お試しください。
pl: Wykryto łącznie następującą liczbę testów: {0}. Niektóre z nich nie są zgodne z określonymi kryteriami wyboru ({1}). Użyj prawidłowych wartości i spróbuj ponownie.
pt_br: Foram descobertos {0} testes no total, mas alguns testes não correspondem ao critério de seleção especificado ({1}). Use valores corretos e tente novamente.
ru: Всего обнаружено тестов: {0}, но некоторые тесты не соответствуют указанному условию выбора ({1}). Задайте правильные значения и повторите попытку.
tr: Toplam {0} test bulundu, ancak bazı testler belirtilen ölçütlerle eşleşmiyor({1}). Doğru değerleri kullanın ve yeniden deneyin.
zh_hant: 已探索到總計 {0} 個測試，但有些測試不符合指定的選取準則 ({1})。請使用正確的值並再試一次。

# TestAdapterPathHelp
source: --TestAdapterPath|/TestAdapterPath This makes vstest.console.exe process use custom test adapters from a given path (if any) in the test run. Example /TestAdapterPath:<pathToCustomAdapters>
de: --TestAdapterPath|/TestAdapterPath Bewirkt, dass der Prozess "vstest.console.exe" benutzerdefinierte Testadapter aus einem angegebenen Pfad (falls vorhanden) im Testlauf verwendet. Beispiel: /TestAdapterPath:<pathToCustomAdapters>
es: --TestAdapterPath|/TestAdapterPath Permite que el proceso vstest.console.exe use adaptadores de pruebas personalizados de una ruta de acceso especificada (si existe alguna) en la serie de pruebas. Ejemplo /TestAdapterPath:<rutaAAdaptadoresPersonalizados>
fr: --TestAdapterPath|/TestAdapterPath Le processus vstest.console.exe utilise des adaptateurs de tests personnalisés à partir du chemin spécifié (le cas échéant) dans la série de tests. Exemple : /TestAdapterPath:<chemin d'adaptateurs personnalisés>
it: --TestAdapterPath|/TestAdapterPath Determina se il processo vstest.console.exe usa adattatori di test personalizzati da un percorso eventualmente specificato nell'esecuzione dei test. Esempio /TestAdapterPath:<percorsoAdattatoriPersonalizzati>
ja: --TestAdapterPath|/TestAdapterPath テストの実行で、vstest.console.exe プロセスが指定されたパス (ある場合) からのカスタム テスト アダプターを使用するようにします。 例 /TestAdapterPath:<pathToCustomAdapters>
pl: --TestAdapterPath | / TestAdapterPath Powoduje to, że proces vstest.console.exe używa niestandardowych adapterów testowych z podanej ścieżki (jeśli istnieje) w ramach przebiegu testu. Przykład: /TestAdapterPath:<ścieżka do adapterów niestandardowych>
pt_br: --TestAdapterPath|/TestAdapterPath Faz com que o processo de vstest.console.exe use adaptadores de teste personalizados de um determinado caminho (caso haja algum) na execução de teste. Examplo /TestAdapterPath:<pathToCustomAdapters>
ru: --TestAdapterPath|/TestAdapterPath Определяет использование процессом vstest.console.exe пользовательских адаптеров тестов по заданному пути (если имеется) в тестовом запуске. Пример: /TestAdapterPath:<путь_к_пользовательским_адаптерам>
tr: --TestAdapterPath|/TestAdapterPath Bu, vstest.console.exe işleminin test çalıştırmasında verilen yoldan (varsa) özel test bağdaştırıcılarını kullanmasını sağlar. Örnek /TestAdapterPath:<özelBağdaştırıcılarınYolu>
zh_hant: --TestAdapterPath|/TestAdapterPath 這可讓 vstest.console.exe 處理序在測試回合中使用 給定路徑 (如果有的話) 中的自訂測試配接器。 範例 /TestAdapterPath:<pathToCustomAdapters>

# TestAdapterPathValueRequired
source: The /TestAdapterPath parameter requires a value, which is path of a location containing custom test adapters. Example: /TestAdapterPath:c:\MyCustomAdapters
de: Der /TestAdapterPath-Parameter erfordert einen Wert. Dabei handelt es sich um den Pfad eines Speicherorts mit benutzerdefinierten Testadaptern. Beispiel: /TestAdapterPath:c:\MeineBenutzerdefiniertenAdapter
es: El parámetro /TestAdapterPath requiere un valor, que es la ruta de acceso de una ubicación que contiene adaptadores de prueba personalizados. Ejemplo: /TestAdapterPath:c:\MyCustomAdapters
fr: Le paramètre /TestAdapterPath nécessite une valeur qui représente le chemin des adaptateurs de tests personnalisés. Exemple : /TestAdapterPath:c:\MyCustomAdapters
it: Con il parametro /TestAdapterPath è richiesto un valore, corrispondente al percorso di una posizione contenente adattatori di test personalizzati. Esempio: /TestAdapterPath:c:\MyCustomAdapters
ja: /TestAdapterPath パラメーターには、値として、カスタム テスト アダプターがある場所のパスが必要です。例: /TestAdapterPath:c:\MyCustomAdapters
pl: Parametr /TestAdapterPath wymaga wartości, którą jest ścieżką do lokalizacji zawierającej niestandardowe adaptery testowe. Przykład: /TestAdapterPath:c:\MojeAdapteryNiestandardowe
pt_br: O parâmetro /TestAdapterPath exige um valor, que é o caminho de um local contendo adaptadores de teste personalizados. Exemplo: /TestAdapterPath:c:\MyCustomAdapters
ru: Для параметра /TestAdapterPath требуется значение, представляющее собой путь к расположению с пользовательскими адаптерами тестов. Пример: /TestAdapterPath:c:\MyCustomAdapters
tr: /TestAdapterPath parametresi, özel test bağdaştırıcıları içeren bir konumun yolu olan değeri gerektirir. Örnek: /TestAdapterPath:c:\MyCustomAdapters
zh_hant: /TestAdapterPath 參數需要一個值，這個值是包含自訂測試配接器之位置的路徑。範例: /TestAdapterPath:c:\MyCustomAdapters

# InvalidTestAdapterPathCommand
source: The path '{0}' specified in the 'TestAdapterPath' is invalid. Error: {1}
de: Der in "TestAdapterPath" angegebene Pfad "{0}" ist ungültig. Fehler: {1}
es: La ruta de acceso '{0}' especificada en 'TestAdapterPath' no es válida. Error: {1}
fr: Le chemin '{0}' spécifié dans 'TestAdapterPath' est non valide. Erreur : {1}
it: Il percorso '{0}' specificato in 'TestAdapterPath' non è valido. Errore: {1}
ja: 'TestAdapterPath' に指定されているパス '{0}' は無効です。エラー: {1}
pl: Ścieżka „{0}” określona w parametrze „TestAdapterPath” jest nieprawidłowa. Błąd: {1}
pt_br: O caminho '{0}' especificado em 'TestAdapterPath' é inválido. Erro: {1}
ru: Путь {0}, заданный в параметре TestAdapterPath, недопустим. Ошибка: {1}
tr: 'TestAdapterPath' içinde belirtilen '{0}' yolu geçersiz. Hata: {1}
zh_hant: 'TestAdapterPath' 中指定的路徑 '{0}' 無效。錯誤: {1}

# TestAdapterPathDoesNotExist
source: The custom test adapter search path provided was not found, provide a valid path and try again.
de: Der angegebene benutzerdefinierte Testadapter-Suchpfad wurde nicht gefunden. Geben Sie einen gültigen Pfad an, und versuchen Sie es erneut.
es: No se encuentra la ruta de búsqueda de adaptadores de prueba personalizados especificada. Proporcione una ruta de acceso válida y vuelva a intentarlo.
fr: Le chemin de recherche fourni pour l'adaptateur de test personnalisé est introuvable. Indiquez un chemin valide, puis réessayez.
it: Il percorso di ricerca dell'adattatore di test personalizzato non è stato trovato. Specificare un percorso valido e riprovare.
ja: カスタム テスト アダプターの指定された検索パスが見つかりませんでした。有効なパスを指定して、もう一度お試しください。
pl: Nie odnaleziono podanej ścieżki wyszukiwania niestandardowego adaptera testowego. Podaj prawidłową ścieżkę i spróbuj ponownie.
pt_br: O caminho de pesquisa do adaptador de teste personalizado fornecido não foi encontrado, forneça um caminho válido e tente novamente.
ru: Указанный путь поиска пользовательского адаптера теста не найден. Укажите допустимый путь и повторите попытку.
tr: Belirtilen özel test bağdaştırıcısı arama yolu bulunamadı; geçerli bir yol belirtin ve yeniden deneyin.
zh_hant: 找不到提供的自訂測試配接器搜尋路徑。請提供有效的路徑，並再試一次。

# NoAdaptersFoundInTestAdapterPath
source: The path '{0}' specified in the 'TestAdapterPath' does not contain any test adapters, provide a valid path and try again.
de: Der in "TestAdapterPath" angegebene Pfad "{0}" enthält keine Testadapter. Geben Sie einen gültigen Pfad an, und versuchen Sie es erneut.
es: La ruta de acceso '{0}' especificada en 'TestAdapterPath' no contiene ningún adaptador de prueba. Proporcione una ruta de acceso válida y vuelva a intentarlo.
fr: Le chemin '{0}' spécifié dans 'TestAdapterPath' ne contient aucun adaptateur de test. Indiquez un chemin valide, puis réessayez.
it: Il percorso '{0}' specificato in 'TestAdapterPath' non contiene alcun adattatore di test. Specificare un percorso valido e riprovare.
ja: 'TestAdapterPath' に指定されているパス '{0}' には、テスト アダプターがありません。有効なパスを指定して、もう一度お試しください。
pl: Ścieżka „{0}” określona w parametrze „TestAdapterPath” nie zawiera żadnych adapterów testowych. Podaj prawidłową ścieżkę i spróbuj ponownie.
pt_br: O caminho '{0}' especificado em 'TestAdapterPath' não contém nenhum adaptador de teste, forneça um caminho válido e tente novamente.
ru: Путь "{0}", заданный в параметре TestAdapterPath, не содержит адаптеров тестов. Укажите допустимый путь и повторите попытку.
tr: 'TestAdapterPath' içinde belirtilen '{0}' yolu hiçbir test bağdaştırıcısı içermiyor; geçerli bir yol belirtin ve yeniden deneyin.
zh_hant: 'TestAdapterPath' 中指定的路徑 '{0}' 不包含任何測試配接器。請提供有效的路徑，並再試一次。

# PhoneAppContainerTestPrerequisiteFail
source: Could not start test run for the tests for Windows Phone app: {0}.
de: Der Testlauf für die Tests für die Windows Phone-App konnte nicht gestartet werden: {0}.
es: No se puede iniciar la serie de pruebas para la aplicación de Windows Phone: {0}.
fr: Impossible de démarrer la série de tests pour les tests d'une application Windows Phone : {0}.
it: Non è stato possibile avviare l'esecuzione dei test per i test per l'app di Windows Phone: {0}.
ja: Windows Phone アプリに対するテストのテスト実行を開始できません: {0}。
pl: Nie można rozpocząć przebiegu testu dla testów dla aplikacji Windows Phone: {0}.
pt_br: Não foi possível iniciar a execução de testes para o aplicativo do Windows Phone: {0}.
ru: Не удалось запустить тестовый запуск для тестов приложений Windows Phone: {0}.
tr: Windows Phone uygulamasına yönelik testler için test çalıştırması başlatılamadı: {0}.
zh_hant: 無法為 Windows Phone 應用程式的測試啟動測試回合: {0}。

# SwitchToIsolationInPhoneAppContainerMode
source: Using Isolation mode to run unit tests for Windows Phone apps. Use the /InIsolation parameter to suppress this warning.
de: Der Isolationsmodus wird zum Ausführen der Komponententests für Windows Phone-Apps verwendet. Verwenden Sie den Parameter "/inIsolation", um diese Warnung zu unterdrücken.
es: Se usará el modo de aislamiento para ejecutar pruebas unitarias para aplicaciones de Windows Phone. Use el parámetro /InIsolation para suprimir esta advertencia.
fr: Utilisation du mode Isolation pour exécuter les tests unitaires des applications Windows Phone. Utilisez le paramètre /InIsolation pour supprimer cet avertissement.
it: Per eseguire gli unit test per le app di Windows Phone, verrà usata la modalità di isolamento. Usare il parametro /InIsolation per non visualizzare più questo avviso.
ja: Windows Phone アプリの単体テストを実行するために、分離モードを使用しています。この警告が表示されないようにするには、/InIsolation パラメーターを使用します。
pl: Używanie trybu izolacji do uruchamiania testów jednostkowych dla aplikacji systemu Windows Phone. Użyj parametru /InIsolation, aby pominąć to ostrzeżenie.
pt_br: Usando o modo de isolamento para executar testes de unidade para aplicativos do Windows Phone. Use o parâmetro /InIsolation para suprimir esse aviso.
ru: Использование режима изоляции для запуска модульных тестов приложений Windows Phone. Используйте параметр /InIsolation, чтобы отключить это предупреждение.
tr: Windows Phone uygulamaları için birim testlerini çalıştırmak üzere Yalıtım modu kullanılıyor. Bu uyarıyı kapatmak için /InIsolation parametresini kullanın.
zh_hant: 使用隔離模式執行 Windows Phone 應用程式的單元測試。使用 /InIsolation 參數可隱藏這個警告。

# DisablingCodeCoverageInPhoneAppContainerTestExecution
source: Code coverage is not available for Windows Phone apps. Code coverage analysis skipped for this test run.
de: Code Coverage ist für Windows Phone-Apps nicht verfügbar. Die Code Coverage-Analyse wird für diesen Testlauf übersprungen.
es: La cobertura de código no está disponible para aplicaciones de Windows Phone. Se omitirá el análisis de cobertura de código para esta serie de pruebas.
fr: La couverture du code n'est pas disponible pour les applications Windows Phone. L'analyse de la couverture du code a été ignorée pour cette série de tests.
it: Il code coverage non è disponibile per le app di Windows Phone. L'analisi del code coverage verrà ignorata per questa esecuzione dei test.
ja: Windows Phone アプリではコード カバレッジを使用できません。このテスト実行ではコード カバレッジ分析はスキップされました。
pl: Pokrycie kodu nie jest dostępne dla aplikacji systemu Windows Phone. Pominięto analizę pokrycia kodu dla tego przebiegu testu.
pt_br: A cobertura do teste não está disponível para aplicativos do Windows Phone. Análise de cobertura do teste ignorada nesta execução de teste.
ru: Покрытие кода недоступно для приложений Windows Phone. Анализ покрытия кода пропущен для этого тестового запуска.
tr: Kod kapsamı Windows Phone uygulamaları için kullanılamaz. Bu test çalıştırması için kod kapsamı analizi atlandı.
zh_hant: Windows Phone 應用程式無法使用程式碼涵蓋範圍。將略過這個測試回合的程式碼涵蓋範圍分析。

# DisablingDataCollectionInPhoneAppContainerTestExecution
source: Diagnostic data adapters are not supported when running unit tests for Windows Phone apps. Remove diagnostic data adapters settings from settings.
de: Adapter für diagnostische Daten werden beim Ausführen von Komponententests für Windows Phone-Apps nicht unterstützt. Entfernen Sie die Einstellungen für den Adapter für diagnostische Daten aus den Einstellungen.
es: No se admiten adaptadores de datos de diagnóstico cuando se ejecutan pruebas unitarias para aplicaciones de Windows Phone. Quite la configuración de adaptadores de datos de diagnóstico de la configuración.
fr: Les adaptateurs de données de diagnostic ne sont pas pris en charge durant l'exécution de tests unitaires pour les applications Windows Phone. Supprimez les adaptateurs de données de diagnostic des paramètres.
it: Gli adattatori dati di diagnostica non sono supportati durante l'esecuzione di unit test per app di Windows Phone. Rimuovere le impostazioni degli adattatori dati di diagnostica dalle impostazioni.
ja: Windows Phone アプリの単体テストの実行時は、診断データ アダプターはサポートされません。設定から診断データ アダプターの設定を削除してください。
pl: Adaptery danych diagnostycznych nie są obsługiwane podczas uruchamiania testów jednostkowych dla aplikacji systemu Windows Phone. Usuń ustawienia adapterów danych diagnostycznych z ustawień.
pt_br: Não há suporte para adaptadores de dados de diagnóstico ao executar testes de unidade para aplicativos do Windows Phone. Remova as configurações de adaptadores de dados de diagnóstico das configurações.
ru: Адаптеры диагностических данных не поддерживаются при запуске модульных тестов для приложений Windows Phone. Удалите параметры адаптеров диагностических данных из параметров.
tr: Windows Phone uygulamaları için birim testleri çalıştırılırken tanılama veri bağdaştırıcıları desteklenmiyor. Ayarlardan tanılama veri bağdaştırıcısı ayarlarını kaldırın.
zh_hant: 執行 Windows Phone 應用程式的單元測試時，不支援診斷資料配接器。請從設定中移除診斷資料配接器設定。

# PhoneNoTestEntryPoint
source: App package '{0}' does not has test executor entry point. For running unit tests for Windows Phone apps, create app package using Windows Phone Unit Test App project.
de: Das App-Paket "{0}" weist keinen Testexecutor-Einstiegspunkt auf. Erstellen Sie zum Ausführen von Komponententests für Windows Phone-Apps ein App-Paket mithilfe des Komponententest-Bibliotheksprojekts der Windows Phone-App.
es: El paquete de aplicación '{0}' no tiene un punto de entrada de ejecutor de pruebas. Para ejecutar pruebas unitarias de aplicaciones de Windows Phone, cree un paquete de aplicación usando el proyecto Aplicación de pruebas unitarias para Windows Phone.
fr: Le package d'application '{0}' n'a pas de point d'entrée pour l'exécuteur de tests. Pour exécuter les tests unitaires des applications Windows Phone, créez un package de l'application à l'aide du projet d'application de tests unitaires Windows Phone.
it: Il pacchetto dell'app '{0}' non contiene un punto di ingresso dell'executor di test. Per eseguire unit test per le app di Windows Phone, creare il pacchetto dell'app con il progetto App unit test di Windows Phone.
ja: アプリ パッケージ '{0}' に、テスト実行プログラムのエントリ ポイントがありません。Windows Phone アプリの単体テストを実行する場合は、Windows Phone 単体テスト アプリ プロジェクトを使用して、アプリ パッケージを作成してください。
pl: Pakiet aplikacji „{0}” nie ma punktu wejścia modułu wykonywania testów. Aby uruchamiać testy jednostkowe dla aplikacji systemu Windows Phone, utwórz projekt aplikacji testów jednostkowych systemu Windows Phone.
pt_br: O pacote do aplicativo '{0}' não tem o ponto de entrada do executor de teste. Para executar testes de unidade para aplicativos do Windows Phone, crie o pacote do aplicativo usando o projeto de Biblioteca de Teste de Unidade de aplicativo do Windows Phone.
ru: У пакета приложения "{0}" нет точки входа исполнителя тестов. Для запуска модульных тестов приложений Windows Phone создайте пакет приложения с помощью проекта приложения модульного тестирования Windows Phone.
tr: '{0}' uygulama paketi, test yürütücüsü giriş noktasına sahip değil. Windows Phone uygulamalarına yönelik birim testlerini çalıştırmak için Windows Phone Birim Testi Uygulaması projesini kullanarak uygulama paketini oluşturun.
zh_hant: 應用程式套件 '{0}' 沒有測試執行程式進入點。若要執行 Windows Phone 應用程式的單元測試，請使用 Windows Phone 單元測試應用程式專案建立應用程式套件。

# TestSettingsFrameworkMismatch
source: Using framework {0} to run the tests. Specify /Framework:{1} to suppress this warning.
de: Das Framework {0} wird zum Ausführen der Tests verwendet. Geben Sie /Framework:{1} an, um diese Warnung zu unterdrücken.
es: Se usará el marco {0} para ejecutar las pruebas. Especifique /Framework:{1} para suprimir esta advertencia.
fr: Utilisation du framework {0} pour exécuter les tests. Spécifiez /Framework:{1} pour supprimer cet avertissement.
it: Per eseguire i test, verrà usato il framework {0}. Specificare /Framework:{1} per non visualizzare più questo avviso.
ja: フレームワーク {0} を使用してテストを実行します。この警告を表示しないようにするには、/Framework:{1} を指定します。
pl: Używanie platformy {0} do uruchamiania testów. Określ parametr /Framework:{1}, aby pominąć to ostrzeżenie.
pt_br: Usando a estrutura {0} para executar os testes. Especifique /Framework:{1} para suprimir esse aviso.
ru: Использование платформы {0} для запуска тестов. Укажите /Framework:{1}, чтобы отключить это предупреждение.
tr: Testleri çalıştırmak için {0} çerçevesi kullanılıyor. Bu uyarıyı kapatmak için /Framework:{1} değerini belirtin.
zh_hant: 使用架構 {0} 執行測試。指定 /Framework:{1} 可隱藏這個警告。

# AppxBundleSourceWarning
source: No test found in the specified test containers. Additionally, Microsoft Windows Store Unit test adapter does not support .appxbundle files. Create an appx (set Generate App bundle option to Never) when creating App Package and try again.
de: Es wurde kein Test in den angegebenen Testcontainern gefunden. Darüber hinaus unterstützt der Microsoft Windows Store-Komponententestadapter keine APPXBUNDLE-Dateien. Erstellen Sie eine APPX-Datei (legen Sie die Option "App-Bundle generieren" auf "Nie" fest), wenn Sie das App-Paket erstellen, und versuchen Sie es erneut.
es: No se han encontrado pruebas en los contenedores de pruebas especificados. Además, el adaptador de pruebas unitarias de la Tienda Microsoft Windows no admite archivos .appxbundle. Cree un archivo .appx (establezca la opción Generar paquete de aplicaciones en Nunca) cuando cree el paquete de la aplicación y vuelva a intentarlo.
fr: Tests introuvables dans les conteneurs de tests spécifiés. De plus, l'Adaptateur de test unitaire Microsoft Windows Store ne prend pas en charge les fichiers .appxbundle. Créez un fichier .appx (affectez la valeur Jamais à l'option Générer l'ensemble d'applications) durant la création du package de l'application, puis réessayez.
it: Non è stato trovato alcun test nei contenitori di test specificati. L'adattatore di unit test di Microsoft Windows Store, inoltre, non supporta i file con estensione appxbundle. Durante la creazione di un pacchetto dell'app, creare un file appx impostando l'opzione Genera il bundle dell'app su Mai, quindi riprovare.
ja: 指定されたテスト コンテナーにテストが見つかりません。さらに、Microsoft Windows ストア単体テスト アダプターで .appxbundle ファイルがサポートされていません。アプリ パッケージの作成時に appx ([アプリ バンドルの生成] オプションを [しない] に設定) し、もう一度お試しください。
pl: Nie odnaleziono żadnych testów w określonych kontenerach testów. Ponadto adapter testów jednostkowych Sklepu Windows firmy Microsoft nie obsługuje plików appxbundle. Utwórz plik appx (ustaw opcję generowania zbioru aplikacji na wartość Nigdy) podczas tworzenia pakietu aplikacji, a następnie spróbuj ponownie.
pt_br: Nenhum teste foi encontrado nos contêineres de teste especificados. Além disso, o adaptador de teste de unidade da Microsoft Windows Store não dá suporte a arquivos .appxbundle. Crie um appx (defina a opção Gerar Pacote do Aplicativo como nunca) quando criar o Pacote do Aplicativo e tente novamente.
ru: В указанных контейнерах тестов тесты не найдены. Кроме того, адаптер модульных тестов для Магазина Windows (Майкрософт) не поддерживает APPXBUNDLE-файлы. Создайте APPX-файл (установите значение "Никогда" для параметра "Создать набор приложений") при создании пакета приложения и повторите попытку.
tr: Belirtilen test kapsayıcılarında test bulunamadı. Ayrıca, Microsoft Windows Mağazası Birim testi bağdaştırıcısı .appxbundle dosyalarını desteklemiyor. Uygulama Paketi oluştururken bir appx oluşturun (Uygulama paketi grubu oluştur seçeneğini Hiçbir Zaman olarak ayarlayın) ve yeniden deneyin.
zh_hant: 在指定的測試容器中找不到測試。此外，Microsoft Windows 市集單元測試配接器不支援 .appxbundle 檔案。請在建立應用程式套件時建立 appx (將 [產生應用程式套件組合] 選項設定為 [永不])，並再試一次。
