Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# NoTestsAvailableAfterFiltering
source: A total of {0} tests were discovered but no test matches the specified selection criteria({1}). Use right value(s) and try again.
de: Insgesamt {0} Tests wurden ermittelt, aber kein Test stimmt mit den angegebenen Auswahlkriterien ({1}) überein. Verwenden Sie die richtigen Werte, und versuchen Sie es erneut.
es: Se ha detectado un total de {0} pruebas, pero ninguna de ellas coincide con los criterios de selección especificados ({1}). Use valores correctos y vuelva a intentarlo.
fr: Au total, {0} tests ont été découverts mais aucun d'entre eux ne correspond aux critères de sélection spécifiés ({1}). Utilisez les valeurs appropriées, puis réessayez.
it: In totale sono stati individuati {0} test, ma nessuno corrisponde ai criteri di selezione specificati ({1}). Usare i valori corretti e riprovare.
ja: 合計 {0} 個のテストが検出されましたが、指定された選択条件 ({1}) に一致するテストはありません。適切な値を使用して、もう一度お試しください。
pl: Wykryto łącznie następującą liczbę testów: {0}. Żaden z nich nie jest zgodny z określonymi kryteriami wyboru ({1}). Użyj prawidłowych wartości i spróbuj ponownie.
pt_br: Foram descobertos {0} testes no total, mas nenhum teste corresponde ao critério de seleção especificado ({1}). Use valores corretos e tente novamente.
ru: Всего обнаружено тестов: {0}, но тесты не соответствуют указанному условию выбора ({1}). Задайте правильные значения и повторите попытку.
tr: Toplam {0} test bulundu, ancak belirtilen ölçütlerle eşleşen test yok({1}). Doğru değerleri kullanın ve yeniden deneyin.
zh_hant: 已探索到總計 {0} 個測試，但沒有測試符合指定的選取準則 ({1})。請使用正確的值，並再試一次。

# RunSpecificTestsHelp
source: --Tests|/Tests:<Test Names> Run tests with names that match the provided values. To provide multiple values, separate them by commas. Examples: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
de: --Tests|/Tests:<Testnamen> Führt Tests aus, deren Namen mit den angegebenen Werten übereinstimmen. Zum Bereitstellen mehrerer Werte trennen Sie diese durch Kommas. Beispiele: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
es: --Tests|/Tests:<nombres de pruebas> Ejecuta las pruebas con nombres que coinciden con los valores proporcionados. Para proporcionar varios valores, sepárelos con comas Ejemplos: /Tests:MétodoPrueba1 /Tests:MétodoPrueba1,MétodoPrueba2
fr: --Tests|/Tests:<noms de tests> Permet d'exécuter les tests dont les noms correspondent aux valeurs fournies. Pour fournir plusieurs valeurs, séparez-les par des virgules. Exemples : /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
it: --Tests|/Tests:<Nomi test> Esegue test con nomi corrispondenti ai valori specificati. Per specificare più valori, separarli con virgole. Esempi: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
ja: --Tests|/Tests:<Test Names> 指定された値に一致する名前のテストを実行します。複数の値を 指定する場合、コンマで区切ります。 例: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
pl: --Tests|/Tests:<nazwy testów> Uruchom testy z nazwami, które są zgodne z podanymi wartościami. Aby podać wiele wartości, oddziel je przecinkami. Przykłady: /Tests:MetodaTestowa1 /Tests:MetodaTestowa1,MetodaTestowa2
pt_br: --Tests|/Tests:<Test Names> Execute testes com nomes que correspondem aos valores fornecidos. Para fornecer vários valores, separe-os por vírgulas. Exemplos: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2
ru: --Tests|/Tests:<имена тестов> Выполнение тестов, имена которых соответствуют указанным значениям. Чтобы указать несколько значений, разделяйте их запятыми. Примеры: /Tests:TestMethod1 /Tests:TestMethod1, testMethod2
tr: --Tests|/Tests:<Test Adları> Sağlanan değerlerle eşleşen adlara sahip testleri çalıştırır. Birden çok değer sağlamak için, değerleri virgülle ayırın. Örnekler: /Tests:TestYöntemi1 /Tests:TestYöntemi1,testYöntemi2
zh_hant: --Tests|/Tests:<測試名稱> 執行測試，其名稱符合提供的值。若要 提供多個值，請使用逗點加以分隔。 範例: /Tests:TestMethod1 /Tests:TestMethod1,testMethod2

# SwitchToNoIsolation
source: Using Isolation mode to run the tests as diagnostic data adapters were enabled in the runsettings. Use the /inIsolation parameter to suppress this warning.
de: Der Isolationsmodus wird zum Ausführen der Tests verwendet, weil Adapter für diagnostische Daten in den "runsettings" aktiviert wurden. Verwenden Sie den Parameter "/inIsolation", um diese Warnung zu unterdrücken.
es: Se usará el modo de aislamiento para ejecutar las pruebas, ya que los adaptadores de datos de diagnóstico estaban habilitados en RunSettings. Use el parámetro de aislamiento /inIsolation para suprimir esta advertencia.
fr: Utilisation du mode Isolation pour exécuter les tests, car les adaptateurs de données de diagnostic ont été activés dans les paramètres d'exécution. Utilisez le paramètre /inIsolation pour supprimer cet avertissement.
it: Per eseguire i test, verrà usata la modalità di isolamento perché gli adattatori dati di diagnostica sono stati abilitati in runsettings. Usare il parametro /inIsolation per non visualizzare più questo avviso.
ja: 診断データ アダプターが実行設定で有効になっていたので、テストの実行に分離モードを使用しています。この警告が表示されないようにするには、/inIsolation パラメーターを使用します。
pl: Używanie trybu izolacji do uruchomienia testów jako adapterów danych diagnostycznych zostało włączone w pliku runsettings. Użyj parametru /inIsolation, aby pominąć to ostrzeżenie.
pt_br: Usando o modo de isolamento para executar os testes pois os adaptadores de dados de diagnóstico foram habilitados nas runsettings. Use o parâmetro /inIsolation para suprimir esse aviso.
ru: Используется режим изоляции для запуска тестов, так как в параметрах запуска включены адаптеры диагностических данных. Используйте параметр /InIsolation, чтобы отключить это предупреждение.
tr: runsettings içinde tanılama veri bağdaştırıcıları etkinleştirildiğinden testleri çalıştırmak üzere Yalıtım modu kullanılıyor. Bu uyarıyı kapatmak için /inIsolation parametresini kullanın.
zh_hant: 使用隔離模式執行測試，因為在 runsettings 中已啟用診斷資料配接器。使用 /inIsolation 參數可隱藏這個警告。

# SwitchToIsolationInAppContainerMode
source: Using Isolation mode to run unit tests for Windows Store apps. Use the /InIsolation parameter to suppress this warning.
de: Der Isolationsmodus wird zum Ausführen der Komponententests für Windows Store-Apps verwendet. Verwenden Sie den Parameter "/inIsolation", um diese Warnung zu unterdrücken.
es: Se usará el modo de aislamiento para ejecutar pruebas unitarias para aplicaciones de la Tienda Windows. Use el parámetro /InIsolation para suprimir esta advertencia.
fr: Utilisation du mode Isolation pour exécuter les tests unitaires des applications du Windows Store. Utilisez le paramètre /InIsolation pour supprimer cet avertissement.
it: Per eseguire gli unit test per le app di Windows Store, verrà usata la modalità di isolamento. Usare il parametro /InIsolation per non visualizzare più questo avviso.
ja: Windows ストア アプリの単体テストを実行するために、分離モードを使用しています。この警告が表示されないようにするには、/InIsolation パラメーターを使用します。
pl: Używanie trybu izolacji do uruchomienia testów jednostkowych dla aplikacji ze Sklepu Windows. Użyj parametru /InIsolation, aby pominąć to ostrzeżenie.
pt_br: Usando o modo de isolamento para executar testes de unidade para aplicativos da Windows Store. Use o parâmetro /InIsolation para suprimir esse aviso.
ru: Использование режима изоляции для запуска модульных тестов приложений для Магазина Windows. Используйте параметр /InIsolation, чтобы отключить это предупреждение.
tr: Windows Mağazası uygulamaları için birim testlerini çalıştırmak üzere Yalıtım modu kullanılıyor. Bu uyarıyı kapatmak için /InIsolation parametresini kullanın.
zh_hant: 使用隔離模式執行 Windows 市集應用程式的單元測試。使用 /InIsolation 參數可隱藏這個警告。

# DisablingDataCollectionInAppContainerTestExecution
source: Diagnostic data adapters are not supported when running unit tests for Windows Store apps. Remove diagnostic data adapters settings from settings.
de: Adapter für diagnostische Daten werden beim Ausführen von Komponententests für Windows Store-Apps nicht unterstützt. Entfernen Sie die Einstellungen für den Adapter für diagnostische Daten aus den Einstellungen.
es: No se admiten adaptadores de datos de diagnóstico cuando se ejecutan pruebas unitarias para aplicaciones de la Tienda Windows. Quite la configuración de adaptadores de datos de diagnóstico de la configuración.
fr: Les adaptateurs de données de diagnostic ne sont pas pris en charge durant l'exécution de tests unitaires pour les applications du Windows Store. Supprimez les adaptateurs de données de diagnostic des paramètres.
it: Gli adattatori dati di diagnostica non sono supportati durante l'esecuzione di unit test per app di Windows Store. Rimuovere le impostazioni degli adattatori dati di diagnostica dalle impostazioni.
ja: Windows ストア アプリの単体テストの実行時は、診断データ アダプターはサポートされません。設定から診断データ アダプターの設定を削除してください。
pl: Adaptery danych diagnostycznych nie są obsługiwane podczas uruchamiania testów jednostkowych dla aplikacji ze Sklepu Windows. Usuń ustawienia adapterów danych diagnostycznych z ustawień.
pt_br: Não há suporte para adaptadores de dados de diagnóstico ao executar testes de unidade para aplicativos da Windows Store. Remova as configurações de adaptadores de dados de diagnóstico das configurações.
ru: Адаптеры диагностических данных не поддерживаются при запуске модульных тестов для приложений для Магазина Windows. Удалите параметры адаптеров диагностических данных из параметров.
tr: Windows Mağazası uygulamaları için birim testleri çalıştırılırken tanılama veri bağdaştırıcıları desteklenmiyor. Ayarlardan tanılama veri bağdaştırıcısı ayarlarını kaldırın.
zh_hant: 執行 Windows 市集應用程式的單元測試時，不支援診斷資料配接器。請從設定中移除診斷資料配接器設定。

# LoggerFriendlyNameFormat
source: FriendlyName: {0}
es: Nombre descriptivo: {0}
it: Nome descrittivo: {0}
ja: 表示名: {0}
pl: Przyjazna nazwa: {0}
ru: Понятное имя: {0}

# ExtensionUriFormat
source: Uri: {0}
pl: Identyfikator URI: {0}

# SettingFormat
source: SettingName: {0}
es: Nombre de configuración: {0}
it: Nome impostazione: {0}
pl: Nazwa ustawienia: {0}
ru: Имя параметра: {0}

# SupportedFileTypesIndicator
source: Supported File Types:
de: Unterstützte Dateitypen:
es: Tipos de archivos admitidos:
fr: Types de fichier pris en charge :
it: Tipi di file supportati:
ja: サポートされているファイルの種類:
pl: Obsługiwane typy plików:
pt_br: Tipos de arquivos com suporte:
ru: Поддерживаемые типы файлов:
tr: Desteklenen Dosya Türleri:
zh_hant: 支援的檔案類型:

# UriOfDefaultExecutor
source: Default Executor Uri: {0}
de: Standard-Executor-URI: {0}
es: URI del ejecutor predeterminado: {0}
fr: URI de l'exécuteur par défaut : {0}
it: URI executor predefinito: {0}
ja: 既定の実行プログラムの URI: {0}
pl: Domyślny identyfikator URI modułu wykonywania: {0}
pt_br: URI do executor padrão: {0}
ru: URI исполнителя по умолчанию: {0}
tr: Varsayılan Yürütücü URI’si: {0}
zh_hant: 預設執行程式 URI: {0}

# LoggerUriFormat
source: Uri: {0}
pl: Identyfikator URI: {0}

# InvalidPlatformType
source: Invalid platform type:{0}. Valid platform types are x86, x64 and Arm.
de: Ungültiger Plattformtyp: {0}. Gültige Plattformtypen sind x86, x64 und Arm.
es: Tipo de plataforma no válido: {0}. Los tipos de plataforma válidos son x86, x64 y ARM.
fr: Type de plateforme non valide : {0}. Les types de plateforme valides sont x86, x64 et ARM.
it: Tipo piattaforma non valido: {0}. Tipi di piattaforma validi: x86, x64 e ARM.
ja: プラットフォームの種類が無効です: {0}。有効なプラットフォームの種類は、x86、x64、および Arm です。
pl: Nieprawidłowy typ platformy: {0}. Prawidłowe typy platform to x86, x64 i Arm.
pt_br: Tipo de plataforma inválido: {0}. Os tipos de plataforma válidos são x86, x64 e Arm.
ru: Неверный тип платформы: {0}. Допустимые типы платформы: x86, x64 и Arm.
tr: Geçersiz platform türü: {0}. Geçerli platform türleri x86, x64 ve ARM’dir.
zh_hant: 平台類型無效: {0}。有效的平台類型為 x86、x64 和 Arm。

# PlatformTypeRequired
source: The /Platform argument requires the target platform type for the test run to be provided. Example: /Platform:x86
de: Für das /Platform-Argument muss der Zielplattformtyp für den Testlauf angegeben werden. Beispiel: /Platform:x86
es: El argumento /Platform requiere que se proporcione el tipo de plataforma de destino para la serie de pruebas. Ejemplo: /Platform:x86
fr: Si vous utilisez l'argument /Platform, le type de plateforme cible de la série de tests doit être fourni. Exemple : /Platform:x86
it: L'argomento /Platform richiede il tipo di piattaforma di destinazione per l'esecuzione dei test. Ad esempio: /Platform:x86
ja: /Platform 引数には、テストの実行対象とするプラットフォームの種類を指定する必要があります。例: /Platform:x86
pl: Argument /Platform wymaga podania typu platformy docelowej dla przebiegu testu. Przykład: /Platform:x86
pt_br: O argumento /Platform requer que o tipo de plataforma de destino para a execução de teste seja fornecido. Exemplo: /Platform:x86
ru: Для аргумента /Platform требуется указать тип целевой платформы для тестового запуска. Пример: /Platform:x 86
tr: /Platform bağımsız değişkeni, test çalıştırması için hedef platform türünün belirtilmesini gerektirir. Örnek: /Platform:x86
zh_hant: /Platform 引數需要提供測試回合的目標平台類型。範例: /Platform:x86

# PlatformArgumentHelp
source: --Platform|/Platform:<Platform type> Target platform architecture to be used for test execution. Valid values are x86, x64 and ARM.
de: --Plattform|/Platform:<Plattformtyp> Die Zielplattformarchitektur, die für Ausführung verwendet werden soll. Gültige Werte sind x86, x64 und ARM.
es: --Platform|/Platform:<tipoPlataforma> Arquitectura de la plataforma de destino que se usará para la ejecución de pruebas. Los valores válidos son x86, x64 y ARM.
fr: --Platform|/Platform:<type de plateforme> Architecture de plateforme cible à utiliser pour l'exécution des tests. Les valeurs valides sont x86, x64 et ARM.
it: --Platform|/Platform:<Tipo di piattaforma> Architettura della piattaforma di destinazione da usare per l'esecuzione dei test. Valori validi: x86, x64 e ARM.
ja: --Platform|/Platform:<Platform type> テストの実行に使用するターゲット プラットフォームのアーキテクチャです。 有効な値は、x86、x64、ARM です。
pl: --Platform|/Platform:<typ platformy> Docelowa architektura platformy, która zostanie użyta do wykonania testu. Prawidłowe wartości to x86, x64 i ARM.
pt_br: --Platform|/Platform:<Platform type> Arquitetura da plataforma de destino a ser usada para a execução de teste. Os valores válidos são x86, x64 e ARM.
ru: --Platform|/Platform:<тип платформы> Архитектура целевой платформы для выполнения теста. Допустимые значения: x86, x64 и ARM.
tr: --Platform|/Platform:<Platform türü> Test yürütmesi için kullanılacak hedef platform mimarisi. Geçerli değerler x86, x64 ve ARM'dir.
zh_hant: --Platform|/Platform:<平台類型> 要用於測試執行的目標平台架構。 有效值為 x86、x64 和 ARM。

# SwitchToIsolationInMultiTargetingMode
source: Using Isolation mode to run tests as required by effective Platform:{0} and .Net Framework:{1} settings for test run. Use the /inIsolation parameter to suppress this warning.
de: Der Isolationsmodus wird zum Ausführen von Tests gemäß den Einstellungen der effektiven Plattform {0} und von .NET Framework {1} für den Testlauf verwendet. Verwenden Sie den /inIsolation-Parameter, um diese Warnung zu unterdrücken.
es: Se usará el modo de aislamiento para ejecutar las pruebas, según requiere la configuración de la plataforma efectiva ({0}) y .Net Framework ({1}) para la serie de pruebas. Use el parámetro /inIsolation para suprimir esta advertencia.
fr: Utilisation du mode Isolation pour exécuter les tests, conformément aux paramètres effectifs de la plateforme : {0} et du .Net Framework :{1} de la série de tests. Utilisez le paramètre /inIsolation pour supprimer cet avertissement.
it: Per eseguire i test, verrà usata la modalità di isolamento in base a quanto specificato nelle impostazioni effettive di piattaforma {0} e .NET Framework {1} per l'esecuzione dei test. Usare il parametro /inIsolation per non visualizzare più questo avviso.
ja: テスト実行のための効果的なプラットフォーム: {0} および .Net Framework: {1} の設定で必要とされるため、テストの実行に分離モードを使用しています。この警告が表示されないようにするには、/inIsolation パラメーターを使用します。
pl: Używanie trybu izolacji do uruchomienia testów w sposób wymagany przez obowiązujące ustawienia platformy ({0}) i programu .NET Framework ({1}) dla przebiegu testu. Użyj parametru /InIsolation, aby pominąć to ostrzeżenie.
pt_br: Usando o modo de isolamento para executar testes conforme o exigido pelas configurações em vigor da Plataforma: {0} e do .Net Framework: {1} para execução de teste. Use o parâmetro /inIsolation para suprimir esse aviso.
ru: Для запуска тестов используется изолированный режим в соответствии с параметрами Platform:{0} и .Net Framework:{1} для тестового запуска. Используйте параметр /InIsolation, чтобы отключить это предупреждение.
tr: Testleri test çalıştırması için etkili Platformun:{0} ve .NET Framework:{1} ayarlarının gerektirdiği şekilde çalıştırmak için Yalıtım modu kullanılıyor. Bu uyarıyı kapatmak için /inIsolation parametresini kullanın.
zh_hant: 依照測試回合的有效平台 {0} 和 .Net Framework {1} 設定的要求，使用隔離模式執行測試。使用 /inIsolation 參數可隱藏這個警告。

# FrameworkArgumentHelp
source: --Framework|/Framework:<Framework Version> Target .Net Framework version to be used for test execution. Valid values are ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" etc. Other supported values are Framework40, Framework45, FrameworkCore10 and FrameworkUap10.
de: --Framework|/Framework:< Frameworkversion > Die .NET Framework-Zielversion, die für die Testausführung verwendet werden soll. Gültige Werte sind ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0 " usw. Weitere unterstützte Werte sind "Framework40", "Framework45", "FrameworkCore10" und "FrameworkUap10".
es: --Framework|/Framework:<Versión de Framework> Versión de .NET Framework de destino que se usará para la ejecución de pruebas. Los valores válidos son ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0", etc. Otros valores admitidos son Framework40, Framework45, FrameworkCore10 y FrameworkUap10.
fr: --Framework|/Framework:<version du framework> Version cible du .Net Framework à utiliser pour l'exécution des tests. Les valeurs valides sont : ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0", etc. Les autres valeurs prises en charge sont Framework40, Framework45, FrameworkCore10 et FrameworkUap10.
it: --Framework|/Framework:<Versione framework> Versione di .NET Framework di destinazione da usare per l'esecuzione dei test. Valori validi: ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" e così via. Altri valori supportati: Framework40, Framework45, FrameworkCore10 e FrameworkUap10.
ja: --Framework|/Framework:<Framework Version> テストの実行に使用する、.Net Framework のターゲット バージョン。 有効な値は ".NETFramework,Version=v4.5.1"、".NETCoreApp,Version=v1.0" などです。 サポートされている他の値は、Framework40、Framework45、FrameworkCore10、FrameworkUap10 です。
pl: --Framework|/Framework:<wersja struktury> Docelowa wersja programu .NET Framework, która zostanie użyta na potrzeby wykonania testu. Prawidłowe wartości to ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" itp. Inne obsługiwane wartości to Framework40, Framework45, FrameworkCore10 i FrameworkUap10.
pt_br: --Framework|/Framework:<Versão do Framework> Versão do .Net Framework de destino a ser usada para a execução do teste. Valores váidos são ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" etc. Outros valores com suporte são Framework40, Framework45, FrameworkCore10 and FrameworkUap10.
ru: --Framework|/Framework:<версия платформы> Целевая версия .Net Framework для выполнения тестов. Допустимые значения: ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" и т. д. Другие поддерживаемые значения: Framework40, Framework45, FrameworkCore10 и FrameworkUap10.
tr: --Framework|/Framework:<Framework Sürümü> Test yürütme için kullanılacak hedef .Net Framework sürümü. Geçerli değerler: ".NETFramework,Version=v4.5.1", ".NETCoreApp,Version=v1.0" vb. Diğer desteklenen değerler: Framework40, Framework45, FrameworkCore10 ve FrameworkUap10.
zh_hant: --Framework|/Framework:<Framework 版本> 要用於測試執行的目標 .Net Framework 版本。 有效值為 ".NETFramework,Version=v4.5.1"、".NETCoreApp,Version=v1.0" 等等。 其他支援的值為 Framework40、Framework45、FrameworkCore10 和 FrameworkUap10。

# FrameworkVersionRequired
source: The /Framework argument requires the target .Net Framework version for the test run. Example: /Framework:".NETFramework,Version=v4.5.1"
de: Das /Framework-Argument erfordert die .NET Framework-Zielversion für den Testlauf. Beispiel: /Framework:".NETFramework,Version=v4.5.1"
es: El argumento /Framework requiere la versión de .Net Framework de destino para la serie de pruebas. Ejemplo: /Framework:".NETFramework,Version=v4.5.1"
fr: L'argument /Framework nécessite la version cible du .Net Framework pour la série de tests. Exemple : /Framework:".NETFramework,Version=v4.5.1"
it: Con l'argomento /Framework è richiesta la versione di .NET Framework di destinazione per l'esecuzione dei test. Esempio: /Framework:".NETFramework,Version=v4.5.1"
ja: /Framework 引数には、テストの実行対象とする .Net Framework バージョンが必要です。例: /Framework:".NETFramework,Version=v4.5.1"
pl: Argument /Framework wymaga docelowej wersji programu .NET Framework na potrzeby przebiegu testu. Przykład: /Framework:".NETFramework,Version=v4.5.1"
pt_br: O argumento /Framework requer a versão do .Net Framework de destino para a execução de teste. Exemplo: /Framework:".NETFramework,Version=v4.5.1"
ru: Аргумент /Framework требует указать целевую версию .NET Framework для тестового запуска. Пример: /Framework:".NETFramework,Version=v4.5.1"
tr: /Framework bağımsız değişkeni test çalıştırması için hedef .NET Framework sürümünü gerektirir. Örnek: /Framework:".NETFramework,Version=v4.5.1"
zh_hant: /Framework 引數需要測試回合的目標 .NET Framework 版本。 範例: /Framework:".NETFramework,Version=v4.5.1"
