Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# InvalidParentProcessIdArgument
source: The --ParentProcessId|/ParentProcessId argument requires the process id which is an integer. Specify the process id of the parent process that launched this process.
de: Das Argument "--ParentProcessId|/ParentProcessId" erfordert die Prozess-ID (Integerwert). Geben Sie die Prozess-ID des übergeordneten Prozesses an, der diesen Prozess gestartet hat.
es: El argumento --ParentProcessId|/ParentProcessId requiere el identificador del proceso, que es un entero. Especifique el identificador del proceso principal que inició este proceso.
fr: L'argument --ParentProcessId|/ParentProcessId nécessite l'ID de processus, qui doit être indiqué sous forme d'entier. Spécifiez l'ID de processus du processus parent qui a lancé ce processus.
it: Con l'argomento --ParentProcessId|/ParentProcessId è richiesto l'ID processo che corrisponde a un numero intero. Specificare l'ID del processo padre che ha avviato questo processo.
ja: --ParentProcessId|/ParentProcessId 引数には整数であるプロセス ID を指定する必要があります。このプロセスを開始した親プロセスのプロセス ID を指定してください。
pl: Argument --ParentProcessId|/ParentProcessId wymaga identyfikatora procesu będącego liczbą całkowitą. Określ identyfikator procesu nadrzędnego, który uruchomił ten proces.
pt_br: O argumento --ParentProcessId|/ParentProcessId requer a ID do processo que é um número inteiro. Especifique a ID do processo pai que iniciou esse processo.
ru: Для аргумента --ParentProcessId|/ParentProcessId требуется указать ИД процесса, который должен быть целым числом. Укажите идентификатор родительского процесса, ответственного за запуск текущего процесса.
tr: --ParentProcessId|/ParentProcessId bağımsız değişkeni, işlem kimliğinin tamsayı olmasını gerektirir. Bu işlemi başlatan üst işlemin işlem kimliğini belirtin.
zh_hant: --ParentProcessId|/ParentProcessId 引數需要整數的處理序識別碼。請為已啟動這個處理序的父處理序指定處理序識別碼。

# HelpArgumentsText
source: Arguments:
de: Argumente:
es: Argumentos:
it: Argomenti:
ja: 引数:
pl: Argumenty:
pt_br: Argumentos:
ru: Аргументы:
tr: Bağımsız değişkenler:
zh_hant: 引數:

# EnableDiagUsage
source: --Diag|/Diag:<Path to log file> Enable logs for test platform. Logs are written to the provided file. Change the trace level for logs as shown below Example: /Diag:<Path to log file>;tracelevel=<Defaults to "verbose"> Allowed values for tracelevel: off, error, warning, info and verbose.
de: --Diag|/Diag:<Pfad zur Protokolldatei> Aktiviert Protokolle für die Testplattform. Protokolle werden in die angegebene Datei geschrieben. Ändern Sie die Ablaufverfolgungsebene für Protokolle wie unten gezeigt: Beispiel: /Diag:<Pfad zur Protokolldatei>;tracelevel=<Standard: "verbose"> Zulässige Werte für "tracelevel": "off", "error", "warning", "info" und "verbose".
es: --Diag|/Diag:<Ruta al archivo de registro> Habilita los registros para la plataforma de pruebas. Los registros se escriben en el archivo proporcionado. Cambie el nivel de seguimiento de los registros tal y como se muestra a continuación Ejemplo: /Diag:<Ruta al archivo de registro>;tracelevel=<Valor predeterminado: "verbose"> Valores permitidos para el nivel de seguimiento: off, error, warning, info y verbose.
fr: --Diag|/Diag:<chemin du fichier journal> Permet d'activer les journaux pour la plateforme de test. Les journaux sont écrits dans le fichier fourni. Change le niveau de trace des journaux comme indiqué ci-dessous Exemple : /Diag:<chemin du fichier journal>;tracelevel=<"verbose" par défaut> Valeurs autorisées pour tracelevel : off, error, warning, info et verbose.
it: --Diag|/Diag:<percorso del file di log> Abilita i log per la piattaforma di test. I log vengono scritti nel file specificato. Modifica il livello di traccia per i log come illustrato di seguito: Esempio: /Diag:<percorso del file di logfile>;tracelevel=<impostazione predefinita: "verbose"> Valori consentiti per tracelevel: off, error, warning, info e verbose.
ja: --Diag|/Diag:<Path to log file> テスト プラットフォームに対してログを有効にします。 ログは指定されたファイルに書き込まれます。 次のようにログのトレース レベルを変更します。 例: /Diag:<Path to log file>;tracelevel=<Defaults to "verbose"> トレース レベルに使用できる値: off、error、warning、info、verbose。
pl: --Diag|/Diag:<ścieżka do pliku dziennika> Włącz dzienniki dla platformy testowej. Dzienniki są zapisywanie w podanym pliku. Zmień poziom śledzenia dla dzienników, jak pokazano poniżej Przykład: /Diag:<ścieżka do pliku dziennika>;tracelevel=<wartość domyślna to „verbose”> Dozwolone wartości dla elementu tracelevel: off, error, warning, info i verbose.
pt_br: --Diag|/Diag:<Caminho para o arquivo de log> Habilita logs na plataforma de teste. Os logs são gravados no arquivo fornecido. Altera o nível de rastreamento para logs conforme abaixo Exemplo: /Diag:<Caminho para o arquivo de log>;tracelevel=<Padrão como "verbose"> Valores permitidos para tracelevel: off, error, warning, info e verbose.
ru: --Diag|/Diag:<путь к файлу журнала> Включает журналы для платформы тестирования. Журналы записываются в указанный файл. Изменить уровень трассировки журналов можно, как показано ниже Пример: /Diag:<путь к файлу журнала>;tracelevel=<по умолчанию "verbose"> Допустимые значения для tracelevel: off (отключено), error (ошибка), warning (предупреждение), info (информация) и verbose (подробная).
tr: --Diag|/Diag:<Günlük dosyası yolu> Test platformu için günlükleri sağlayın. Günlükler sağlanan dosyaya yazılır. Günlükler için izleme düzeyini aşağıda gösterildiği gibi değiştirin Örnek: /Diag:<Günlük dosyası yolu>; tracelevel=<Varsayılan olarak "ayrıntılı" değerini alır> tracelevel için izin verilen değerler: kapalı, hata, uyarı, bilgiler ve ayrıntılı.
zh_hant: --Diag|/Diag:<記錄檔的路徑> 啟用測試平台的記錄。 記錄已寫入提供的檔案。 根據以下範例變更記錄的追蹤層級 範例: /Diag:<記錄檔的路徑>;tracelevel=<預設為 "verbose"> tracelevel 允許的值: off、error、warning、info 和 verbose。

# LoggerFileIsReadOnly
source: The file {0} provided is read only
de: Die angegebene Datei "{0}" ist schreibgeschützt.
es: El archivo {0} proporcionado es de solo lectura
fr: Le fichier {0} fourni est en lecture seule
it: Il file specificato {0} è di sola lettura
ja: 指定されたファイル {0} は読み取り専用です。
pl: Podany plik {0} jest tylko do odczytu
pt_br: O arquivo {0} fornecido é somente leitura
ru: Указанный файл {0} доступен только для чтения.
tr: Belirtilen {0} dosyası salt okunur
zh_hant: 提供的檔案 {0} 為唯讀

# DesignModeClientTimeoutError
source: Timeout to connect or process request for DesignModeClient on port: {0}
de: Timeout zum Herstellen einer Verbindung oder zum Verarbeiten von Anfragen für DesignModeClient an Port: {0}
es: Tiempo de espera para conectar o procesar la solicitud para DesignModeClient en el puerto: {0}
fr: Délai expiré pour se connecter ou traiter la requête pour DesignModeClient sur le port : {0}
it: Timeout per la connessione o l'elaborazione della richiesta relativa a DesignModeClient sulla porta: {0}
ja: ポートで接続または DesignModeClient の要求処理のタイムアウト: {0}
pl: Przekroczono limit czasu żądania nawiązywania połączenia lub przetwarzania dla elementu DesignModeClient na porcie: {0}
pt_br: Tempo limite atingido para conectar-se ou processar a solicitação para DesignModeClient na porta: {0}
ru: Время ожидания установления подключения или обработки запроса для DesignModeClient на порту {0} истекло.
tr: Şu bağlantı noktası üzerinde DesignModeClient için bağlantı veya işleme isteği zaman aşımı: {0}
zh_hant: 連線或處理連接埠 {0} 上對於 DesignModeClient 之要求的逾時時間:

# CLIRunSettingsArgumentHelp
source: RunSettings arguments: Arguments to pass runsettings configurations through commandline. Arguments may be specified as name-value pair of the form [name]=[value] after "-- ". Note the space after --. Use a space to separate multiple [name]=[value]. More info on RunSettings arguments support: https://aka.ms/vstest-runsettings-arguments
de: RunSettings-Argumente: An die RunSettings-Konfigurationen über die Befehlszeile zu übergebende Argumente. Argumente werden unter Umständen als Name-Wert-Paar der Form [Name]=[Wert] nach "-- " übergeben. Beachten Sie das Leerzeichen nach "--". Trennen Sie mehrere Paare der Form [Name]=[Wert] mithilfe von Leerzeichen. Weitere Informationen zur Unterstützung von RunSettings-Argumenten: https://aka.ms/vstest-runsettings-arguments
es: Argumentos de RunSettings: Argumentos para pasar configuraciones de runsettings a través de la línea de comandos. Los argumentos se pueden especificar como un par nombre-valor en la forma [nombre]=[valor] después de "-- ". Observe que hay un espacio después de --. Use un espacio para separar varios pares de [nombre]=[valor]. Más información sobre la compatibilidad de argumentos de RunSettings: https://aka.ms/vstest-runsettings-arguments
fr: Arguments RunSettings : Arguments pour passer des configurations runsettings via la ligne de commande. Les arguments peuvent être spécifiés comme paire nom-valeur sous la forme [nom]=[valeur] après "-- ". Notez l'espace après --. Utilisez un espace pour séparer plusieurs [nom]=[valeur]. Plus d'informations sur la prise en charge des arguments RunSettings : https://aka.ms/vstest-runsettings-arguments
it: Argomenti di RunSettings: Argomenti per passare le configurazioni di runsettings tramite la riga di comando. È possibile specificare gli argomenti come coppia nome-valore in formato [nome]=[valore] dopo "-- ". Notare lo spazio dopo --. Usare uno spazio per separare più coppie [nome]=[valore]. Per altre informazioni sul supporto degli argomenti di RunSettings, vedere: https://aka.ms/vstest-runsettings-arguments
ja: RunSettings 引数: commandline 経由で runsettings 構成を渡す引数。引数は、"-- " の後に [name]=[value] の形式で名前と値のペアとして指定できます。-- の後のスペースにご注意ください。 複数の [name]=[value] を区切るにはスペースを使用します。 RunSettings 引数のサポートに関する詳細情報: https://aka.ms/vstest-runsettings-arguments
pl: Argumenty RunSettings: Argumenty do przekazania konfiguracji runsettings za pośrednictwem wiersza polecenia. Argumenty mogą być określone jako para nazwa-wartość formularza [nazwa]=[wartość] po „-- ”. Pamiętaj o spacji po --. Oddziel wiele par [nazwa]=[wartość] za pomocą spacji. Więcej informacji na temat obsługi argumentów RunSettings: https://aka.ms/vstest-runsettings-arguments
pt_br: Argumentos de RunSettings: Argumentos para transmitir as configurações de runsettings através da commandline. Os argumentos podem ser especificados como um par nome-valor do formulário [name]=[value] após "-- ". Observe o espaço após --. Use um espaço para separar vários [name]=[value]. Mais informações sobre o suporte para os argumentos de RunSettings: https://aka.ms/vstest-runsettings-arguments
ru: Аргументы RunSettings: Аргументы для передачи конфигураций runsettings через командную строку. Аргументы могут быть указаны как пара "имя-значение" в формате [имя]=[значение] после "-- ". Обратите внимание на пробел после --. Используйте пробел для разделения нескольких пар [имя]=[значение]. Дополнительные сведения о поддержке аргументов RunSettings: https://aka.ms/vstest-runsettings-arguments
tr: RunSettings bağımsız değişkenleri: Komut satırı aracılığıyla runsettings yapılandırmalarını geçirmek için kullanılan bağımsız değişkenler. Bağımsız değişkenler "-- " karakterlerinden sonra [ad]=[değer] biçiminde ad-değer çifti olarak belirtilebilir. -- karakterlerinden sonra boşluk olduğuna dikkat edin. Birden fazla [ad]=[değer] çiftini ayırmak için bir boşluk kullanın. RunSettings bağımsız değişkenleri desteği hakkında daha fazla bilgi: https://aka.ms/vstest-runsettings-arguments
zh_hant: RunSettings 引數: 透過命令列傳遞 runsettings 組態的引數。引數可以接在 "-- " 之後，以 [名稱]=[值] 的格式指定名稱/值配對。請注意 -- 之後的空格。 使用空格以隔開多個 [名稱]=[值]。 RunSettings 引數支援的詳細資訊: https://aka.ms/vstest-runsettings-arguments

# MalformedRunSettingsKey
source: One or more runsettings provided contain invalid token
de: Mindestens eine angegebene Ausführungseinstellung enthält ein ungültiges Token.
es: Uno o varios runsettings proporcionados contienen un token no válido.
fr: Un ou plusieurs paramètres d'exécution fournis contiennent un jeton non valide
it: Uno o più file runsettings specificati contengono un token non valido
ja: 指定の runsettings の 1 つ以上に無効なトークンが含まれています。
pl: Co najmniej jedne z podanych ustawień uruchamiania zawierają nieprawidłowy token
pt_br: Uma ou mais runsettings fornecidas contêm um token inválido
ru: Один параметр запуска (или несколько) включает в себя недопустимый токен.
tr: Sağlanan bir veya daha fazla runsettings geçersiz belirteç içeriyor
zh_hant: 提供的一或多個 runsettings 包含無效的語彙基元

# ResultsDirectoryArgumentHelp
source: --ResultsDirectory|/ResultsDirectory Test results directory will be created in specified path if not exists. Example /ResultsDirectory:<pathToResultsDirectory>
de: --ResultsDirectory|/ResultsDirectory Sofern noch nicht vorhanden, wird am angegebenen Pfad ein Testergebnisverzeichnis erstellt. Beispiel: /ResultsDirectory:<Pfad zum Ergebnisverzeichnis>
es: --ResultsDirectory|/ResultsDirectory El directorio de resultados de pruebas se creará en la ruta de acceso especificada, si no existe. Ejemplo /ResultsDirectory:<Ruta al directorio de resultados>
fr: --ResultsDirectory|/ResultsDirectory Le répertoire des résultats des tests est créé dans le chemin spécifié, s'il n'existe pas. Exemple : /ResultsDirectory:<chemin du répertoire des résultats>
it: --ResultsDirectory|/ResultsDirectory Se non esiste già, la directory dei risultati dei test verrà creata nel percorso specificato. Esempio: /ResultsDirectory:<percorsoDirectoryRisultati>
ja: --ResultsDirectory|/ResultsDirectory 存在しない場合、テスト結果のディレクトリが指定されたパスに作成されます。 例: /ResultsDirectory:<pathToResultsDirectory>
pl: --ResultsDirectory|/ResultsDirectory Jeśli katalog wyników nie istnieje, zostanie utworzony w określonej ścieżce. Przykład /ResultsDirectory:<ŚcieżkaDoKataloguWyników>
pt_br: --ResultsDirectory|/ResultsDirectory O diretório de resultados de teste será criado no caminho especificado, se ele não existir. Exemplo /ResultsDirectory:<pathToResultsDirectory>
ru: --ResultsDirectory|/ResultsDirectory По указанному пути будет создан каталог с результатами тестирования, если он не существует. Пример: /ResultsDirectory:<pathToResultsDirectory>
tr: --ResultsDirectory|/ResultsDirectory Mevcut değilse test sonuçları dizini belirtilen yolda oluşturulacak. Örnek /ResultsDirectory:<pathToResultsDirectory>
zh_hant: --ResultsDirectory|/ResultsDirectory 若沒有測試結果目錄，將會在指定的路徑中加以建立。 範例: /ResultsDirectory:<pathToResultsDirectory>

# ResultsDirectoryValueRequired
source: The /ResultsDirectory parameter requires a value, where the test results should be saved. Example: /ResultsDirectory:c:\MyTestResultsDirectory
de: Der Parameter "/ResultsDirectory" erfordert einen Wert, wobei die Testergebnisse gespeichert werden müssen. Beispiel: /ResultsDirectory:c:\MyTestResultsDirectory
es: El parámetro /ResultsDirectory requiere un valor, donde deben guardarse los resultados de la prueba. Ejemplo: /ResultsDirectory:c:\MyTestResultsDirectory
fr: Le paramètre /ResultsDirectory nécessite une valeur, où les résultats des tests doivent être enregistrés. Exemple : /ResultsDirectory:c:\MyTestResultsDirectory
it: Con il parametro /ResultsDirectory è richiesto un valore, corrispondente alla directory in cui verranno salvati i risultati dei test. Esempio: /ResultsDirectory:c:\MyTestResultsDirectory
ja: /ResultsDirectory パラメーターには値が必要であり、そこにテスト結果が保存されます。例: /ResultsDirectory:c:\MyTestResultsDirectory
pl: Parametr /ResultsDirectory wymaga wartości określającej miejsce zapisania wyników testu. Przykład: /ResultsDirectory:c:\KatalogWynikówTestu
pt_br: O parâmetro /ResultsDirectory exige um valor no qual os resultados de teste deverão ser salvos. Exemplo: /ResultsDirectory:c:\MyTestResultsDirectory
ru: Для параметра /ResultsDirectory требуется значение, в котором сохраняются результаты тестирования. Пример: /ResultsDirectory:c:\MyTestResultsDirectory
tr: /ResultsDirectory parametresi test sonuçlarının kaydedileceği bir değer gerektirir. Örnek: /ResultsDirectory:c:\TestSonuçlarıDizinim
zh_hant: /ResultsDirectory 參數需要值，亦即測試結果的儲存位置。範例: /ResultsDirectory:c:\MyTestResultsDirectory

# InvalidResultsDirectoryPathCommand
source: The path '{0}' specified in the 'ResultsDirectory' is invalid. Error: {1}
de: Der in "ResultsDirectory" angegebene Pfad "{0}" ist ungültig. Fehler: {1}
es: La ruta de acceso "{0}" especificada en "ResultsDirectory" no es válida. Error: {1}
fr: Le chemin '{0}' spécifié dans 'ResultsDirectory' est non valide. Erreur : {1}
it: Il percorso '{0}' specificato in 'ResultsDirectory' non è valido. Errore: {1}
ja: 'ResultsDirectory' に指定されているパス '{0}' は無効です。エラー: {1}
pl: Ścieżka „{0}” określona w parametrze „ResultsDirectory” jest nieprawidłowa. Błąd: {1}
pt_br: O caminho '{0}' especificado em 'ResultsDirectory' é inválido. Erro: {1}
ru: Путь "{0}", указанный в "ResultsDirectory", недопустим. Ошибка: {1}
tr: 'ResultsDirectory' içinde belirtilen '{0}' yolu geçersiz. Hata: {1}
zh_hant: 'ResultsDirectory' 中指定的路徑 '{0}' 無效。錯誤: {1}

# InIsolationDeprecated
source: The /InIsolation flag is deprecated. The tests are always run in a separate process
de: Das Flag "/InIsolation" ist veraltet. Die Tests werden immer in einem separaten Prozess ausgeführt.
es: La marca /InIsolation está en desuso. Las pruebas se ejecutan siempre en un proceso independiente
fr: L'indicateur /InIsolation est déprécié. Les tests sont toujours exécutés dans un processus distinct
it: Il flag /InIsolation è deprecato. I test verranno sempre eseguiti in un processo separato
ja: /InIsolation フラグは非推奨です。テストは常に別個のプロセスで実行されます
pl: Flaga /InIsolation jest przestarzała. Testy zawsze są uruchamiane w oddzielnym procesie
pt_br: O sinalizador /InIsolation foi preterido. Os testes sempre são executados em um processo separado
ru: Флаг /InIsolation использовать не рекомендуется. Тесты всегда запускаются в отдельном процессе
tr: /InIsolation bayrağı kullanım dışı bırakıldı. Testler her zaman ayrı bir işlem içinde çalıştırılır
zh_hant: /InIsolation 旗標已標示即將淘汰。測試一律會在個別的處理序中執行

# NotRunTestIndicator
source: Not Run
es: Sin ejecutar
fr: Pas exécuté
it: Non eseguito
ja: 未実行
pl: Nie uruchomiono
tr: Çalıştırılmadı

# VstestDiagLogOutputPath
source: Logging Vstest Diagnostics in file: {0}
de: Die Vstest-Diagnose wird in der Datei {0} protokolliert.
es: Registrando diagnósticos de Vstest en el archivo: {0}
fr: Journalisation des diagnostics Vstest dans le fichier : {0}
it: Registrazione della diagnostica di Vstest nel file: {0}
ja: 次のファイルで Vstest 診断をログ記録しています: {0}
pl: Rejestrowanie diagnostyki Vstest w pliku: {0}
pt_br: Registro em log do diagnóstico Vstest no arquivo: {0}
ru: Ведение журналов диагностики Vstest в файле: {0}
tr: Vstest Tanılamaları şu dosyadaki günlüğe kaydediliyor: {0}
zh_hant: 在檔案 {0} 中記錄 Vstest 診斷

# CollectArgumentHelp
source: --Collect|/Collect:<DataCollector FriendlyName> Enables data collector for the test run. More info here : https://aka.ms/vstest-collect
de: --Collect|/Collect:<DataCollector FriendlyName> Aktiviert den Datensammler für den Testlauf. Weitere Informationen finden Sie hier: https://aka.ms/vstest-collect
es: --Collect|/Collect:<Nombre descriptivo del recopilador de datos> Habilita el recopilador de datos para la serie de pruebas. Más información aquí: https://aka.ms/vstest-collect
fr: --Collect|/Collect:<nom convivial du collecteur de données> Active le collecteur de données pour la série de tests. Plus d'informations ici : https://aka.ms/vstest-collect
it: --Collect|/Collect:<Nome descrittivo agente di raccolta dati> Abilita l'agente di raccolta dati per l'esecuzione dei test. Per altre informazioni, vedere: https://aka.ms/vstest-collect
ja: --Collect|/Collect:<DataCollector FriendlyName> テストの実行用のデータ コレクターを有効にします。詳細情報はこちら: https://aka.ms/vstest-collect
pl: --Collect|/Collect:<przyjazna nazwa modułu zbierającego dane> Włącza moduł zbierający dane dla przebiegu testu. Więcej informacji: https://aka.ms/vstest-collect
pt_br: --Collect|/Collect:<DataCollector FriendlyName> Habilita o coletor de dados para a execução de teste. Mais informações aqui: https://aka.ms/vstest-collect
ru: --Collect|/Collect:<DataCollector FriendlyName> Включает сборщик тестов для тестового запуска. Дополнительные сведения: https://aka.ms/vstest-collect
tr: --Collect|/Collect:<DataCollector FriendlyName> Test çalıştırması için veri toplayıcıyı etkinleştirir. Daha fazla bilgi: https://aka.ms/vstest-collect
zh_hant: --Collect|/Collect:<資料收集器的易記名稱> 為測試回合啟用資料收集器。如需詳細資訊，請參閱: https://aka.ms/vstest-collect

# DataCollectorFriendlyNameInvalid
source: The Data Collector friendly name '{0}' is not valid. The Data Collector will be ignored.
de: Der benutzerfreundliche Name des Datensammlers "{0}" ist ungültig. Der Datensammler wird ignoriert.
es: El nombre descriptivo del recopilador de datos "{0}" no es válido. El recopilador de datos se ignorará.
fr: Le nom convivial du collecteur de données '{0}' n'est pas valide. Le collecteur de données est ignoré.
it: Il nome descrittivo '{0}' dell'agente di raccolta dati non è valido. L'agente di raccolta dati verrà ignorato.
ja: データ コレクターのフレンドリ名 '{0}' が無効です。データ コレクターは無視されます。
pl: Przyjazna nazwa modułu zbierającego dane „{0}” jest nieprawidłowa. Moduł zbierający dane będzie ignorowany.
pt_br: O nome amigável '{0}' do Coletor de Dados não é válido. O Coletor de Dados será ignorado.
ru: Понятное имя сборщика данных "{0}" недопустимо. Сборщик данных будет пропущен.
tr: Veri Toplayıcı kolay adı '{0}' geçerli değil. Veri Toplayıcı yoksayılacak.
zh_hant: 資料收集器的易記名稱 '{0}' 無效。該資料收集器將予忽略。

# DbgTrcMessagesBanner
source: Debug Traces Messages:
de: Meldungen zu Debugablaufverfolgungen:
es: Depurar mensajes de trazas:
fr: Déboguer les messages de traces :
it: Messaggi delle tracce di debug:
ja: デバッグ トレース メッセージ:
pl: Komunikaty śledzenia debugowania:
pt_br: Depurar Mensagens de Rastreamento:
ru: Сообщения трассировок отладки:
tr: Hata Ayıklama İzleme İletileri:
zh_hant: 偵錯追蹤訊息:
