Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# EnableBlameUsage
source: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Runs the test in blame mode. This option is helpful in isolating the problematic test causing test host crash. It creates an output file in the current directory as "Sequence.xml", that captures the order of execution of test before the crash. You may optionally choose to collect process dump for the test host. When you choose to collect dump, by default, a mini dump will be collected on a crash. You may also choose to override this default behaviour by some optional parameters: CollectAlways - To collect dump on exit even if there is no crash (true/false) DumpType - To specify dump type (mini/full). Example: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
de: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Führt den Test im blame-Modus aus. Diese Option ist hilfreich zum Isolieren des problematischen Tests, der einen Absturz des Testhosts verursacht. Im aktuellen Verzeichnis wird eine Ausgabedatei namens "Sequence.xml" erstellt, in der die Reihenfolge der Testausführung vor dem Absturz erfasst wird. Optional können Sie eine Prozesssicherung für den Testhost erfassen. Wenn Sie sich zum Erfassen einer Sicherung entschließen, wird bei einem Absturz standardmäßig eine Minisicherung erfasst. Dieses Standardverhalten können Sie durch einige optionale Parameter außer Kraft setzen: CollectAlways: Zum Erfassen einer Sicherung beim Beenden, selbst wenn kein Absturz eintritt (TRUE/FALSE). DumpType: Zur Angabe des Sicherungstyps (mini/full). Beispiel: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
es: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Ejecuta la prueba en modo blame. Esta opción es útil a la hora de aislar la prueba problemática que provoca el bloqueo del host de prueba. Crea un archivo de salida en el directorio actual como "Sequence.xml", que captura el orden de ejecución de la prueba antes del bloqueo. Tiene la opción de elegir recopilar el volcado de proceso para el host de prueba. Cuando elige recopilar el volcado, de forma predeterminada se recopila un mini volcado en un bloqueo. También puede elegir invalidar este comportamiento predeterminado mediante algunos parámetros opcionales: CollectAlways: para recopilar un volcado al salir incluso aunque no haya un bloqueo (true/false) DumpType: para especificar el tipo de volcado (mini/completo). Ejemplo: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
fr: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Exécute le test en mode blame. Cette option est utile pour isoler le test problématique qui cause le plantage de l'hôte de test. Il crée un fichier de sortie dans le répertoire actif nommé "Sequence.xml", qui capture l'ordre d'exécution du test avant le plantage. Vous pouvez éventuellement choisir de collecter le fichier dump du processus de l'hôte de test. Quand vous choisissez de collecter le fichier dump, par défaut, un mini-dump est collecté lors du plantage. Vous pouvez aussi choisir de remplacer ce comportement par défaut par des paramètres facultatifs : CollectAlways - Pour collecter le fichier dump à la fermeture, même s'il n'y pas de plantage (true/false) DumpType - Pour spécifier le type de fichier dump (mini/full). Exemple : /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
it: --Blame|/Blame:[CollectDump];[CollectAlways]=[Valore];[DumpType]=[Valore] Esegue il test in modalità di segnalazione errore. Questa opzione è utile per isolare il test problematico che causa l'arresto anomalo di Test Host. Crea nella directory corrente un file di output "Sequence.xml", che acquisisce l'ordine di esecuzione del test prima dell'arresto anomalo. Si può scegliere di raccogliere il dump del processo per Test Host. Quando si sceglie di raccogliere il dump, per impostazione predefinita viene raccolto un minidump in caso di arresto anomalo. Si può anche scegliere di eseguire l'override di questo comportamento predefinito usando alcuni parametri facoltativi: CollectAlways: per raccogliere il dump all'uscita anche in assenza di arresto anomalo (true/false) DumpType: per specificare il tipo di dump (mini/full). Esempio: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
ja: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] テストを Blame モードで実行します。このオプションは、テスト ホストのクラッシュを引き起こしているテストを分離するのに役立ちます。 現在のディレクトリに "Sequence.xml" という出力ファイルを作成し、 そのファイルにクラッシュ前のテストの実行順序をキャプチャします。 必要に応じて、テスト ホストのプロセス ダンプを収集することもできます。 ダンプを収集するように選択すると、既定ではクラッシュ時にミニ ダンプが収集されます。 この既定の動作を次のオプション パラメーターでオーバーライドすることもできます: CollectAlways - クラッシュが発生していなくても終了時にダンプを収集します (true/false) DumpType - ダンプの種類を指定します (mini/full)。 例: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
pl: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Uruchamia test w trybie Blame. Ta opcja jest pomocna w odizolowaniu problematycznego testu powodującego awarię hosta testów. Tworzy w bieżącym katalogu plik wyjściowy „Sequence.xml”, który przechwytuje kolejność wykonywania testu przed awarią. Opcjonalnie możesz zebrać zrzut procesu dla hosta testów. Gdy zdecydujesz się na zebranie zrzutu, domyślnie w momencie awarii zostanie zebrany minizrzut. Możesz także przesłonić to zachowanie domyślne opcjonalnymi parametrami: CollectAlways — zrzut jest zbierany przy wychodzeniu, nawet jeśli nie ma awarii (true/false) DumpType — określa typ zrzutu (mini/full). Przykład: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
pt_br: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Executa o teste em modo blame. Essa opção é útil para isolar o teste com problema causando falha no host de teste . Ele cria um arquivo de saída no diretório atual como "Sequence.xml", que captura a ordem de execução do teste antes da falha. Você pode optar por coletar o processo de despejo para o host de teste. Ao optar por coletar despejo, por padrão, um mini despejo será coletado em uma falha. Você também pode optar por sobrescrever este comportamento padrão por alguns parâmetros opcionais: CollectAlways - Para coletar despejo na saída mesmo que não haja falha (true/false) DumpType - Para especificar o tipo de despejo (mini/full). Exemplo: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
ru: --Blame|/Blame:[CollectDump];[CollectAlways]=[<значение>];[DumpType]=[<значение>] Выполняет тест в blame-режиме. Этот вариант помогает изолировать проблемный тест, вызывающий сбой хоста для тестов. В текущем каталоге создается выходной файл "Sequence.xml", который записывает порядок выполнения теста перед сбоем. При необходимости вы можете выполнить сбор дампа процессов хоста для тестов. В этом случае по умолчанию при сбое будет собран мини-дамп. Вы также можете переопределить поведение по умолчанию с помощью дополнительных параметров: CollectAlways — собирает дамп по завершении даже при отсутствии сбоев (true/false) DumpType — задает тип дампа, mini (мини-дамп) или full (полный). Пример: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
tr: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] Testi blame modunda çalıştırır. Bu seçenek, test ana bilgisayarının kilitlenmesine neden olan sorunlu testin ayrı tutulmasını sağlar. Geçerli dizinde, kilitlenmeden önce testin yürütülme düzenini yakalayan, “Sequence.xml” adlı bir çıkış dosyası oluşturur. İsteğe bağlı olarak test ana bilgisayarının işlem dökümünü çıkarmayı seçebilirsiniz. Dökümü çıkarmayı seçtiğinizde, kilitlenme durumunda varsayılan olarak bir mini döküm çıkarılır. Dilerseniz bazı isteğe bağlı parametrelerle bu varsayılan davranışı geçersiz kılabilirsiniz: CollectAlways - Kilitlenme olmasa da her çıkışta döküm çıkarma (true/false) DumpType - Döküm türünü belirtme (mini/full). Örnek: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full
zh_hant: --Blame|/Blame:[CollectDump];[CollectAlways]=[Value];[DumpType]=[Value] 以 blame 模式執行測試。此選項在隔離造成測試主機當機的問題測試時相當實用。 它會在目前的目錄建立輸出檔案 "Sequence.xml"， 該檔案會擷取當機前的測試執行順序。 您也可以選擇收集測試主機的處理序傾印。 當您選擇收集傾印時，預設會在當機時收集迷你傾印／ 您也可以選擇使用一些選用參數來覆寫此預設行為: CollectAlways - 即使沒有當機，也在離開時收集傾印 (true/false) DumpType - 指定傾印類型 (mini/full)。 範例: /Blame /Blame:CollectDump /Blame:CollectDump;CollectAlways=true;DumpType=full

source: Test Run Aborted.
de: Testlauf abgebrochen.
es: Serie de pruebas anulada.
fr: Série de tests abandonnée.
it: Esecuzione dei test interrotta.
ja: テスト実行が中止されました。
pl: Przebieg testu został przerwany.
pt_br: Execução de Teste Anulada.
ru: Тестовый запуск прерван.
tr: Test Çalıştırması Durduruldu.
zh_hant: 測試回合已中止。

source: Test Run Canceled.
de: Testlauf abgebrochen.
es: Serie de pruebas cancelada.
fr: Série de tests annulée.
it: Esecuzione dei test annullata.
ja: テスト実行が取り消されました。
pl: Przebieg testu został anulowany.
pt_br: Execução de Teste Cancelada.
ru: Тестовый запуск отменен.
tr: Test Çalıştırması İptal Edildi.
zh_hant: 測試回合已取消。

# OpenResponseFileError
source: Error opening response file '{0}'
de: Fehler beim Öffnen der Antwortdatei "{0}".
es: Error al abrir el archivo de respuesta "{0}"
fr: Erreur au moment de l'ouverture du fichier réponse '{0}'
it: Si è verificato un errore durante l'apertura del file di risposta '{0}'
ja: 応答ファイル '{0}' を開くときにエラーが発生しました
pl: Błąd podczas otwierania pliku odpowiedzi „{0}”
pt_br: Erro ao abrir o arquivo de resposta '{0}'
ru: Произошла ошибка при открытии файла ответа "{0}"
tr: '{0}' yanıt dosyası açılırken hata oluştu
zh_hant: 開啟回應檔案 '{0}' 時發生錯誤

# ResponseFileArgumentHelp
source: @<file> Read response file for more options.
de: @<file> Lesen Sie die Antwortdatei für weitere Optionen.
es: @<file> Leer el archivo de respuesta para ver más opciones.
fr: @<fichier> Consultez le fichier réponse pour plus d'options.
it: @<file> Legge il file di risposta per altre opzioni.
ja: @<file> その他のオプションについては、応答ファイルを参照してください。
pl: @<file> Przeczytaj zawartość pliku odpowiedzi w celu uzyskania dodatkowych opcji.
pt_br: @<file> Leia o arquivo de resposta para obter mais opções.
ru: @<file> Считать дополнительные параметры из файла ответа.
tr: @<dosya> Daha fazla seçenek için yanıt dosyasını okuyun.
zh_hant: @<檔案> 讀取回應檔以取得更多選項。

# TestRunSummaryForCanceledOrAbortedRun
source: Total tests: Unknown
es: Pruebas totales: desconocido
fr: Nombre total de tests : inconnu
it: Totale test: sconosciuto
ja: テストの合計数: 不明
pl: Łączna liczba testów: nieznana
tr: Toplam test sayısı: Bilinmiyor

# SuggestTestAdapterPathIfNoTestsIsFound
source: Additionally, path to test adapters can be specified using /TestAdapterPath command. Example /TestAdapterPath:<pathToCustomAdapters>.
de: Außerdem kann der Pfad zu den Testadaptern über den Befehl "/TestAdapterPath" angegeben werden. Beispiel: /TestAdapterPath:<PfadZuBenutzerdefiniertenAdaptern>.
es: Además, la ruta de acceso a los adaptadores de pruebas se puede especificar con el comando /TestAdapterPath. Ejemplo /TestAdapterPath:<rutaAAdaptadoresPersonalizados>.
fr: De plus, vous pouvez spécifier le chemin des adaptateurs de tests à l'aide de la commande /TestAdapterPath. Exemple : /TestAdapterPath:<chemin d'adaptateurs personnalisés>.
it: È anche possibile specificare il percorso degli adattatori di test con il comando /TestAdapterPath. Esempio: /TestAdapterPath:<percorsoAdattatoriPersonalizzati>.
ja: さらに、/TestAdapterPath コマンドを使用してテスト アダプターのパスを指定できます。例: /TestAdapterPath:<pathToCustomAdapters>。
pl: Dodatkowo ścieżkę do adapterów testów można określić za pomocą polecenia /TestAdapterPath. Przykład: /TestAdapterPath:<ścieżka_do_adapterów_niestandardowych>.
pt_br: Além disso, o caminho para testar os adaptadores pode ser especificado usando o comando /TestAdapterPath. Exemplo: /TestAdapterPath:<pathToCustomAdapters>.
ru: Кроме того, путь к адаптерам теста можно указать с помощью команды /TestAdapterPath. Пример: /TestAdapterPath:<путь_к_пользовательским_адаптерам>.
tr: Buna ek olarak, test bağdaştırıcıları yolu /TestAdapterPath komutu kullanılarak belirtilebilir. Örnek /TestAdapterPath:<pathToCustomAdapters>.
zh_hant: 此外還可使用 /TestAdapterPath 命令，指定測試配接器的路徑。範例: /TestAdapterPath:<自訂配接器的路徑>。

# UseVsixExtensionsDeprecation
source: /UseVsixExtensions is getting deprecated. Please use /TestAdapterPath instead.
de: /UseVsixExtensions wird demnächst eingestellt. Verwenden Sie stattdessen /TestAdapterPath.
es: /UseVsixExtensions se está quedando obsoleto. Utilice /TestAdapterPath en su lugar.
fr: /UseVsixExtensions est progressivement déprécié. Utilisez /TestAdapterPath à la place.
it: /UseVsixExtensions verrà deprecato. Usare /TestAdapterPath.
ja: /UseVsixExtensions は非推奨になりました。代わりに /TestAdapterPath を使用してください。
pl: Polecenie /UseVsixExtensions jest wycofywane. Użyj zamiast niego polecenia /TestAdapterPath.
pt_br: /UseVsixExtensions está sendo preterido. Em vez disso, use /TestAdapterPath.
ru: Параметр /UseVsixExtensions устарел. Используйте /TestAdapterPath.
tr: /UseVsixExtensions kullanımdan kaldırılıyor. Lütfen bunun yerine /TestAdapterPath kullanın.
zh_hant: /UseVsixExtensions 即將淘汰。請改用 /TestAdapterPath。

# DisableAutoFakesUsage
source: --DisableAutoFakes|/DisableAutoFakes:<true/false> Example: /DisableAutoFakes:true
de: --DisableAutoFakes|/DisableAutoFakes:<true/false> Beispiel: /DisableAutoFakes:true
es: --DisableAutoFakes|/DisableAutoFakes:<true/false> Ejemplo: /DisableAutoFakes:true
fr: --DisableAutoFakes|/DisableAutoFakes:<true/false> Exemple : /DisableAutoFakes:true
it: --DisableAutoFakes|/DisableAutoFakes:<true/false> Esempio: /DisableAutoFakes:true
ja: --DisableAutoFakes|/DisableAutoFakes:<true/false> 例: /DisableAutoFakes:true
pl: --DisableAutoFakes|/DisableAutoFakes:<true/false> Przykład: /DisableAutoFakes:true
ru: --DisableAutoFakes|/DisableAutoFakes:<true/false> Пример: /DisableAutoFakes:true
tr: --DisableAutoFakes|/DisableAutoFakes:<true/false> Örnek: /DisableAutoFakes:true

# CollectWithTestSettingErrorMessage
source: --Collect|/Collect:"{0}" is not supported if test run is configured using testsettings.
de: --Collect|/Collect:"{0}" wird nicht unterstützt, wenn der Testlauf mithilfe von "testsettings" konfiguriert wurde.
es: --Collect|/Collect:"{0}" no se admite si la serie de pruebas está configurada mediante testsettings.
fr: --Collect|/Collect:"{0}" n'est pas pris en charge si la série de tests est configurée avec testsettings.
it: --Collect|/Collect:"{0}" non è supportato se l'esecuzione dei test viene configurata con testsettings.
ja: --Collect|/Collect:"{0}" は、testsettings を使用してテストの実行が構成されている場合、サポートされません。
pl: --Collect|/Collect: element „{0}” nie jest obsługiwany, jeśli przebieg testu został skonfigurowany za pomocą pliku testsettings.
pt_br: --Collect|/Collect:"{0}" não é compatível se a execução de teste é configurada usando configurações de teste.
ru: --Collect|/Collect:"{0}" не поддерживается, если тестовый запуск настроен с использованием testsettings.
tr: --Collect|/Collect: Test çalıştırmasını yapılandırmak için test ayarları kullanıldığında "{0}" desteklenmez.
zh_hant: 若使用測試設定來設定測試回合，則不支援 --Collect|/Collect:"{0}"。

# RunsettingsWithDCErrorMessage
source: Data collectors other than Code Coverage and Microsoft Fakes configured via run settings are not supported with embedded test settings. Please see https://aka.ms/vstest-configure-datacollector for more information. Run settings: {0}.
de: Eingebettete Testeinstellungen werden – mit Ausnahme von Code Coverage und Microsoft Fakes – nicht für Datensammler unterstützt, die über Ausführungseinstellungen konfiguriert wurden. Weitere Informationen finden Sie unter https://aka.ms/vstest-configure-datacollector. Ausführungseinstellungen: {0}.
es: Los recopiladores de datos diferentes de Cobertura de código y Microsoft Fakes configurados a través de la configuración de ejecución no se admiten con la configuración de pruebas integrada. Consulte https://aka.ms/vstest-configure-datacollector para obtener más información. Configuración de ejecución: {0}.
fr: Les collecteurs de données autres que la couverture du code et Microsoft Fakes configurés via les paramètres d'exécution ne sont pas pris en charge avec les paramètres de test incorporés. Pour plus d'informations, consultez https://aka.ms/vstest-configure-datacollector. Paramètres d'exécution : {0}.
it: Gli agenti di raccolta dati diversi da Code Coverage e Microsoft Fakes configurati tramite le impostazioni esecuzione test non sono supportati con impostazioni di test incorporate. Per altre informazioni, vedere https://aka.ms/vstest-configure-datacollector. Impostazioni esecuzione test: {0}.
ja: 実行設定を経由して構成されているコード カバレッジと Microsoft Fakes 以外のデータ コレクターは、埋め込まれたテストの設定ではサポートされていません。詳細については、https://aka.ms/vstest-configure-datacollector をご覧ください。実行設定: {0}。
pl: Moduły zbierające dane inne niż Pokrycie kodu i Microsoft Fakes skonfigurowane za pośrednictwem ustawień uruchamiania nie są obsługiwane przez osadzone ustawienia testów. Zobacz https://aka.ms/vstest-configure-datacollector w celu uzyskania dalszych informacji. Ustawienia uruchamiania: {0}.
pt_br: Coletores de dados que não sejam a Cobertura de Código e o Microsoft Fakes definidos por meio de configurações de execução não são compatíveis com configurações de teste inseridas. Consulte https://aka.ms/vstest-configure-datacollector para obter mais informações. Configurações de execução: {0}.
ru: Сборщики данных, настроенные в параметрах запуска, кроме покрытия кода и Microsoft Fakes, не поддерживаются со встроенными параметрами тестирования. Дополнительные сведения: https://aka.ms/vstest-configure-datacollector. Параметры запуска: {0}.
tr: Çalıştırma ayarları aracılığıyla yapılandırılan Kod Kapsamı ve Microsoft Fakes dışındaki veri toplayıcılar, ekli test ayarlarında desteklenmiyor. Daha fazla bilgi için bkz. https://aka.ms/vstest-configure-datacollector. Çalıştırma ayarları: {0}.
zh_hant: 除了程式碼涵蓋範圍與 Microsoft Fakes 以外，內嵌測試設定不支援透過回合設定來設定的資料收集器。如需詳細資訊，請參閱 https://aka.ms/vstest-configure-datacollector。回合設定: {0}。
