Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# EnableLoggerArgumentsInNetCore
source: --logger|/logger:<Logger Uri/FriendlyName> Specify a logger for test results. For example, to log results into a Visual Studio Test Results File (TRX) use /logger:trx[;LogFileName=<Defaults to unique file name>] Creates file in TestResults directory with given LogFileName. Change the verbosity level in log messages for console logger as shown below Example: /logger:console;verbosity=<Defaults to "minimal"> Allowed values for verbosity: quiet, minimal, normal and detailed. Change the diagnostic level prefix for console logger as shown below Example: /logger:console;prefix=<Defaults to "false"> More info on Console Logger here : https://aka.ms/console-logger
de: --logger|/logger:<Protokollierungs-Uri/FriendlyName> Gibt eine Protokollierung für die Testergebnisse an. Zum Protokollieren der Ergebnisse in eine Visual Studio-Testergebnisdatei (TRX-Datei) verwenden Sie z.B.: /logger:trx[;LogFileName=<Entspricht standardmäßig einem eindeutigen Dateinamen>] Erstellt eine Datei im TestResults-Verzeichnis mit dem entsprechenden LogFileName. Ändern Sie den Ausführlichkeitsgrad in Protokollnachrichten für die Konsolenprotokollierung wie unten gezeigt: Beispiel: /logger:console;verbosity=<Standardwert ist "minimal"> Zulässige Werte für die Ausführlichkeit: "quiet", "minimal", "normal" und "detailed". Ändern Sie das Präfix der Diagnoseebene für die Konsolenprotokollierung wie unten gezeigt: Beispiel: /logger:console;prefix=<Standardwert ist "false"> Weitere Informationen zur Konsolenprotokollierung finden Sie hier: https://aka.ms/console-logger
es: --logger|/logger:<URI del registrador/Nombre descriptivo> Especifica un registrador para los resultados de las pruebas. Por ejemplo, para registrar los resultados en un archivo de resultados de pruebas de Visual Studio (TRX) use /logger:trx[;LogFileName=<Valor predeterminado: nombre de archivo único>] Crea un archivo en el directorio TestResults con el valor LogFileName dado. Cambie el nivel de detalle en los mensajes de registro para el registrador de consola tal y como se muestra a continuación Ejemplo: /logger:console;verbosity=<Valor predeterminado: "minimal"> Valores permitidos para el nivel de detalle: quiet, minimal, normal y detailed. Cambie el prefijo de nivel de diagnóstico para el registrador de consola tal y como se muestra a continuación Ejemplo: /logger:console;prefix=<Valor predeterminado: "false"> Aquí encontrará más información sobre el registrador de consola: https://aka.ms/console-logger
fr: --logger|/logger:<URI/nom convivial du journaliseur> Spécifiez un journaliseur pour les résultats des tests. Par exemple, pour journaliser des résultats dans un fichier de résultats des tests Visual Studio (TRX), utilisez /logger:trx[;LogFileName=<nom de fichier unique par défaut>] Crée un fichier dans le répertoire TestResults avec le LogFileName indiqué. Change le niveau de verbosité des messages du journaliseur de la console, comme indiqué ci-dessous Exemple : /logger:console;verbosity=<"minimal" par défaut> Valeurs autorisées pour verbosity : quiet, minimal, normal et detailed. Change le préfixe du niveau de diagnostic pour le journaliseur de la console, comme indiqué ci-dessous Exemple : /logger:console;prefix=<"false" par défaut> En savoir plus sur le journaliseur de la console : https://aka.ms/console-logger
it: --logger|/logger:<URI/Nome descrittivo logger> Specifica un logger per i risultati dei test. Ad esempio, per registrare risultati in un file di risultati dei test di Visual Studio (TRX), usare /logger:trx[;LogFileName=<impostazione predefinita: nome file univoco>] Crea nella directory TestResults il file con il valore specificato per LogFileName. Consente di cambiare il livello di dettaglio nei messaggi del log per il logger di console come illustrato di seguito: Esempio: /logger:console;verbosity=<impostazione predefinita: "minimal"> Valori consentiti per verbosity: quiet, minimal, normal e detailed. Consente di cambiare il prefisso del livello di diagnostica per il logger di console come illustrato di seguito: Esempio: /logger:console;prefix=<impostazione predefinita: "false"> Per altre informazioni sul logger di console, vedere: https://aka.ms/console-logger
ja: --logger|/logger:<Logger Uri/FriendlyName> テスト結果のロガーを指定します。たとえば、結果のログを Visual Studio のテスト結果ファイル (TRX) に記録するには、/logger:trx[;LogFileName=<Defaults to unique file name>] を使用します TestResults ディレクトリに、指定された LogFileName でファイルを作成します。 コンソール ロガーのログ メッセージの詳細レベルを、次のように変更します 例: /logger:console;verbosity=<Defaults to "minimal"> 詳細レベルに使用できる値: quiet、minimal、normal、detailed。 コンソール ロガーの診断レベルのプレフィックスを次のように変更します 例: /logger:console;prefix=<Defaults to "false"> コンソール ロガーの詳細についてはこちらをご覧ください: https://aka.ms/console-logger
pl: --logger|/logger:<identyfikator URI/przyjazna nazwa rejestratora> Określa rejestrator dla wyników testu. Aby na przykład rejestrować wyniki testu do pliku wyników testu (TRX) programu Visual Studio, użyj parametru /logger:trx [;LogFileName=<wartość domyślna to unikatowa nazwa pliku>] Tworzy w katalogu TestResults plik z podaną nazwą LogFileName. Zmień poziom szczegółowości dla rejestratora konsoli, jak pokazano poniżej Przykład: /logger:console;verbosity=<wartość domyślna to „minimal”> Dozwolone wartości szczegółowości: quiet, minimal i normal. Zmień prefiks poziomu diagnostyki dla rejestratora konsoli, jak pokazano poniżej Przykład: /logger:console;prefix=<wartość domyślna to „false”> Więcej informacji o rejestratorze konsoli: https://aka.ms/console-logger
pt_br: --logger|/logger:<Logger Uri/FriendlyName> Especifique um agente para os resultados do teste. Por exemplo, para registrar os resultados em um TRX (Arquivo de Resultados de Teste) do Visual Studio use /logger:trx[;LogFileName=<O padrão é o nome do arquivo exclusivo>] Cria o arquivo no diretório TestResults com o LogFileName fornecido. Altere o nível de detalhes nas mensagens de log do agente do console, como é mostrado abaixo Exemplo: /logger:console;verbosity=<O padrão é "minimal"> Valores permitidos para os detalhes: quiet, minimal, normal e detailed. Altere o prefixo do nível de diagnóstico do agente do console como é mostrado abaixo Exemplo: /logger:console;prefix=<O padrão é "false"> Veja mais informações sobre o Agente do Console aqui: https://aka.ms/console-logger
ru: --logger|/logger:<URI или понятное имя средства ведения журнала> Укажите средство ведения журнала для результатов теста. Например, для записи результатов в файл результатов теста Visual Studio (TRX) введите /logger:trx[;LogFileName=<по умолчанию — уникальное имя файла>] В каталоге TestResults будет создан файл с указанным именем LogFileName. Измените уровень детализации сообщений в средстве ведения журнала консоли, как показано ниже Пример: /logger:console;verbosity=<по умолчанию — minimal (минимальная)> Допустимые значения детализации: quiet (отсутствует), minimal (минимальная), normal (обычная) и detailed (подробная). Измените префикс уровня диагностики для средства ведения журнала консоли, как показано ниже Пример: /logger:console;prefix=<по умолчанию — false (ложь)> Дополнительные сведения о средстве ведения журнала консоли: https://aka.ms/console-logger
tr: --logger|/logger:<Günlükçü URI/FriendlyName> Test sonuçları için bir günlükçü belirtin. Örneğin, sonuçları bir Visual Studio Test Sonuçları Dosyası'na (TRX) kaydetmek için şunu kullanın: /logger:trx[;LogFileName=<Varsayılan olarak benzersiz dosya adını alır>] İlgili LogFileName ile TestResults dizininde dosya oluşturur. Konsol günlükçüsü için ayrıntı düzeyini günlük iletilerinde aşağıda gösterildiği gibi değiştirin Örnek: /logger:console;verbosity=<Varsayılan olarak "minimal" değerini alır> Ayrıntı için izin verilen değerler: quiet, minimal, normal ve detailed. Konsol günlükçüsü için tanılama düzeyi ön ekini aşağıda gösterildiği gibi değiştirin Örnek: /logger:console;prefix=<Varsayılan olarak "false" değerini alır> Konsol Günlükçüsü hakkında daha fazla bilgi: https://aka.ms/console-logger
zh_hant: --logger|/logger:<記錄器 URI/易記名稱> 指定測試結果的記錄器。例如，若要將結果記錄到 Visual Studio 測試結果檔案 (TRX)，請使用 /logger:trx[;LogFileName=<預設為唯一的檔案名稱>] 使用指定的 LogFileName，在 TestResults 目錄中建立檔案。 變更主控台記錄器中記錄訊息的詳細資訊層級，如下所示 範例: /logger:console;verbosity=<預設為 "minimal"> 允許的詳細資訊值為: quiet、minimal、normal 及 detailed。 變更主控台記錄器的診斷層級前置詞，如下所示 範例: /logger:console;prefix=<預設為 "false"> 此處提供主控台記錄器的詳細資訊: https://aka.ms/console-logger

# BlameCollectDumpNotSupportedForPlatform
source: Collecting crash dumps by option CollectDump for Blame is not supported for this platform.
es: La recopilación de volcados de memoria mediante la opción CollectDump para Blame no se admite en esta plataforma.
fr: La collecte des vidages sur incident à l'aide de l'option CollectDump pour Blame n'est pas prise en charge pour cette plateforme.
it: L'opzione CollectDump per Blame non supporta la raccolta dei dump di arresto anomalo del sistema per questa piattaforma.
ja: このプラットフォームでは、Blame の CollectDump オプションによるクラッシュ ダンプの収集はサポートされていません。
pl: Zbieranie zrzutów awaryjnych przez opcję CollectDump programu Blame nie jest obsługiwane w przypadku tej platformy.
tr: Blame için CollectDump seçeneğine göre kilitlenme bilgi dökümlerinin toplanması bu platform için desteklenmiyor.

# BlameIncorrectOption
source: The blame parameter specified with blame, {0} is invalid. Ignoring this parameter.
de: Der mit "blame" angegebene blame-Parameter "{0}" ist ungültig. Dieser Parameter wird ignoriert.
es: El parámetro blame especificado con blame, {0} no es válido. Se omitirá este parámetro.
fr: Le paramètre blame spécifié avec blame, {0} n'est pas valide. Ce paramètre est ignoré.
it: Il parametro di Blame specificato con Blame {0} non è valido e verrà ignorato.
ja: blame で指定された blame パラメーター {0} は無効です。このパラメーターは無視されます。
pl: Parametr blame określony z argumentem blame, {0} jest nieprawidłowy. Ten parametr jest ignorowany.
pt_br: O parâmetro blame especificado com blame, {0} é inválido. Ignorando este parâmetro.
ru: Указанный с Blame параметр {0} недопустим. Он будет пропущен.
tr: Blame ile belirtilen blame parametresi {0} geçerli değil. Bu parametre yoksayılıyor.
zh_hant: 以 blame 指定的 blame 參數 {0} 無效，即將忽略此參數。

# InvalidDiagFilePath
source: Diag file path '{0}' is not valid.
de: Der Diagnosedateipfad "{0}" ist ungültig.
es: La ruta de acceso al archivo Diag "{0}" no es válida.
fr: Le chemin du fichier Diag '{0}' n'est pas valide.
it: Il percorso '{0}' del file di Diag non è valido.
ja: Diag ファイル パス '{0}' は無効です。
pl: Ścieżka pliku Diag „{0}” jest nieprawidłowa.
pt_br: O caminho para o arquivo diag '{0}' não é válido.
ru: Путь к файлу диагностики "{0}" недопустим.
tr: Diag dosya yolu '{0}' geçerli değil.
zh_hant: 診斷檔案路徑 '{0}' 無效。

# InvalidBlameArgument
source: Blame argument '{0}' is not valid.
de: Das blame-Argument "{0}" ist ungültig.
es: El argumento de Blame "{0}" no es válido.
fr: L'argument blame '{0}' n'est pas valide.
it: L'argomento '{0}' di Blame non è valido.
ja: Blame 引数 '{0}' は無効です。
pl: Argument Blame „{0}” jest nieprawidłowy.
pt_br: O argumento blame '{0}' não é válido.
ru: Аргумент Blame "{0}" недопустим.
tr: Blame bağımsız değişkeni '{0}' geçerli değil.
zh_hant: Blame 引數 '{0}' 無效。

# InvalidDiagArgument
source: Diag argument '{0}' is not valid.
de: Das diag-Argument "{0}" ist ungültig.
es: El argumento de Diag "{0}" no es válido.
fr: L'argument diag '{0}' n'est pas valide.
it: L'argomento '{0}' di Diag non è valido.
ja: Diag 引数 '{0}' は無効です。
pl: Argument Diag „{0}” jest nieprawidłowy.
pt_br: O argumento diag '{0}' não é válido.
ru: Аргумент диагностики "{0}" недопустим.
tr: Diag bağımsız değişkeni '{0}' geçerli değil.
zh_hant: 診斷引數 '{0}' 無效。

# InvalidLoggerArgument
source: Logger argument '{0}' is not valid.
de: Das logger-Argument "{0}" ist ungültig.
es: El argumento de Logger "{0}" no es válido.
fr: L'argument logger '{0}' n'est pas valide.
it: L'argomento '{0}' di Logger non è valido.
ja: Logger 引数 '{0}' は無効です。
pl: Argument Logger „{0}” jest nieprawidłowy.
pt_br: O argumento logger '{0}' não é válido.
ru: Аргумент средства ведения журнала "{0}" недопустим.
tr: Logger bağımsız değişkeni '{0}' geçerli değil.
zh_hant: 記錄器引數 '{0}' 無效。

# Framework35NotSupported
source: Framework35 is not supported. For projects targeting .Net Framework 3.5, test will run in CLR 4.0 "compatibility mode".
es: No se admite Framework35. Para los proyectos que tienen como destino .NET Framework 3.5, la prueba se ejecutará en el "modo de compatibilidad" de CLR 4.0.
fr: Framework35 n'est pas pris en charge. Pour les projets ciblant .NET Framework 3.5, le test s'exécutera dans CLR 4.0 en « mode de compatibilité ».
it: Framework35 non è supportato. Per i progetti destinati a .NET Framework 3.5, i test verranno eseguiti nella modalità di compatibilità di CLR 4.0.
ja: Framework35 はサポートされていません。.Net Framework 3.5 を対象にしたプロジェクトでは、CLR 4.0 の「互換モード」でテストが実行されます。
pl: Program Framework35 nie jest obsługiwany. W przypadku projektów przeznaczonych dla programu .Net Framework 3.5 testy zostaną uruchomione w aparacie CLR 4.0 w trybie zgodności.
tr: Framework35 desteklenmiyor. İçin hedefleme .net Framework 3.5, test CLR 4.0 "uyumluluk moduna" çalışacak.

# ProgressIndicatorString
source: Test run in progress
es: Serie de pruebas en curso
fr: Série de tests en cours
it: Esecuzione dei test in corso
ja: テストの実行が処理中
pl: Uruchomienie testu w toku
tr: Test çalıştırması devam ediyor

# TestRunSummaryTotalTests
source: Total tests: {0}
es: Pruebas totales: {0}
fr: Nombre total de tests : {0}
it: Totale test: {0}
ja: テストの合計数: {0}
pl: Łączna liczba testów: {0}
tr: Toplam test sayısı: {0}

# TestRunSummaryFailedTests
source: Failed: {0}
es: Incorrecto: {0}
fr: Non réussi(s) : {0}
it: Non superati: {0}
ja: 失敗: {0}
pl: Zakończone niepowodzeniem: {0}
tr: Başarısız: {0}

# TestRunSummaryPassedTests
source: Passed: {0}
es: Correcto: {0}
fr: Réussi(s) : {0}
it: Superati: {0}
ja: 成功: {0}
pl: Zakończone pomyślnie: {0}
tr: Geçti: {0}

# TestRunSummarySkippedTests
source: Skipped: {0}
es: Omitido: {0}
fr: Ignoré(s) : {0}
it: Ignorati: {0}
ja: スキップ: {0}
pl: Pominięte: {0}
tr: Atlandı: {0}

# InvalidArgument
source: The argument {0} is invalid. Please use the /help option to check the list of valid arguments.
es: El argumento {0} no es válido. Use la opción /help para comprobar la lista de argumentos válidos.
fr: L’argument {0} n'est pas valide. Utilisez l'option /help pour vérifier la liste des arguments valides.
it: L'argomento {0} non è valido. Usare l'opzione/help per verificare l'elenco di argomenti validi.
ja: 引数 {0} が無効です。有効な引数の一覧を確認するには、/help オプションを使用してください。
pl: Argument {0} jest nieprawidłowy. Użyj opcji /help, aby sprawdzić listę prawidłowych argumentów.
tr: {0} bağımsız değişkeni geçersiz. Lütfen geçerli bağımsız değişkenlerin listesini denetlemek için /help seçeneğini kullanın.

# TestSourcesDiscovered
source: A total of {0} test files matched the specified pattern.
es: {0} archivos de prueba en total coincidieron con el patrón especificado.
fr: Au total, {0} fichiers de test ont correspondu au modèle spécifié.
it: Un totale di {0} file di test corrisponde al criterio specificato.
ja: 合計 {0} 個のテスト ファイルが指定されたパターンと一致しました。
pl: Łączna liczba plików testowych dopasowanych do określonego wzorca: {0}.
tr: Toplam {0} test dosyası belirtilen desenle eşleşti.

# InvalidTestRunParameterArgument
source: The test run parameter argument '{0}' is invalid. Please use the format below. Format: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
es: El argumento del parámetro de la serie de pruebas "{0}" no es válido. Use el formato siguiente. Formato: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
fr: L'argument de paramètre de série de tests '{0}' est non valide. Utilisez le format ci-dessous. Format : TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
it: L'argomento '{0}' del parametro di esecuzione dei test non è valido. Usare il formato seguente. Formato: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
ja: テストの実行パラメーターの引数 '{0}' が無効です。以下の形式を使用してください。 形式: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
pl: Argument parametru przebiegu testu „{0}” jest nieprawidłowy. Użyj poniższego formatu. Format: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")
tr: '{0}' test çalıştırması parametre bağımsız değişkeni geçersiz. Lütfen aşağıdaki biçimi kullanın. Biçim: TestRunParameters.Parameter(name=\"<name>\", value=\"<value>\")

# BlameCollectDumpTestTimeoutNotSupportedForPlatform
source: Collecting hang dumps by option CollectDump with TestTimeout for Blame is not supported for this platform.
es: La recopilación de volcados de memoria mediante la opción CollectDump con TestTimeout para Blame no se admite en esta plataforma.
fr: La collecte des vidages sur blocage par l'option CollectDump avec TestTimeout pour Blame n'est pas prise en charge pour cette plateforme.
it: L'opzione CollectDump con TestTimeout per Blame non supporta la raccolta dei dump di blocco per questa piattaforma.
ja: このプラットフォームでは、Blame の TestTimeout を使用する CollectDump オプションによるハング ダンプの収集はサポートされていません。
pl: Zbieranie zrzutów po zawieszeniu przez opcję CollectDump z opcją TestTimeout programu Blame nie jest obsługiwane w przypadku tej platformy.
tr: Blame için TestTimeout ile CollectDump seçeneğine göre asılı kalma bilgi dökümlerinin toplanması bu platform için desteklenmiyor.

# DuplicateSource
source: Duplicate source {0} specified.
de: Es wurde eine doppelte Quelle {0} angegeben.
pt_br: Fonte duplicada {0} especificada.
ru: Указан повторяющийся источник {0}.
zh_hant: 指定了重複的來源 {0}。

# RunTestsArgumentHelp
source: [TestFileNames] Run tests from the specified files. Separate multiple test file names by spaces. Examples: mytestproject.dll mytestproject.dll myothertestproject.exe
de: [TestFileNames] Führt Tests aus den angegebenen Dateien aus. Trennen Sie mehrere Testdateinamen durch Leerzeichen. Beispiele: mytestproject.dll mytestproject.dll myothertestproject.exe
pt_br: [TestFileNames] Executar testes dos arquivos especificados. Use espaços para separar vários nomes de arquivo de teste. Exemplos: mytestproject.dll mytestproject.dll myothertestproject.exe
ru: [TestFileNames] Выполнение тестов из указанных файлов. При вводе нескольких имен файла теста они разделяются пробелами. Примеры: mytestproject.dll mytestproject.dll myothertestproject.exe
zh_hant: [TestFileNames] 從指定的檔案執行測試。請以空格分隔多個 測試檔案名稱。 範例: mytestproject.dll mytestproject.dll myothertestproject.exe

# ExecutionTimeFormatString
source: Test execution time: {0:0.0000} {1}
pt_br: Tempo de execução de teste: {0:0.0000} {1}
zh_hant: 測試執行時間: {0:0.0000} {1}

# FailedTestIndicator
source: Failed {0}
de: Fehler {0}
pt_br: {0} com falha
ru: Не пройдено: {0}
zh_hant: 失敗 {0}

# PassedTestIndicator
source: Passed {0}
de: Bestanden {0}
pt_br: {0} aprovados
ru: Пройдено: {0}
zh_hant: 成功 {0}

# SkippedTestIndicator
source: Skipped {0}
de: Übersprungen {0}
pt_br: {0} ignorados
ru: Пропущено: {0}
zh_hant: 略過 {0}

# TestRunSummary
source: Total tests: {0}. Passed: {1}. Failed: {2}. Skipped: {3}.
pt_br: Total de testes: {0}. Aprovados: {1}. Com falha: {2}. Ignorados: {3}.
zh_hant: 測試總計: {0}。成功: {1}。失敗: {2}。略過: {3}。

# NotRunTestIndicator
source: Not Run {0}
de: Nicht ausgeführt: {0}
pt_br: Não executar {0}
ru: Не запущен {0}
zh_hant: 未執行 {0}

# TestRunSummaryForCanceledOrAbortedRun
source: Total tests: Unknown. Passed: {0}. Failed: {1}. Skipped: {2}.
pt_br: Total de testes: desconhecido. Aprovados: {0}. Com falha: {1}. Ignorados: {2}.
zh_hant: 測試總數: 未知。已通過: {0}。失敗: {1}。已跳過: {2}。

# BlameCollectDumpNotSupportedForPlatform
source: CollectDump option for Blame is not supported for this platform.
de: Die CollectDump-Option für Blame wird für diese Plattform nicht unterstützt.
pt_br: A opção CollectDump para Blame não é compatível com esta plataforma.
ru: Параметр CollectDump для Blame не поддерживается на этой платформе.
zh_hant: 對此平台不支援 Blame 的 CollectDump 選項。
