Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# ParallelArgumentProcessorHelp
source: --Parallel|/Parallel Specifies that the tests be executed in parallel. By default up to all available cores on the machine may be used. The number of cores to use may be configured using a settings file.
de: --Parallel|/Parallel Gibt an, dass die Tests parallel ausgeführt werden. Standardmäßig werden alle verfügbaren Kerne auf dem Computer verwendet. Die Anzahl der zu verwendenden Kerne kann ggf. mithilfe einer Einstellungsdatei konfiguriert werden.
es: --Parallel|/Parallel Especifica que las pruebas se ejecuten en paralelo. De forma predeterminada, se pueden usar todos los núcleos disponibles en la máquina. El número de núcleos que debe usarse se puede especificar en el archivo de configuración.
fr: --Parallel|/Parallel Spécifie que les tests doivent être exécutés en parallèle. Par défaut, il est possible d'utiliser la totalité des cœurs disponibles sur la machine. Vous pouvez configurer le nombre de cœurs à utiliser à l'aide d'un fichier de paramètres.
it: --Parallel|/Parallel Specifica che i test devono essere eseguiti in parallelo. Per impostazione predefinita, è possibile usare al massimo tutti i core disponibili in questo computer. Il numero di core da usare può essere configurato con un file di impostazioni.
ja: --Parallel|/Parallel テストを並列で実行するように指定します。既定では、 コンピューター上の使用可能なコア数まで使用できます。 使用するコアの数は、設定ファイルを使用して構成できます。
pl: --Parallel|/Parallel Określa, że testy będą wykonywane równolegle. Domyślnie mogą zostać użyte wszystkie dostępne rdzenie maszyny. Liczbę rdzeni do użycia można skonfigurować za pomocą pliku ustawień.
pt_br: --Parallel|/Parallel Especifica que os testes sejam executados em paralelo. Por padrão, podem ser usados todos os núcleos disponíveis no computador. O número de núcleos a serem usados pode ser configurado usando um arquivo de configurações.
ru: --Parallel|/Parallel Указывает, что тесты должны выполняться параллельно. По умолчанию можно использовать любое имеющееся число ядер на компьютере. Число используемых ядер можно настроить с помощью файла параметров.
tr: --Parallel|/Parallel Testlerin paralel olarak yürütülmesini belirtir. Varsayılan olarak makine üzerindeki tüm mevcut çekirdekler kullanılabilir. Kullanılacak çekirdek sayısı bir ayarlar dosyası kullanılarak yapılandırılabilir.
zh_hant: --Parallel|/Parallel 指定平行執行測試。根據預設，最多會使用 機器上所有的可用核心。可使用設定檔設定 要使用的核心數。

# InvalidParallelCommand
source: Argument {0} is not expected in the 'Parallel' command. Specify the command without the argument (Example: vstest.console.exe myTests.dll /Parallel) and try again.
de: Das Argument "{0}" wird im Befehl "Parallel" nicht erwartet. Geben Sie den Befehl ohne das Argument an (Beispiel: vstest.console.exe myTests.dll /Parallel), und versuchen Sie es erneut.
es: El argumento {0} no se espera en el comando 'Parallel'. Especifique el comando sin el argumento (ejemplo: vstest.console.exe myTests.dll /Parallel) y vuelva a intentarlo.
fr: L'argument {0} n'est pas attendu dans la commande 'Parallel'. Spécifiez la commande sans l'argument (exemple : vstest.console.exe myTests.dll /Parallel), puis réessayez.
it: L'argomento {0} non è previsto nel comando 'Parallel'. Specificare il comando senza l'argomento, ad esempio: vstest.console.exe myTests.dll /Parallel, quindi riprovare.
ja: 引数 {0} は 'Parallel' コマンド内で使用できません。引数を使用せずにコマンドを指定して (例: vstest.console.exe myTests.dll /Parallel)、もう一度お試しください。
pl: Argument {0} nie jest oczekiwany w poleceniu „Parallel”. Określ polecenie bez tego argumentu (przykład: vstest.console.exe mojeTesty.dll /Parallel), a następnie spróbuj ponownie.
pt_br: O argumento {0} não é esperado no comando 'Parallel'. Especifique o comando sem o argumento (exemplo: vstest.console.exe myTests.dll /Parallel) e tente novamente.
ru: Аргумент {0} не ожидается в команде Parallel. Укажите команду без аргумента (например, vstest.console.exe myTests.dll /Parallel) и повторите попытку.
tr: {0} bağımsız değişkeni 'Parallel' komutunda beklenmiyor. Komutu bağımsız değişken olmadan belirtin (Örnek: vstest.console.exe myTests.dll /Parallel) ve yeniden deneyin.
zh_hant: 'Parallel' 命令中不應該使用引數 {0}。請指定不加引數的命令 (範例: vstest.console.exe myTests.dll /Parallel)，並再試一次。

source: Cannot be null or empty
de: Darf nicht NULL oder leer sein.
es: No puede ser nulo ni estar vacío
fr: Ne peut pas avoir une valeur null ou être vide
it: Non può essere Null o vuoto
ja: null または空にすることはできません。
pl: Nie może mieć wartości null ani być pusty
pt_br: Não pode ser nulo ou estar vazio
ru: Неопределенное или отсутствующее значение недопустимо.
tr: Null veya boş olamaz
zh_hant: 不可為 null 或空白

# PortArgumentHelp
source: --Port|/Port:<Port> The Port for socket connection and receiving the event messages.
de: --Port|/Port:<Port> Der Port für die Socketverbindung sowie zum Empfangen der Ereignismeldungen.
es: --Port|/Port:<Puerto> Puerto para la conexión de socket y la recepción de mensajes de eventos.
fr: --Port|/Port:<port> Port de connexion du socket et de réception des messages d'événement.
it: --Port|/Port:<Porta> Porta per la connessione socket e la ricezione dei messaggi dell'evento.
ja: --Port|/Port:<Port> ソケット接続およびイベント メッセージを受信するためのポートです。
pl: --Port|/Port:<port> Port służący do połączenia z gniazdem i odbierania komunikatów zdarzeń.
pt_br: --Port|/Port:<Port> A porta de conexão de soquete e de recebimento de mensagens de evento.
ru: --Port|/Port:<порт> Порт для подключения через сокет и получения событий сообщений.
tr: --Port|/Port:<Bağlantı Noktası> Yuva bağlantısı ve olay iletilerini almaya yönelik Bağlantı Noktası.
zh_hant: --Port|/Port:<連接埠> 用於通訊端連線以及接收事件訊息的連接埠。

# InvalidPortArgument
source: The --Port|/Port argument requires the port number which is an integer. Specify the port for socket connection and receiving the event messages.
de: Das Argument "--Port|/Port" erfordert die Portnummer (Integerwert). Geben Sie den Port für die Socketverbindung und den Empfang von Ereignismeldungen an.
es: El argumento --Port|/Port requiere el número de puerto, que es un entero. Especifique el puerto para la conexión de socket y la recepción de mensajes de eventos.
fr: L'argument --Port|/Port nécessite le numéro de port, qui doit être indiqué sous forme d'entier. Spécifiez le port de connexion du socket et de réception des messages d'événement.
it: Con l'argomento --Port|/Port è richiesto un numero di porta che corrisponde a un numero intero. Specificare la porta per la connessione socket e la ricezione dei messaggi dell'evento.
ja: --Port|/Port 引数には、整数であるポート番号を指定する必要があります。ソケット接続およびイベント メッセージ受信用のポートを指定してください。
pl: Argument --Port|/Port wymaga numeru portu będącego liczbą całkowitą. Określ port na potrzeby połączenia z gniazdem i odbierania komunikatów zdarzeń.
pt_br: O argumento --Port|/Port requer o número da porta que é um número inteiro. Especifique a porta de conexão de soquete e de recebimento de mensagens de evento.
ru: Для аргумента --Port|/Port требуется указать номер порта, который должен быть целым числом. Укажите порт для подключения через сокет и получения событий сообщений.
tr: --Port|/Port bağımsız değişkeni tamsayı olan bir bağlantı noktası numarası gerektirir. Yuva bağlantısına ve olay iletilerini almaya yönelik bağlantı noktasını belirtin.
zh_hant: --Port|/Port 引數需要整數的連接埠號碼。指定用於通訊端連線以及接收事件訊息的連接埠。

# AssemblyPathInvalid
source: Unable to find the assembly under test. Please make sure that the project is built.
de: Die aktuell getestete Assembly wurde nicht gefunden. Stellen Sie sicher, dass das Projekt erstellt wird.
es: No se encuentra el ensamblado sometido a pruebas. Asegúrese de que el proyecto se ha compilado.
fr: L'assembly testé est introuvable. Vérifiez que le projet est généré.
it: L'assembly sottoposto a test non è stato trovato. Assicurarsi che il progetto sia compilato.
ja: テスト中のアセンブリが見つかりません。プロジェクトがビルドされたことをご確認ください。
pl: Nie można odnaleźć testowanego zestawu. Upewnij się, że projekt został skompilowany.
pt_br: Não é possível localizar o assembly em teste. Verifique se o projeto foi criado.
ru: Не удается найти тестируемую сборку. Убедитесь, что проект создан.
tr: Test kapsamındaki bütünleştirilmiş kod bulunamıyor. Lütfen projenin oluşturulduğundan emin olun.
zh_hant: 找不到正在進行測試的組件。請確定已建置專案。

# ProjectPathNotFound
source: The Path {0} does not exist.
de: Der Pfad "{0}" ist nicht vorhanden.
es: La ruta de acceso {0} no existe.
fr: Le chemin {0} n'existe pas.
it: Il percorso {0} non esiste.
ja: パス {0} は存在しません。
pl: Ścieżka {0} nie istnieje.
pt_br: O caminho {0} não existe.
ru: Путь {0} не существует.
tr: {0} Yolu yok.
zh_hant: 路徑 {0} 不存在。

# BuildBasePathArgumentHelp
source: --BuildBasePath|/BuildBasePath:<BuildBasePath> The directory containing the temporary outputs.
de: --BuildBasePath|/BuildBasePath:<BuildBasisPfad> Das Verzeichnis, das die temporären Ausgaben enthält.
es: --BuildBasePath|/BuildBasePath:<Ruta de acceso base de la compilación> Directorio que contiene las salidas temporales.
fr: --BuildBasePath|/BuildBasePath:<chemin de base de la build> Répertoire contenant les sorties temporaires.
it: --BuildBasePath|/BuildBasePath:<PercorsoBaseCompilazione> Directory che contiene gli output temporanei.
ja: --BuildBasePath|/BuildBasePath:<BuildBasePath> 一時的な出力を含むディレクトリです。
pl: --BuildBasePath|/BuildBasePath:<podstawowa ścieżka do kompilacji> Katalog zawierający tymczasowe dane wyjściowe.
pt_br: --BuildBasePath|/BuildBasePath:<BuildBasePath> O diretório que contém as saídas temporárias.
ru: --BuildBasePath|/BuildBasePath:<базовый_путь_к_сборке> Каталог, содержащий временные выходные данные.
tr: --BuildBasePath|/BuildBasePath:<BuildBasePath> Geçici çıkışları içeren dizin.
zh_hant: --BuildBasePath|/BuildBasePath:<BuildBasePath> 包含暫時輸出的目錄。

# ConfigurationArgumentHelp
source: -c|--Configuration|/c|/Configuration:<Configuration> The configuration the project is built for i.e. Debug/Release
de: -c|--Configuration|/c|/Configuration:<Konfiguration> Die Konfiguration, für die das Projekt erstellt wird, z. B. Debug/Release.
es: -c|--Configuration|/c|/Configuration:<Configuración> Configuración para la que se ha compilado el proyecto, es decir, Debug/Release
fr: -c|--Configuration|/c|/Configuration:<configuration> Configuration pour laquelle le projet est généré. Exemple : Debug/Release
it: -c|--Configuration|/c|/Configuration:<Configurazione> Configurazione per cui viene compilato il progetto, ad esempio Debug/Release
ja: -c|--Configuration|/c|/Configuration:<Configuration> プロジェクトをビルドする構成です。つまり、Debug/Release
pl: -c|--Configuration|/c|/Configuration:<konfiguracja> Konfiguracja, na potrzeby której kompilowany jest projekt, na przykład Debug/Release
pt_br: -c|--Configuration|/c|/Configuration:<Configuration> A configuração para a qual o projeto foi criado, ou seja, Depuração/Liberação
ru: -c|--Configuration|/c|/Configuration:<конфигурация> Конфигурация, для которой предназначен проект, например Debug/Release.
tr: -c|--Configuration|/c|/Configuration:<Configuration> Projenin derleme nedeni olan yapılandırma (Debug/Release)
zh_hant: -c|--Configuration|/c|/Configuration:<組態> 建置專案的組態，即 Debug/Release

# InvalidConfiguration
source: The given configuration is invalid.
de: Die angegebene Konfiguration ist ungültig.
es: La configuración dada no es válida.
fr: La configuration indiquée est non valide.
it: La configurazione specificata non è valida.
ja: 指定の構成が無効です。
pl: Podana konfiguracja jest nieprawidłowa.
pt_br: A configuração fornecida é inválida.
ru: Данная конфигурация недопустима.
tr: Belirtilen yapılandırma geçersiz.
zh_hant: 給定的組態無效。

# OutputArgumentHelp
source: -o|--Output|/o|/Output:<Output> The directory containing the binaries to run.
de: -o|--Output|/o|/Output:<Ausgabe> Das Verzeichnis, das die auszuführenden Binärdateien enthält.
es: -o|--Output|/o|/Output:<Salida> Directorio que contiene los binarios que se van a ejecutar.
fr: -o|--Output|/o|/Output:<sortie> Répertoire contenant les fichiers binaires à exécuter.
it: -o|--Output|/o|/Output:<Output> Directory contenente i file binari da eseguire.
ja: -o|--Output|/o|/Output:<Output> 実行するバイナリを含むディレクトリです。
pl: -o|--Output|/o|/Output:<dane wyjściowe> Katalog zawierający pliki binarne do uruchomienia.
pt_br: -o|--Output|/o|/Output:<Output> O diretório que contém os binários a serem executados.
ru: -o|--Output|/o|/Output:<выходные данные> Каталог, содержащий двоичные файлы для запуска.
tr: -o|--Output|/o|/Output:<Çıkış> Çalıştırılacak ikili dosyaları içeren dizin.
zh_hant: -o|--Output|/o|/Output:<輸出> 包含要執行之二進位檔的目錄。

# BuildBasePathNotFound
source: The BuildBasePath was not found, provide a valid path and try again.
de: Der BuildBasePath wurde nicht gefunden. Geben Sie einen gültigen Pfad ein, und versuchen Sie es erneut.
es: No se encuentra la ruta de acceso base de la compilación. Proporcione una ruta de acceso válida y vuelva a intentarlo.
fr: BuildBasePath est introuvable. Fournissez un chemin valide, puis réessayez.
it: Il percorso di base di compilazione non è stato trovato. Specificare un percorso valido e riprovare.
ja: BuildBasePath が見つかりませんでした。有効なパスを指定してもう一度お試しください。
pl: Nie można odnaleźć parametru BuildBasePath. Podaj prawidłową ścieżkę i spróbuj ponownie.
pt_br: O BuildBasePath não foi encontrado, forneça um caminho válido e tente novamente.
ru: Базовый путь к сборке не найден, укажите допустимый путь и повторите попытку.
tr: BuildBasePath bulunamadı, geçerli bir yol belirtin ve yeniden deneyin.
zh_hant: 找不到 BuildBasePath。請提供有效的路徑，並再試一次。

# OutputPathNotFound
source: The Output path was not found, provide a valid path and try again.
de: Der Ausgabepfad wurde nicht gefunden. Geben Sie einen gültigen Pfad ein, und versuchen Sie es erneut.
es: No se encuentra la ruta de acceso de salida. Proporcione una ruta de acceso válida y vuelva a intentarlo.
fr: Le chemin associé à Output est introuvable. Fournissez un chemin valide, puis réessayez.
it: Il percorso di output non è stato trovato. Specificare un percorso valido e riprovare.
ja: Output パスが見つかりませんでした。有効なパスを指定してもう一度お試しください。
pl: Nie można odnaleźć ścieżki wyjściowej. Podaj prawidłową ścieżkę i spróbuj ponownie.
pt_br: O caminho de saída não foi encontrado, forneça um caminho válido e tente novamente.
ru: Выходной путь не найден, укажите допустимый путь и повторите попытку.
tr: Çıkış yolu bulunamadı, geçerli bir yol belirtin ve yeniden deneyin.
zh_hant: 找不到輸出路徑。請提供有效的路徑，並再試一次。

# AddnlInfoMessagesBanner
source: Additional Information Messages:
de: Weitere Informationsmeldungen:
es: Mensajes con información adicional:
fr: Messages d'informations supplémentaires :
it: Ulteriori messaggi informativi:
ja: 追加情報メッセージ:
pl: Dodatkowe komunikaty informacyjne:
pt_br: Mensagens de informações adicionais:
ru: Дополнительные информационные сообщения:
tr: Ek Bilgi İletileri:
zh_hant: 其他資訊訊息:

source: Days
de: Tage
es: Días
fr: Jours
it: Giorni
ja: 日数
pl: Dni
pt_br: Dias
ru: Дни
tr: Gün
zh_hant: 日

# ErrorMessageBanner
source: Error Message:
de: Fehlermeldung:
es: Mensaje de error:
fr: Message d'erreur :
it: Messaggio di errore:
ja: エラー メッセージ:
pl: Komunikat o błędzie:
pt_br: Mensagem de erro:
ru: Сообщение об ошибке:
tr: Hata İletisi:
zh_hant: 錯誤訊息:

# ExecutionTimeFormatString
source: Total time: {0:0.0000} {1}
es: Tiempo total: {0:0.0000} {1}
fr: Durée totale : {0:0.0000} {1}
it: Tempo totale: {0:0.0000} {1}
ja: 合計時間: {0:0.0000} {1}
pl: Łączny czas: {0:0.0000} {1}
tr: Toplam süre: {0:0.0000} {1}

source: Hours
de: Stunden
es: Horas
fr: Heures
it: Ore
ja: 時間
pl: Godziny
pt_br: Horas
ru: Часы
tr: Saat
zh_hant: 小時

# LoggerNotFound
source: Could not find a test logger with URI or FriendlyName '{0}'.
de: Es wurde keine Testprotokollierung mit dem URI oder FriendlyName "{0}" gefunden.
es: No se encuentra un registrador de pruebas con el URI o el nombre descriptivo '{0}'.
fr: Impossible de localiser un enregistreur d'événements de tests ayant pour URI ou FriendlyName '{0}'.
it: Non è stato trovato alcun logger di test con URI o nome descrittivo '{0}'.
ja: URI または FriendlyName が '{0}' のテスト ロガーは見つかりませんでした。
pl: Nie można odnaleźć rejestratora testów z identyfikatorem URI lub przyjazną nazwą „{0}”.
pt_br: Não foi possível localizar um agente de teste com o URI ou o FriendlyName '{0}'.
ru: Не удалось найти средство ведения журнала тестирования с URI или понятным именем "{0}".
tr: URI veya FriendlyName değeri '{0}' olan bir test günlükçüsü bulunamadı.
zh_hant: 找不到具有 URI 或 FriendlyName '{0}' 的測試記錄器。

source: Minutes
de: Minuten
es: Minutos
it: Minuti
ja: 分
pl: Minuty
pt_br: Minutos
ru: Минуты
tr: Dakika
zh_hant: 分鐘

source: Seconds
de: Sekunden
es: Segundos
fr: Secondes
it: Secondi
ja: 秒
pl: Sekundy
pt_br: Segundos
ru: Секунды
tr: Saniye
zh_hant: 秒

# StacktraceBanner
source: Stack Trace:
de: Stapelverfolgung:
es: Seguimiento de la pila:
fr: Arborescence des appels de procédure :
it: Analisi dello stack:
ja: スタック トレース:
pl: Ślad stosu:
pt_br: Rastreamento de pilha:
ru: Трассировка стека:
tr: Yığın İzleme:
zh_hant: 堆疊追蹤:

# StdErrMessagesBanner
source: Standard Error Messages:
de: Standardfehlermeldungen:
es: Mensajes de error estándar:
fr: Messages d'erreur standard :
it: Messaggi di errore standard:
ja: 標準エラー メッセージ:
pl: Standardowe komunikaty o błędach:
pt_br: Mensagens de erro padrão:
ru: Стандартные сообщения об ошибке:
tr: Standart Hata İletileri:
zh_hant: 標準錯誤訊息:

# StdOutMessagesBanner
source: Standard Output Messages:
de: Standardausgabemeldungen:
es: Mensajes de salida estándar:
fr: Messages de sortie standard :
it: Messaggi di output standard:
ja: 標準出力メッセージ:
pl: Standardowe komunikaty wyjściowe:
pt_br: Mensagens de saída padrão:
ru: Стандартные выходные сообщения:
tr: Standart Çıkış İletileri:
zh_hant: 標準輸出訊息:

# AttachmentsBanner
source: Attachments:
de: Anlagen:
es: Datos adjuntos:
fr: Pièces jointes :
it: Allegati:
ja: 添付ファイル:
pl: Załączniki:
pt_br: Anexos:
ru: Вложения:
tr: Ekler:
zh_hant: 附件:

# NoTestsAvailableInSources
source: No test is available in {0}. Make sure that installed test discoverers & executors, platform & framework version settings are appropriate and try again.
de: In {0} ist kein Test verfügbar. Stellen Sie sicher, dass die installierten Versionseinstellungen für Testdiscoverer und -executor, Plattform und Framework richtig sind, und versuchen Sie es erneut.
es: No hay ninguna prueba disponible en {0}. Asegúrese de que la configuración de detectores y ejecutores de pruebas, plataforma y versión de .NET Framework sea correcta e inténtelo de nuevo.
fr: Aucun test disponible dans {0}. Vérifiez que les paramètres des découvreurs, des exécuteurs, de la plateforme et de la version de Framework installés sont appropriés, puis réessayez.
it: Non è disponibile alcun test in {0}. Verificare che le impostazioni delle versioni installate di piattaforma e framework, agenti di individuazione ed executor di test siano appropriate e riprovare.
ja: {0} で使用できるテストはありません。インストールされているテスト探索プログラム、実行プログラム、プラットフォーム、およびフレームワークのバージョン設定が適切であることを確認し、再試行してください。
pl: Brak dostępnych testów w elemencie {0}. Upewnij się, że ustawienia zainstalowanych wykrywaczy testów, modułów wykonywania, platform i wersji struktur są odpowiednie, i spróbuj ponownie.
pt_br: Não há nenhum teste disponível em {0}. Verifique se as configurações de versão dos discoverers, dos executores, da plataforma e da estrutura estão corretas e tente novamente.
ru: В {0} нет доступных тестов. Проверьте правильность параметров установленных средств обнаружения и выполнения тестов, а также платформы и версии среды, и повторите попытку.
tr: {0} içinde hiç test yok. Yüklü test bulucuları ve yükleyicileri, platform ve çerçeve sürümü ayarlarının uygun olmasına dikkat edin ve yeniden deneyin.
zh_hant: {0} 中沒有可供使用的測試。請確定已安裝適當的測試探索程式及執行程式、平台與 Framework 版本設定，並再試一次。

# FailedTestIndicator
source: Failed
es: Con error
fr: Échoué
it: Non superato
ja: 失敗
pl: Niepowodzenie
tr: Başarısız

# PassedTestIndicator
source: Passed
es: Correctas
fr: Réussi
it: Superato
ja: 成功
pl: Powodzenie
tr: Başarılı

# SkippedTestIndicator
source: Skipped
es: Omitidas
fr: Ignoré
it: Ignorato
ja: スキップ
pl: Pominięto
tr: Atlandı

# DiscoveryFailed
source: Discovery failed for given sources. Exception : {0}
de: Fehler bei der Ermittlung für die angegebenen Quellen. Ausnahme: {0}
es: No se pudo llevar a cabo la detección en los orígenes dados. Excepción: {0}
fr: Échec de la découverte pour les sources indiquées. Exception : {0}
it: L'individuazione non è riuscita per le origini specificate. Eccezione: {0}
ja: 指定したソースで検出が失敗しました。例外 : {0}
pl: Wykrywanie nie powiodło się dla podanych źródeł. Wyjątek: {0}
pt_br: Falha na descoberta para as fontes fornecidas. Exceção: {0}
ru: Не удалось выполнить обнаружение для заданных источников. Исключение: {0}
tr: Belirtilen kaynaklar için bulma başarısız oldu. Özel durum: {0}
zh_hant: 給定來源的探索失敗。例外狀況: {0}

# ParentProcessIdArgumentHelp
source: --ParentProcessId|/ParentProcessId:<ParentProcessId> Process Id of the Parent Process responsible for launching current process.
de: --ParentProcessId|/ParentProcessId:<ÜbergeordneteProzessID> Die Prozess-ID des übergeordneten Prozesses, der für den Start des aktuellen Prozesses verantwortlich ist.
es: --ParentProcessId|/ParentProcessId:<idProcesoPrimario> Identificador del proceso primario responsable del inicio del proceso actual.
fr: --ParentProcessId|/ParentProcessId:<id du processus parent> ID de processus du processus parent chargé de lancer le processus actuel.
it: --ParentProcessId|/ParentProcessId:<ParentProcessId> ID del processo padre responsabile dell'avvio del processo corrente.
ja: --ParentProcessId|/ParentProcessId:<ParentProcessId> 現在のプロセスを起動する親プロセスのプロセス ID です。
pl: --ParentProcessId|/ParentProcessId:<identyfikator procesu nadrzędnego> Identyfikator procesu nadrzędnego odpowiedzialnego za uruchomienie bieżącego procesu.
pt_br: --ParentProcessId|/ParentProcessId:<ParentProcessId> ID do processo pai responsável pela inicialização do processo atual.
ru: --ParentProcessId|/ParentProcessId:<ИД_родительского_процесса> Идентификатор родительского процесса, ответственного за запуск текущего процесса.
tr: --ParentProcessId|/ParentProcessId:<ParentProcessId> Geçerli işlemi başlatmadan sorumlu Üst İşlemin işlem kimliği.
zh_hant: --ParentProcessId|/ParentProcessId:<ParentProcessId> 負責啟動目前處理序之父處理序的處理序識別碼。
