Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# InvalidFrameworkVersion
source: Invalid .Net Framework version:{0}. Please give the fullname of the TargetFramework(Example: .NETCoreApp,Version=v2.0). Other supported .Net Framework versions are Framework40, Framework45, FrameworkCore10 and FrameworkUap10.
de: Ungültige .NET Framework-Version: {0}. Geben Sie den vollständigen Namen von TargetFramework an (Beispiel: .NETCoreApp,Version=v2.0). Weitere unterstützte .NET Framework-Versionen sind "Framework40", "Framework45", "FrameworkCore10" und "FrameworkUap10".
es: Versión de .Net Framework no válida: {0}. Proporcione el nombre completo de TargetFramework (ejemplo: .NETCoreApp,Version=v2.0). Otras versiones de .Net Framework admitidas son Framework40, Framework45, FrameworkCore10 y FrameworkUap10.
fr: Version non valide du .Net Framework : {0}. Indiquez le nom complet de TargetFramework (exemple : .NETCoreApp,Version=v2.0). Les autres versions du .Net Framework prises en charge sont Framework40, Framework45, FrameworkCore10 et FrameworkUap10.
it: La versione di .NET Framework {0} non è valida. Specificare il nome completo della versione di .NET Framework di destinazione ad esempio .NETCoreApp,Version=v2.0. Altre versioni di .NET Framework supportate: Framework40, Framework45, FrameworkCore10 e FrameworkUap10.
ja: .Net Framework バージョンが無効です: {0}。TargetFramework の完全な名前を指定してください (例: .NETCoreApp,Version=v2.0)。その他のサポートされる .Net Framework バージョンは Framework40、Framework45、FrameworkCore10、FrameworkUap10 です。
pl: Nieprawidłowa wersja programu .NET Framework: {0}. Podaj pełną nazwę struktury docelowej (np. .NETCoreApp,Version=v2.0). Inne obsługiwane wersje programu .NET Framework to Framework40, Framework45, FrameworkCore10 i FrameworkUap10.
pt_br: Versão inválida do .Net Framework: {0}. Forneça o nome completo do TargetFramework(Exemplo: .NETCoreApp,Version=v2.0). Outras versões compatíveis do .Net Framework são Framework40, Framework45, FrameworkCore10 e FrameworkUap10.
ru: Недопустимая версия .NET Framework: {0}. Укажите полное имя целевой платформы (например: .NETCoreApp,Version=v2.0). Другие поддерживаемые версии .NET Framework: Framework40, Framework45, FrameworkCore10 и FrameworkUap10.
tr: Geçersiz .NET Framework sürümü:{0}. Lütfen TargetFramework tam adını (Örnek: .NETCoreApp,Sürüm=v2.0) belirtin. Desteklenen diğer .NET Framework sürümleri Framework40, Framework45, FrameworkCore10 and FrameworkUap10’dur.
zh_hant: .Net Framework 版本無效:{0}。請提供 TargetFramework 的全名 (例如: .NETCoreApp,Version=v2.0)。其他支援的 .Net Framework 版本為 Framework40、Framework45、FrameworkCore10 以及 FrameworkUap10。

# AppContainerTestPrerequisiteFail
source: Could not start test run for unit tests for Windows Store app: {0}.
de: Der Testlauf für Komponententests für die Windows Store-App konnte nicht gestartet werden: {0}.
es: No se puede iniciar la serie de pruebas unitarias para la aplicación de la Tienda Windows: {0}.
fr: Impossible de démarrer la série de tests des tests unitaires pour une application du Windows Store : {0}.
it: Non è stato possibile avviare l'esecuzione dei test per unit test per l'app di Windows Store: {0}.
ja: Windows ストア アプリの単体テストのテスト実行を開始できません: {0}。
pl: Nie można rozpocząć przebiegu testu dla testów jednostkowych aplikacji ze Sklepu Windows: {0}.
pt_br: Não foi possível iniciar a execução de testes de unidade para o aplicativo da Windows Store: {0}.
ru: Не удалось запустить тестовый запуск для модульных тестов приложений для Магазина Windows: {0}.
tr: Windows Mağazası uygulamalarına yönelik birim testleri için test çalıştırması başlatılamadı: {0}.
zh_hant: 無法針對 Windows 市集應用程式的單元測試啟動測試回合: {0}。

# TestCaseFilterArgumentHelp
source: --TestCaseFilter|/TestCaseFilter:<Expression> Run tests that match the given expression. <Expression> is of the format <property>Operator<value>[|&<Expression>] where Operator is one of =, != or ~ (Operator ~ has 'contains' semantics and is applicable for string properties like DisplayName). Parenthesis () can be used to group sub-expressions. Examples: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
de: --TestCaseFilter|/TestCaseFilter:<Ausdruck> Führt Tests aus, die mit dem angegebenen Ausdruck übereinstimmen. <Ausdruck> weist das Format <Eigenschaft>Operator<Wert>[|&<Ausdruck>] auf. Dabei ist "Operator" eines der Zeichen =, != oder ~ (der Operator ~ weist Semantik vom Typ "contains" auf und gilt für Zeichenfolgeneigenschaften wie DisplayName). Klammern () können zum Gruppieren von Unterausdrücken verwendet werden. Beispiele: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MeineTestMethode)"
es: --TestCaseFilter|/TestCaseFilter:<Expresión> Ejecuta pruebas que coinciden con la expresión dada. <Expresión> tiene el formato <propiedad>Operador<valor>[|&<Expresión>] donde Operador es uno de =, != o ~ (el operador ~ tiene la semántica "contiene" y es aplicable a propiedades de cadena como DisplayName). Se pueden usar paréntesis () para agrupar subexpresiones. Ejemplos: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MiMétodoDePrueba)"
fr: --TestCaseFilter|/TestCaseFilter:<expression> Permet d'exécuter les tests qui correspondent à l'expression indiquée. <Expression> est au format <property>Operator<value>[|&<Expression>] où Operator correspond à =, != ou ~ (Operator ~ utilise la sémantique 'contient' et s'applique aux propriétés de chaîne telles que DisplayName). Vous pouvez utiliser des parenthèses () pour regrouper les sous-expressions. Exemples : /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
it: --TestCaseFilter|/TestCaseFilter:<Espressione> Esegue test corrispondenti all'espressione specificata. <Espressione> è nel formato <proprietà>Operatore<valore>[|&<Espressione>] dopo l'operatore è =, != oppure ~ (l'operatore ~ implica semantica 'contains' ed è applicabile solo per proprietà di stringhe quali DisplayName). È possibile usare le parentesi () per raggruppare sottoespressioni. Esempi: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
ja: --TestCaseFilter|/TestCaseFilter:<Expression> 指定された式と一致するテストを実行します。 <Expression> の形式は <property>演算子<value>[|&<Expression>] で、演算子は =、!=、~ のいずれかです (演算子 ~ には '含む' セマンティクスがあり、DisplayName などの文字列プロパティに適用されます)。 かっこ () は、サブ式のグループ化に使用できます。 例: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
pl: --TestCaseFilter|/TestCaseFilter:<wyrażenie> Uruchamia testy, które są zgodne z danym wyrażeniem. Element <wyrażenie> jest w formacie <właściwość>Operator<wartość>[|&<wyrażenie>] gdzie Operator to =, != lub ~ (operator ~ ma semantykę „zawiera” i jest stosowany dla właściwości ciągów, takich jak nazwa wyświetlana). Nawiasy () mogą służyć do grupowania wyrażeń podrzędnych. Przykłady: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nocne |Name=MojaMetodaTestowa)"
pt_br: --TestCaseFilter|/TestCaseFilter:<Expression> Executar testes que correspondam à expressão fornecida. <Expression> está no formato <property>Operator<value>[|&<Expression>] em que o operador é =, != ou ~ (o operador ~ tem 'contains' e aplica-se a propriedades de cadeia de caracteres como DisplayName). Parênteses () podem ser usados para agrupar subexpressões. Exemplos: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)" Name=MyTestMethod) "
ru: --TestCaseFilter|/TestCaseFilter:<выражение> Запуск тестов, соответствующих заданному выражению. <Выражение> имеет формат <свойство>оператор<значение>[|&<выражение>], где в качестве оператора может использоваться =, != или ~ (оператор ~ имеет семантику "содержит" и применим к строковым свойствам, таким как DisplayName). Вложенные выражения можно группировать с помощью скобок. Примеры: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"
tr: --TestCaseFilter|/TestCaseFilter:<İfade> Verilen ifadeyle eşleşen testleri çalıştırır. <İfade>, <özellik>İşleç<değer>[|&<İfade>] biçimindedir; burada İşleç =, != veya ~ simgelerinden biridir (~ İşleci 'içerir' anlamına gelir ve DisplayName gibi dize özelliklerine uygulanabilir). Alt ifadeleri gruplandırmak için ayraç () kullanılabilir. Örnekler: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(TamAd~Gece |Name=TestYöntemim)"
zh_hant: --TestCaseFilter|/TestCaseFilter:<運算式> 執行符合給定運算式的測試。 <運算式> 的格式為 <property>Operator<value>[|&<Expression>] 其中 Operator 是 =、!= 或 ~ 中的其中一項 (運算子 ~ 具有 'contains' 語意，而且適用於 DisplayName 之類的字串屬性)。 您可以使用括號 () 將子運算式分組。 範例: /TestCaseFilter:"Priority=1" /TestCaseFilter:"(FullyQualifiedName~Nightly |Name=MyTestMethod)"

# TestCaseFilterValueRequired
source: The /TestCaseFilter argument requires the filter value. Filter value can be <property>=<value> type. Examples: "Priority=1", "TestCategory=Nightly"
de: Das Argument "/TestCaseFilter" erfordert den Filterwert. Der Filterwert kann vom Typ <Eigenschaft>=<Wert> sein. Beispiel: "Priority=1", "TestCategory=Nightly"
es: El argumento /TestCaseFilter requiere el valor del filtro. El valor del filtro puede ser del tipo <propiedad>=<valor>. Ejemplos: "Priority=1", "TestCategory=Nightly"
fr: L'argument /TestCaseFilter requiert la valeur du filtre. La valeur du filtre peut être de type <property>=<value>. Exemples : "Priority=1", "TestCategory=Nightly"
it: L'argomento /TestCaseFilter richiede il valore di filtro. Il valore di filtro può essere di tipo <proprietà>=<valore>. Esempi: "Priority=1", "TestCategory=Nightly"
ja: /TestCaseFilter 引数には、フィルター値が必要です。 フィルター値は、<プロパティ>=<値> という型で指定できます。 例: "Priority=1"、"TestCategory=Nightly"
pl: Argument /TestCaseFilter wymaga wartości filtru. Wartość filtru może być typu <property>=<value> . Przykłady: "Priority=1", "TestCategory=Nightly"
pt_br: O argumento /TestCaseFilter requer o valor do filtro. O valor do filtro pode ser do tipo <property>=<value>. Exemplos: "Priority=1", "TestCategory=Nightly"
ru: Для аргумента /TestCaseFilter требуется указать значение фильтра. Значение фильтра можно задать в формате <свойство>=<значение>. Примеры: "Priority=1", "TestCategory=Nightly"
tr: /TestCaseFilter bağımsız değişkeni filtre değeri gerektirir. Filtre değeri <özellik>=<değer> türünde olabilir. Örnekler: "Priority=1", "TestCategory=Gece"
zh_hant: /TestCaseFilter 引數需要篩選值。 篩選值可以是 <property>=<value> 類型。 範例: "Priority=1", "TestCategory=Nightly"

# InvalidTestCaseFilterValueForSpecificTests
source: The /TestCaseFilter argument cannot be specified with /Tests. Filtering of test cases is not applicable when tests are specified.
de: Das Argument "/TestCaseFilter" kann nicht mit "/Tests" angegeben werden. Das Filtern von Testfällen ist nicht anwendbar, wenn Tests angegeben werden.
es: El argumento /TestCaseFilter no se puede especificar con /Tests. El filtrado de casos de prueba no es aplicable cuando se especifican pruebas.
fr: Impossible de spécifier l'argument /TestCaseFilter avec /Tests. Le filtrage des cas de test est non applicable quand des tests sont spécifiés.
it: Non è possibile specificare l'argomento /TestCaseFilter con /Tests. Il filtro dei test case non è applicabile quando si specificano test.
ja: /TestCaseFilter 引数を /Tests と共に指定することはできません。テストが指定されている場合、テスト ケースのフィルター処理は適用できません。
pl: Nie można określać argumentu /TestCaseFilter z argumentem /Tests. Filtrowanie przypadków testowych nie jest stosowane, gdy testy zostały określone.
pt_br: O argumento /TestCaseFilter não pode ser especificado com /Tests. A filtragem de casos de teste não se aplica quando os testes são especificados.
ru: Аргумент /TestCaseFilter нельзя указывать при использовании аргумента /Tests. Если указываются тесты, фильтрация тестовых случаев не применяется.
tr: /TestCaseFilter bağımsız değişkeni /Tests ile belirtilemez. Testler belirtildiğinde test örneklerinin filtrelemesi geçerli değildir.
zh_hant: /TestCaseFilter 引數無法與 /Tests 一起指定。若已指定測試，則篩選測試案例不適用。

# NonDefaultFrameworkAndOrArchDetected
source: {0} is built for {1}/{2}. The test assemblies specified in a run should have a common target .Net framework and platform.
de: {0} wurde für {1}/{2} erstellt. Den in einem Testlauf angegebenen Testassemblys muss ein .NET-Zielframework und eine Zielplattform gemeinsam sein.
es: {0} se ha creado para {1}/{2}. Los ensamblados de prueba especificados en una ejecución deben tener una versión de .Net Framework y una plataforma comunes.
fr: {0} est généré pour {1}/{2}. Les assemblys de tests spécifiés dans une série doivent avoir une version cible du .Net Framework et une plateforme communes.
it: {0} è compilato per {1}/{2}. Gli assembly di test specificati in un'esecuzione devono disporre di una piattaforma e di un .NET Framework di destinazione comuni.
ja: {0} は {1}/{2} 用にビルドされています。実行で指定されるテスト アセンブリは、対象とする .NET Framework およびプラットフォームを共通にする必要があります。
pl: Element {0} jest kompilowany dla elementu {1}/{2}. Zestawy testowe określone w ramach uruchomienia powinny mieć wspólny docelowy program .NET Framework i wspólną docelową platformę.
pt_br: {0} é construído para {1}/{2}. Os assemblies de testes especificados em uma execução devem ter um destino comum de do Net. framework e da plataforma.
ru: Сборка {0} выполняется для {1}/{2}. Заданные в запуске тестовые сборки должны иметь одинаковые значения целевой среды .NET Framework и платформы.
tr: {0}, {1}/{2} için derlendi. Bir çalıştırmada belirtilen test bütünleştirilmiş kodu ortak bir hedef .NET framework ve platforma sahip olmalıdır.
zh_hant: {0} 為針對 {1}/{2} 所建置。回合中指定的測試組件應該具有共同的目標 .Net Framework 和平台。

# RunSingleAppContainerSource
source: Only one app package (.appx file) can be specified for running tests.
de: Zum Ausführen von Tests kann nur ein App-Paket (APPX-Datei) angegeben werden.
es: Solo se puede especificar un paquete de aplicación (archivo .appx) para ejecutar pruebas.
fr: Un seul package d'application (fichier .appx) peut être spécifié pour l'exécution de tests.
it: Per i test in esecuzione è possibile specificare un solo pacchetto dell'app (file con estensione appx).
ja: 実行する複数のテストには、1 つのアプリ パッケージ (.appx ファイル) だけを指定できます。
pl: Na potrzeby uruchamiania testów można określić tylko jeden pakiet aplikacji (plik appx).
pt_br: Somente um pacote do aplicativo (arquivo .appx) pode ser especificado para a execução de testes.
ru: Для выполнения тестов можно указать только один пакет приложения (APPX-файл).
tr: Testleri çalıştırmak için yalnızca bir uygulama paketi (.appx dosyası) belirtilebilir.
zh_hant: 您只能為執行測試指定一個應用程式套件 (.appx 檔)。

# StartingDiscovery
source: Starting test discovery, please wait...
de: Die Testermittlung wird gestartet, bitte warten...
es: Iniciando la detección de pruebas, espere...
fr: Démarrage de la découverte de tests, patientez...
it: Avvio dell'individuazione dei test in corso. Attendere...
ja: テスト探索を開始しています。お待ちください...
pl: Trwa rozpoczynanie wykrywania testu, czekaj...
pt_br: Iniciando descoberta de teste, espere...
ru: Запуск обнаружения тестов; подождите...
tr: Test bulma başlatılıyor, lütfen bekleyin...
zh_hant: 正在啟動測試探索，請稍候...

# StartingExecution
source: Starting test execution, please wait...
de: Die Testausführung wird gestartet, bitte warten...
es: Iniciando la ejecución de pruebas, espere...
fr: Démarrage de l'exécution de tests, patientez...
it: Avvio dell'esecuzione dei test in corso. Attendere...
ja: テスト実行を開始しています。お待ちください...
pl: Trwa rozpoczynanie wykonywania testu, czekaj...
pt_br: Iniciando execução de teste, espere...
ru: Запуск выполнения тестов; подождите...
tr: Test yürütmesi başlatılıyor, lütfen bekleyin...
zh_hant: 正在啟動測試執行，請稍候...

# DisablingDCOnExceptionWhileParsingDCInfo
source: Reading diagnostic data adapter settings threw an running '{0}'. All diagnostic data adapters will be skipped in this run.
de: Das Lesen der Einstellungen des Adapters für diagnostische Daten hat eine ausgeführte "{0}" ausgelöst. Alle Adapter für diagnostische Daten werden in diesem Testlauf übersprungen.
es: Al leer la configuración de adaptador de datos de diagnóstico, se produjo una excepción al ejecutar '{0}'. Se omitirán todos los adaptadores de datos de diagnóstico en esta ejecución.
fr: La lecture des paramètres de l'adaptateur de données de diagnostic a levé une exception durant l'exécution de '{0}'. Tous les adaptateurs de données de diagnostic seront ignorés dans cette série.
it: La lettura delle impostazioni dell'adattatore dati di diagnostica ha generato un oggetto '{0}' di esecuzione. Tutti gli adattatori dati di diagnostica verranno ignorati durante questa esecuzione.
ja: 診断データ アダプターの設定の読み取り中に実行中の '{0}' がスローされました。この実行では、すべての診断データ アダプターがスキップされます。
pl: Podczas odczytywania ustawień adaptera danych diagnostycznych został zgłoszony uruchomiony element „{0}”. Wszystkie adaptery danych diagnostycznych zostaną pominięte podczas tego uruchomienia.
pt_br: A leitura das configurações do adaptador de dados de diagnóstico emitiu uma execução '{0}'. Todos os adaptadores de dados de diagnóstico serão ignorados nessa execução.
ru: При чтении параметров адаптера диагностических данных возникло выполнение "{0}". Все адаптеры диагностических данных будут пропущены в этом запуске.
tr: Tanılama veri bağdaştırıcısı ayarlarının okunması çalışan bir '{0}' oluşturdu. Tüm tanılama veri bağdaştırıcıları bu çalıştırmada atlanacak.
zh_hant: 讀取診斷資料配接器設定時擲回執行中的 '{0}'。這個回合中將略過所有診斷資料配接器。

# EnableCodeCoverageArgumentProcessorHelp
source: /EnableCodeCoverage Enables data collector 'CodeCoverage' for the test run.
de: /EnableCodeCoverage Aktiviert den Datensammler "CodeCoverage" für den Testlauf.
es: /EnableCodeCoverage Habilita el recopilador de datos "CodeCoverage" para la serie de pruebas.
fr: /EnableCodeCoverage Active le collecteur de données 'CodeCoverage' pour la série de tests.
it: /EnableCodeCoverage Abilita l'agente di raccolta dati 'CodeCoverage' per l'esecuzione dei test.
ja: /EnableCodeCoverage テストの実行用にデータ コレクター 'CodeCoverage' を有効にします。
pl: /EnableCodeCoverage Włącza moduł zbierający dane „CodeCoverage” dla przebiegu testu.
pt_br: /EnableCodeCoverage Habilita o coletor de dados 'CodeCoverage' para a execução de teste.
ru: /EnableCodeCoverage Включает сборщик данных "CodeCoverage" для тестового запуска.
tr: /EnableCodeCoverage Test çalıştırması için 'CodeCoverage' veri toplayıcısını etkinleştirir.
zh_hant: /EnableCodeCoverage 為測試回合啟用資料收集器 'CodeCoverage'。

# InvalidEnableCodeCoverageCommand
source: Argument {0} is not expected in the 'EnableCodeCoverage' command. Specify the command without the argument (Example: vstest.console.exe myTests.dll /EnableCodeCoverage) and try again.
de: Das Argument "{0}" wird im Befehl "EnableCodeCoverage" nicht erwartet. Geben Sie den Befehl ohne das Argument an (Beispiel: vstest.console.exe myTests.dll /EnableCodeCoverage), und versuchen Sie es erneut.
es: El argumento {0} no se espera en el comando 'EnableCodeCoverage'. Especifique el comando sin este argumento (por ejemplo: vstest.console.exe myTests.dll /EnableCodeCoverage) y vuelva a intentarlo.
fr: L'argument {0} n'est pas attendu dans la commande 'EnableCodeCoverage'. Spécifiez la commande sans l'argument (exemple : vstest.console.exe myTests.dll /EnableCodeCoverage), puis réessayez.
it: L'argomento {0} non è previsto nel comando 'EnableCodeCoverage'. Specificare il comando senza l'argomento, ad esempio: vstest.console.exe myTests.dll /EnableCodeCoverage, quindi riprovare.
ja: 引数 {0} は、'EnableCodeCoverage' コマンドでは必要ではありません。引数なしでコマンドを指定し (例: vstest.console.exe myTests.dll /EnableCodeCoverage)、もう一度お試しください。
pl: Argument {0} nie jest oczekiwany w poleceniu „EnableCodeCoverage”. Określ polecenie bez argumentu (przykład: vstest.console.exe mojeTesty.dll /EnableCodeCoverage) i spróbuj ponownie.
pt_br: O argumento {0} não é esperado no comando 'EnableCodeCoverage'. Especifique o comando sem o argumento (exemplo: vstest.console.exe myTests.dll /EnableCodeCoverage) e tente novamente.
ru: Аргумент {0} не ожидается в команде EnableCodeCoverage. Укажите команду без аргумента (например, vstest.console.exe myTests.dll /EnableCodeCoverage) и повторите попытку.
tr: {0} bağımsız değişkeni 'EnableCodeCoverage' komutunda beklenmiyor. Komutu bağımsız değişken olmadan belirtin (Örnek: vstest.console.exe myTests.dll /EnableCodeCoverage) ve yeniden deneyin.
zh_hant: 'EnableCodeCoverage' 命令中不應該使用引數 {0}。請指定不加引數的命令 (範例: vstest.console.exe myTests.dll /EnableCodeCoverage)，並再試一次。

# NoTestEntryPoint
source: App package '{0}' does not has test executor entry point. For running unit tests for Windows Store apps, create app package using Windows Store app Unit Test Library project.
de: Das App-Paket "{0}" weist keinen Testexecutor-Einstiegspunkt auf. Erstellen Sie zum Ausführen von Komponententests für Windows Store-Apps ein App-Paket mithilfe des Komponententest-Bibliotheksprojekts der Windows Store-App.
es: El paquete de la aplicación '{0}' no tiene un punto de entrada de ejecutor de pruebas. Para ejecutar pruebas unitarias de aplicaciones de la Tienda Windows, cree un paquete de aplicación usando el proyecto Biblioteca de pruebas unitarias para aplicaciones de la Tienda Windows.
fr: Le package d'application '{0}' n'a pas de point d'entrée pour l'exécuteur de tests. Pour exécuter les tests unitaires des applications du Windows Store, créez un package de l'application à l'aide du projet de bibliothèque de tests unitaires d'applications du Windows Store.
it: Il pacchetto dell'app '{0}' non contiene un punto di ingresso dell'executor di test. Per eseguire unit test per le app di Windows Store, creare il pacchetto dell'app usando il progetto Libreria unit test per app di Windows Store.
ja: アプリ パッケージ '{0}' に、テスト実行プログラムのエントリ ポイントがありません。Windows ストア アプリの単体テストを実行する場合は、Windows ストア アプリ単体テスト ライブラリ プロジェクトを使用して、アプリ パッケージを作成してください。
pl: Pakiet aplikacji „{0}” nie ma punktu wejścia modułu wykonywania testów. Aby uruchamiać testy jednostkowe dla aplikacji ze Sklepu Windows, utwórz pakiet aplikacji za pomocą projektu biblioteki testów jednostkowych aplikacji ze Sklepu Windows.
pt_br: O pacote do aplicativo '{0}' não tem o ponto de entrada do executor de teste. Para executar testes de unidade para aplicativos da Windows Store, crie o pacote do aplicativo usando o projeto de Biblioteca de Teste de Unidade de aplicativo da Windows Store.
ru: У пакета приложения "{0}" нет точки входа исполнителя тестов. Для запуска модульных тестов приложений для Магазина Windows создайте пакет приложения с помощью проекта библиотеки модульных тестов приложений для Магазина Windows.
tr: '{0}' uygulama paketi, test yürütücüsü giriş noktasına sahip değil. Windows Mağazası uygulamalarına yönelik birim testlerini çalıştırmak için Windows Mağazası uygulaması Birim Testi Kitaplığı projesini kullanarak uygulama paketini oluşturun.
zh_hant: 應用程式套件 '{0}' 沒有測試執行程式進入點。若要執行 Windows 市集應用程式的單元測試，請使用 Windows 市集應用程式單元測試程式庫專案建立應用程式套件。
