Repository: microsoft/vstest
Catalog: src/vstest.console/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hant

# FileNotFound
source: '{0}' not found.
de: "{0}" wurde nicht gefunden.
es: No se encuentra '{0}'.
fr: '{0}' introuvable.
it: '{0}' non è stato trovato.
ja: '{0}' が見つかりません。
pl: Nie można odnaleźć elementu „{0}”.
pt_br: '{0}' não encontrado.
ru: "{0}": не найдено.
tr: '{0}' bulunamadı.
zh_hant: 找不到 '{0}'。

# AvailableDiscoverersHeaderMessage
source: The following Test Discovery Add-Ins are available:
de: Die folgenden Testermittlungs-Add-Ins sind verfügbar:
es: Los siguientes complementos de detección de pruebas están disponibles:
fr: Les compléments de découverte de tests suivants sont disponibles :
it: Sono disponibili i componenti aggiuntivi di individuazione dei test seguenti:
ja: 次のテスト探索アドインを使用できます:
pl: Dostępne są następujące dodatki służące do wykrywania testów:
pt_br: Os seguintes Suplementos de Descoberta de Teste estão disponíveis:
ru: Доступны следующие надстройки обнаружения тестов:
tr: Şu Test Bulma Eklentileri kullanılabilir:
zh_hant: 可使用下列測試探索增益集:

# AvailableExecutorsHeaderMessage
source: The following Test Execution Add-Ins are available:
de: Die folgenden Testausführungs-Add-Ins sind verfügbar:
es: Los siguientes complementos de ejecución de pruebas están disponibles:
fr: Les compléments d'exécution de tests suivants sont disponibles :
it: Sono disponibili i componenti aggiuntivi di esecuzione dei test seguenti:
ja: 次のテスト実行アドインを使用できます:
pl: Dostępne są następujące dodatki służące do wykonywania testów:
pt_br: Os seguintes Suplementos de Execução de Teste estão disponíveis:
ru: Доступны следующие надстройки выполнения тестов:
tr: Şu Test Yürütmesi eklentileri kullanılabilir:
zh_hant: 可使用下列測試執行增益集:

# AvailableLoggersHeaderMessage
source: The following Test Logger Add-Ins are available:
de: Die folgenden Testprotokollierungs-Add-Ins sind verfügbar:
es: Los siguientes complementos de registrador de pruebas están disponibles:
fr: Les compléments suivants de type enregistreur d'événements de tests sont disponibles :
it: Sono disponibili i componenti aggiuntivi di logger di test seguenti:
ja: 次のテスト ロガー アドインを使用できます:
pl: Dostępne są następujące dodatki rejestratora testów:
pt_br: Os seguintes Suplementos de Agente de Teste estão disponíveis:
ru: Доступны следующие надстройки средства ведения журнала тестирования:
tr: Şu Test Günlükçüsü Eklentileri kullanılabilir:
zh_hant: 可使用下列測試記錄器增益集:

# CommandLineError
source: Error: {0}
de: Fehler: {0}
fr: Erreur : {0}
it: Errore: {0}
ja: エラー: {0}
pl: Błąd: {0}
pt_br: Erro: {0}
ru: Ошибка: {0}
tr: Hata: {0}
zh_hant: 錯誤: {0}

# DuplicateArgumentError
source: The parameter "{0}" should be provided only once.
de: Der Parameter "{0}" sollte nur ein Mal angegeben werden.
es: El parámetro "{0}" debe proporcionarse solo una vez.
fr: Le paramètre "{0}" ne doit être fourni qu'une seule fois.
it: Il parametro "{0}" deve essere specificato una sola volta.
ja: パラメーター "{0}" は一度しか指定できません。
pl: Parametr „{0}” należy podać tylko raz.
pt_br: O parâmetro "{0}" deve ser fornecido apenas uma vez.
ru: Параметр "{0}" должен быть указан только один раз.
tr: "{0}" parametresi yalnızca bir kez belirtilmelidir.
zh_hant: 參數 " {0}" 應該僅提供一次。

# ExceptionFromExtension
source: Exception occurred when instantiating extension '{0}': {1}
de: Ausnahme beim Instanziieren der Erweiterung "{0}": {1}
es: Se produjo una excepción al crear una instancia de la extensión '{0}': {1}
fr: Une exception s'est produite durant l'instanciation de l'extension '{0}' : {1}
it: Si è verificata un'eccezione durante la creazione dell'istanza dell'estensione '{0}': {1}
ja: 拡張をインスタンス化しているときに例外が発生しました: '{0}': {1}
pl: Wystąpił wyjątek podczas tworzenia wystąpienia rozszerzenia „{0}”: {1}
pt_br: Ocorreu uma exceção ao criar uma instância da extensão '{0}': {1}
ru: При создании экземпляра расширения "{0}" возникло исключение: {1}
tr: '{0}' uzantısının örneği oluşturulurken özel durum oluştu: {1}
zh_hant: 產生延伸模組時發生例外狀況 '{0}': {1}

# ListTestsHeaderMessage
source: The following Tests are available:
de: Die folgenden Tests sind verfügbar:
es: Las siguientes pruebas están disponibles:
fr: Les tests suivants sont disponibles :
it: Sono disponibili i test seguenti:
ja: 次のテストを使用できます:
pl: Dostępne są następujące testy:
pt_br: Os Testes a seguir estão disponíveis:
ru: Доступны следующие тесты:
tr: Şu Testler kullanılabilir:
zh_hant: 可使用下列測試:

# NoArgumentProcessorFound
source: Unrecognized parameter "{0}".
de: Unbekannter Parameter "{0}".
es: No se reconoce el parámetro "{0}".
fr: Paramètre non reconnu "{0}".
it: Il parametro "{0}" non è stato riconosciuto.
ja: パラメーター "{0}" は認識されていません。
pl: Nierozpoznany parametr „{0}”.
pt_br: Parâmetro "{0}" não reconhecido.
ru: Нераспознанный параметр "{0}".
tr: "{0}" parametresi tanınmıyor.
zh_hant: 無法辨識的參數 "{0}"。

# TestSourceFileNotFound
source: The test source file "{0}" provided was not found.
de: Die angegebene Testquelldatei "{0}" wurde nicht gefunden.
es: No se encuentra el archivo de código fuente de prueba "{0}" proporcionado.
fr: Le fichier source de test "{0}" fourni est introuvable.
it: Il file di origine test "{0}" specificato non è stato trovato.
ja: 指定されたテスト ソース ファイル "{0}" が見つかりませんでした。
pl: Nie odnaleziono podanego pliku źródłowego testu „{0}”.
pt_br: O arquivo de origem de teste "{0}" fornecido não foi encontrado.
ru: Указанный исходный файл теста "{0}" не найден.
tr: Belirtilen "{0}" test kaynak dosyası bulunamadı.
zh_hant: 找不到提供的測試來源檔案 "{0}"。

# LoggerUriInvalid
source: The Test Logger URI '{0}' is not valid. The Test Logger will be ignored.
de: Der Testprotokollierungs-URI "{0}" ist ungültig. Die Testprotokollierung wird ignoriert.
es: El URI de registrador de pruebas '{0}' no es válido. Se omitirá el registrador de pruebas.
fr: L'URI de l'enregistreur d'événements de tests '{0}' est non valide. L'enregistreur d'événements de tests va être ignoré.
it: L'URI del logger di test '{0}' non è valido. Il logger di test verrà ignorato.
ja: テスト ロガーの URI '{0}' は無効です。テスト ロガーは無視されます。
pl: Podany identyfikator URI rejestratora testów „{0}” jest nieprawidłowy. Rejestrator testów zostanie zignorowany.
pt_br: O URI do Agente de Teste '{0}' não é válido. O Agente de Teste será ignorado.
ru: URI средства ведения журнала тестирования "{0}" недопустимо. Это средство ведения журнала тестирования будет игнорироваться.
tr: Test Günlükçüsünün '{0}' URI’si geçerli değil. Test Günlükçüsü yoksayılacak.
zh_hant: 測試記錄器 URI '{0}' 無效。將忽略測試記錄器。

# CommandLineInformational
source: Information: {0}
de: Informationen: {0}
es: Información: {0}
fr: Informations : {0}
it: Informazioni: {0}
ja: 情報: {0}
pl: Informacje: {0}
pt_br: Informações: {0}
ru: Сведения: {0}
tr: Bilgi: {0}
zh_hant: 資訊: {0}

# CommandLineWarning
source: Warning: {0}
de: Warnung: {0}
es: Advertencia: {0}
fr: Avertissement : {0}
it: Avviso: {0}
ja: 警告: {0}
pl: Ostrzeżenie: {0}
pt_br: Aviso: {0}
ru: Предупреждение: {0}
tr: Uyarı: {0}
zh_hant: 警告: {0}

# HelpArgumentHelp
source: -?|--Help|/?|/Help Display this usage message.
de: -?|--Help|/?|/Help Zeigt diese Syntaxmeldung an.
es: -?|--Help|/?|/Help Muestra este mensaje de uso.
fr: -?|--Help|/?|/Help Permet d'afficher ce message d'utilisation.
it: -?|--Help|/?|/Help Visualizza questo messaggio relativo alla sintassi.
ja: -?|--Help|/?|/Help この使用方法に関するメッセージを表示します。
pl: -?|--Help|/?|/Help Wyświetla ten komunikat dotyczący sposobu użycia.
pt_br: -?|--Help|/?|/Help Exibe esta mensagem de uso.
ru: -?|--Help|/?|/Help Отображение этого сообщения об использовании.
tr: -?|--Help|/?|/Help Bu kullanım iletisini görüntüler.
zh_hant: -?|--Help|/?|/Help 顯示此使用方式訊息。

# CopyrightCommandLineTitle
source: Copyright (c) Microsoft Corporation. All rights reserved.
de: Copyright (c) Microsoft Corporation. Alle Rechte vorbehalten.
es: Copyright (c) Microsoft Corporation. Todos los derechos reservados.
fr: Copyright (c) Microsoft Corporation. Tous droits réservés.
it: Copyright (c) Microsoft Corporation. Tutti i diritti sono riservati.
pl: Copyright (c) Microsoft Corporation. Wszelkie prawa zastrzeżone.
pt_br: Copyright (c) Microsoft Corporation. Todos os direitos reservados.
ru: (с) Корпорация Майкрософт (Microsoft Corporation). Все права защищены.
tr: Telif Hakkı (c) Microsoft Corporation. Tüm hakları saklıdır.
zh_hant: Copyright (C) Microsoft Corporation. 著作權所有，並保留一切權利。

# MicrosoftCommandLineTitle
source: Microsoft (R) Test Execution Command Line Tool Version {0}
de: Microsoft (R) Testausführungs-Befehlszeilentool Version {0}
es: Herramienta de línea de comandos de ejecución de pruebas de Microsoft(R), versión {0}
fr: Outil en ligne de commande d'exécution de tests Microsoft (R), version {0}
it: Strumento da riga di comando per l'esecuzione di test Microsoft (R) Versione {0}
pl: Narzędzie wiersza polecenia firmy Microsoft (R) służące do wykonania testów (wersja {0})
pt_br: Ferramenta de Linha de Comando de Execução de Teste da Microsoft (R) Versão {0}
ru: Программа Microsoft (R) Test Execution Command Line Tool версии {0}
tr: Microsoft (R) Test Yürütmesi Komut Satırı Aracı Sürüm {0}
zh_hant: Microsoft (R) Test Execution Command Line Tool {0} 版

# EnableLoggersArgumentHelp
source: --logger|/logger:<Logger Uri/FriendlyName> Specify a logger for test results. For example, to log results into a Visual Studio Test Results File (TRX) use /logger:trx[;LogFileName=<Defaults to unique file name>] Creates file in TestResults directory with given LogFileName. Change the verbosity level in log messages for console logger as shown below Example: /logger:console;verbosity=<Defaults to "normal"> Allowed values for verbosity: quiet, minimal, normal and detailed. Change the diagnostic level prefix for console logger as shown below Example: /logger:console;prefix=<Defaults to "false"> More info on Console Logger here : https://aka.ms/console-logger
de: --logger|/logger:<Protokollierungs-Uri/FriendlyName> Gibt eine Protokollierung für die Testergebnisse an. Zum Protokollieren der Ergebnisse in eine Visual Studio-Testergebnisdatei (TRX-Datei) verwenden Sie z.B.: /logger:trx[;LogFileName=<Entspricht standardmäßig einem eindeutigen Dateinamen>] Erstellt eine Datei im TestResults-Verzeichnis mit dem entsprechenden LogFileName. Ändern Sie den Ausführlichkeitsgrad in Protokollnachrichten für die Konsolenprotokollierung wie unten gezeigt: Beispiel: /logger:console;verbosity=<Standardwert ist "normal"> Zulässige Werte für die Ausführlichkeit: "quiet", "minimal", "normal" und "detailed". Ändern Sie das Präfix der Diagnoseebene für die Konsolenprotokollierung wie unten gezeigt: Beispiel: /logger:console;prefix=<Standardwert ist "false"> Weitere Informationen zur Konsolenprotokollierung finden Sie hier: https://aka.ms/console-logger
es: --logger|/logger:<URI del registrador/Nombre descriptivo> Especifica un registrador para los resultados de las pruebas. Por ejemplo, para registrar los resultados en un archivo de resultados de pruebas de Visual Studio (TRX) use /logger:trx[;LogFileName=<Valor predeterminado: nombre de archivo único>] Crea un archivo en el directorio TestResults con el valor LogFileName dado. Cambie el nivel de detalle en los mensajes de registro para el registrador de consola tal y como se muestra a continuación Ejemplo: /logger:console;verbosity=<Valor predeterminado: "normal"> Valores permitidos para el nivel de detalle: quiet, minimal, normal y detailed. Cambie el prefijo de nivel de diagnóstico para el registrador de consola tal y como se muestra a continuación Ejemplo: /logger:console;prefix=<Valor predeterminado: "false"> Aquí encontrará más información sobre el registrador de consola: https://aka.ms/console-logger
fr: --logger|/logger:<URI/nom convivial du journaliseur> Spécifiez un journaliseur pour les résultats des tests. Par exemple, pour journaliser des résultats dans un fichier de résultats des tests Visual Studio (TRX), utilisez /logger:trx[;LogFileName=<nom de fichier unique par défaut>] Crée un fichier dans le répertoire TestResults avec le LogFileName indiqué. Change le niveau de verbosité des messages du journaliseur de la console, comme indiqué ci-dessous Exemple : /logger:console;verbosity=<"normal" par défaut> Valeurs autorisées pour verbosity : quiet, minimal, normal et detailed. Change le préfixe du niveau de diagnostic pour le journaliseur de la console, comme indiqué ci-dessous Exemple : /logger:console;prefix=<"false" par défaut> En savoir plus sur le journaliseur de la console : https://aka.ms/console-logger
it: --logger|/logger:<URI/Nome descrittivo logger> Specifica un logger per i risultati dei test. Ad esempio, per registrare risultati in un file di risultati dei test di Visual Studio (TRX), usare /logger:trx[;LogFileName=<impostazione predefinita: nome file univoco>] Crea nella directory TestResults il file con il valore specificato per LogFileName. Consente di cambiare il livello di dettaglio nei messaggi del log per il logger di console come illustrato di seguito: Esempio: /logger:console;verbosity=<impostazione predefinita: "normal"> Valori consentiti per verbosity: quiet, minimal, normal e detailed. Consente di cambiare il prefisso del livello di diagnostica per il logger di console come illustrato di seguito: Esempio: /logger:console;prefix=<impostazione predefinita: "false"> Per altre informazioni sul logger di console, vedere: https://aka.ms/console-logger
ja: --logger|/logger:<Logger Uri/FriendlyName> テスト結果のロガーを指定します。たとえば、結果のログを Visual Studio のテスト結果ファイル (TRX) に記録するには、/logger:trx[;LogFileName=<Defaults to unique file name>] を使用します TestResults ディレクトリに、指定された LogFileName でファイルを作成します。 コンソール ロガーのログ メッセージの詳細レベルを、次のように変更します 例: /logger:console;verbosity=<Defaults to "normal"> 詳細レベルに使用できる値: quiet、minimal、normal、detailed。 コンソール ロガーの診断レベルのプレフィックスを次のように変更します 例: /logger:console;prefix=<Defaults to "false"> コンソール ロガーの詳細についてはこちらをご覧ください: https://aka.ms/console-logger
pl: --logger|/logger:<identyfikator URI/przyjazna nazwa rejestratora> Określa rejestrator dla wyników testu. Aby na przykład rejestrować wyniki testu do pliku wyników testu (TRX) programu Visual Studio, użyj parametru /logger:trx [;LogFileName=<wartość domyślna to unikatowa nazwa pliku>] Tworzy w katalogu TestResults plik z podaną nazwą LogFileName. Zmień poziom szczegółowości dla rejestratora konsoli, jak pokazano poniżej Przykład: /logger:console;verbosity=<wartość domyślna to „normal”> Dozwolone wartości szczegółowości: quiet, minimal i normal. Zmień prefiks poziomu diagnostyki dla rejestratora konsoli, jak pokazano poniżej Przykład: /logger:console;prefix=<wartość domyślna to „false”> Więcej informacji o rejestratorze konsoli: https://aka.ms/console-logger
pt_br: --logger|/logger:<Logger Uri/FriendlyName> Especifique um agente para os resultados do teste. Por exemplo, para registrar os resultados em um TRX (Arquivo de Resultados de Teste) do Visual Studio use /logger:trx[;LogFileName=<O padrão é o nome do arquivo exclusivo>] Cria o arquivo no diretório TestResults com o LogFileName fornecido. Altere o nível de detalhes nas mensagens de log do agente do console, como é mostrado abaixo Exemplo: /logger:console;verbosity=<O padrão é "normal"> Valores permitidos para os detalhes: quiet, minimal, normal e detailed. Altere o prefixo do nível de diagnóstico do agente do console como é mostrado abaixo Exemplo: /logger:console;prefix=<O padrão é "false"> Veja mais informações sobre o Agente do Console aqui: https://aka.ms/console-logger
ru: --logger|/logger:<URI или понятное имя средства ведения журнала> Укажите средство ведения журнала для результатов теста. Например, для записи результатов в файл результатов теста Visual Studio (TRX) введите /logger:trx[;LogFileName=<по умолчанию — уникальное имя файла>] В каталоге TestResults будет создан файл с указанным именем LogFileName. Измените уровень детализации сообщений в средстве ведения журнала консоли, как показано ниже Пример: /logger:console;verbosity=<по умолчанию — normal (обычная)> Допустимые значения детализации: quiet (отсутствует), minimal (минимальная), normal (обычная) и detailed (подробная). Измените префикс уровня диагностики для средства ведения журнала консоли, как показано ниже Пример: /logger:console;prefix=<по умолчанию — false (ложь)> Дополнительные сведения о средстве ведения журнала консоли: https://aka.ms/console-logger
tr: --logger|/logger:<Günlükçü URI/FriendlyName> Test sonuçları için bir günlükçü belirtin. Örneğin, sonuçları bir Visual Studio Test Sonuçları Dosyası'na (TRX) kaydetmek için şunu kullanın: /logger:trx[;LogFileName=<Varsayılan olarak benzersiz dosya adını alır>] İlgili LogFileName ile TestResults dizininde dosya oluşturur. Konsol günlükçüsü için ayrıntı düzeyini günlük iletilerinde aşağıda gösterildiği gibi değiştirin Örnek: /logger:console;verbosity=<Varsayılan olarak "normal" değerini alır> Ayrıntı için izin verilen değerler: quiet, minimal, normal ve detailed. Konsol günlükçüsü için tanılama düzeyi ön ekini aşağıda gösterildiği gibi değiştirin Örnek: /logger:console;prefix=<Varsayılan olarak "false" değerini alır> Konsol Günlükçüsü hakkında daha fazla bilgi: https://aka.ms/console-logger
zh_hant: --logger|/logger:<記錄器 URI/易記名稱> 指定測試結果的記錄器。例如，若要將結果記錄到 Visual Studio 測試結果檔案 (TRX)，請使用 /logger:trx[;LogFileName=<預設為唯一的檔案名稱>] 使用指定的 LogFileName，在 TestResults 目錄中建立檔案。 變更主控台記錄器中記錄訊息的詳細資訊層級，如下所示 範例: /logger:console;verbosity=<預設為 "normal"> 允許的詳細資訊值為: quiet、minimal、normal 及 detailed。 變更主控台記錄器的診斷層級前置詞，如下所示 範例: /logger:console;prefix=<預設為 "false"> 此處提供主控台記錄器的詳細資訊: https://aka.ms/console-logger

# HelpDescriptionText
source: Description: Runs tests from the specified files.
de: Beschreibung: Führt Tests aus den angegebenen Dateien aus.
es: Descripción: Ejecuta pruebas de los archivos especificados.
fr: Description : exécute les tests à partir des fichiers spécifiés.
it: Descrizione: esegue test dai file specificati.
ja: 説明: 指定されたファイルからテストを実行します。
pl: Opis: uruchamia testy z określonych plików.
pt_br: Descrição: executa testes dos arquivos especificados.
ru: Описание: выполняет тесты из указанных файлов.
tr: Açıklama: Belirtilen dosyalardan testleri çalıştırır.
zh_hant: 描述: 從指定的檔案執行測試。

# HelpOptionsText
source: Options:
de: Optionen:
es: Opciones:
it: Opzioni:
ja: オプション:
pl: Opcje:
pt_br: Opções:
ru: Параметры:
tr: Seçenekler:
zh_hant: 選項:

# HelpUsageText
source: Usage: vstest.console.exe [Arguments] [Options] [[--] <RunSettings arguments>...]]
de: Verwendung: vstest.console.exe [Argumente] [Optionen] [[--] <RunSettings-Argumente>...]]
es: Uso: vstest.console.exe [Argumentos] [Opciones] [[--] <Argumentos de RunSettings>...]]
fr: Utilisation : vstest.console.exe [Arguments] [Options] [[--] <arguments de RunSettings>...]]
it: Utilizzo: vstest.console.exe [Argomenti] [Opzioni] [[--] <argomenti di RunSettings>...]]
ja: 使用法: vstest.console.exe [引数] [オプション] [[--] <RunSettings arguments>...]]
pl: Sposób użycia: vstest.console.exe [argumenty] [opcje] [[--] <argumenty RunSettings>...]]
pt_br: Uso: vstest.console.exe [Argumentos] [Opções] [[--] <RunSettings arguments>...]]
ru: Использование: vstest.console.exe [аргументы] [параметры] [[--] <аргументы RunSettings>...]]
tr: Kullanım: vstest.console.exe [Bağımsız Değişkenler] [Seçenekler] [[--] <RunSettings bağımsız değişkenleri>...]]
zh_hant: 用法: vstest.console.exe [引數] [選項] [[--] <RunSettings 引數>...]]

# MissingTestSourceFile
source: No test source files were specified.
de: Es wurden keine Testquelldateien angegeben.
es: No se han especificado archivos de código fuente de prueba.
fr: Aucun fichier source de test n'a été spécifié.
it: Non sono stati specificati file di origine test.
ja: テスト ソース ファイルが指定されていません。
pl: Nie określono żadnych plików źródłowych testów.
pt_br: Nenhum arquivo de origem de teste foi especificado.
ru: Исходные файлы тестов не указаны.
tr: Test kaynak dosyası belirtilmedi.
zh_hant: 未指定測試來源檔案。

# NoArgumentsProvided
source: No arguments were specified.
de: Es wurden keine Argumente angegeben.
es: No se han especificado argumentos.
fr: Aucun argument n'a été spécifié.
it: Non sono stati specificati argomenti.
ja: 引数が指定されていません。
pl: Nie określono żadnych argumentów.
pt_br: Nenhum argumento foi especificado.
ru: Аргументы не указаны.
tr: Bağımsız değişken belirtilmedi.
zh_hant: 未指定引數。

# RunTestsArgumentHelp
source: [TestFileNames] Run tests from the specified files or wild card pattern. Separate multiple test file names or pattern by spaces. Set console logger verbosity to detailed to view matched test files. Examples: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
es: [TestFileNames] Ejecuta las pruebas del patrón con comodines o los archivos especificados. Separe varios patrones o nombres de archivo de prueba con espacios. Establezca el nivel de detalle del registrador en detallado para ver los archivos de prueba coincidentes. Ejemplos: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
fr: [TestFileNames] Exécutez des tests à partir des fichiers ou des modèles de caractères génériques spécifiés. Séparez plusieurs modèles ou noms de fichiers de test par des espaces. Affectez à la verbosité du journaliseur de console la valeur Detailed pour voir les fichiers de test correspondants. Exemples : mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
it: [NomiFileDiTest] Esegue i test corrispondenti ai file specificati o al carattere jolly. Separare più nomi di file di test o caratteri jolly con uno spazio. Impostare il livello di dettaglio del logger della console su dettagliato per visualizzare i file di test corrispondenti. Esempi: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
ja: [TestFileNames] 指定されたファイルまたはワイルド カード パターンからテストを実行します。複数のテスト ファイル名または パターンをスペースで区切ります。一致したテスト ファイルを表示するには、コンソール ロガーの詳細度を detailed に設定します。 例: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
pl: [TestFileNames] Uruchom testy z określonych plików lub wzorca symbolu wieloznacznego. Rozdziel wiele nazw lub wzorców plików testowych spacjami. Ustaw szczegółowość rejestratora konsoli na Szczegółowy, aby wyświetlić dopasowane pliki testowe. Przykłady: mytestproject.dll mytestproject.dll myothertestproject.exe testproject*.dll my*project.dll
tr: [TestFileNames] Belirtilen dosyalardaki veya joker karakter desenindeki testleri çalıştırın. Birden çok test dosyası adını veya desenini boşluklarla ayırın. Eşleşen test dosyalarını görüntülemek için konsol günlükçüsü ayrıntı düzeyini ayrıntılı olarak ayarlayın. Örnekler: testprojem.dll testprojem.dll diğertestprojem.exe testprojem*.dll diğer*projem.dll

# AvailableSettingsProvidersHeaderMessage
source: The following Settings Providers Add-Ins are available:
de: Die folgende Einstellungenanbieter-Add-Ins sind verfügbar:
es: Los siguientes complementos de proveedores de configuración están disponibles:
fr: Les compléments suivants de type fournisseurs de paramètres sont disponibles :
it: Sono disponibili i componenti aggiuntivi di provider di impostazioni seguenti:
ja: 次の設定プロバイダー アドインを使用できます:
pl: Dostępne są następujące dodatki dostawców ustawień:
pt_br: Os seguintes Suplementos de Provedores de Configurações estão disponíveis:
ru: Доступны следующие надстройки поставщиков параметров:
tr: Şu Ayar Sağlayıcısı Eklentileri kullanılabilir:
zh_hant: 可使用下列設定提供者增益集:
