Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.VsTestConsole.TranslationLayer/Resources/xlf/Resources.*.xlf
Languages: de, fr, ja, pl, zh_hans, zh_hant

# AbortedTestsRun
source: The active Tests Run was aborted.
de: Der aktive Testlauf wurde abgebrochen.
fr: La série de tests active a été abandonnée.
ja: アクティブなテストの実行が中止されました。
pl: Aktywny przebieg testów został przerwany.
zh_hans: 活动的测试运行已中止。
zh_hant: 已中止使用中的測試回合。

# AbortedTestsDiscovery
source: The active Tests Discovery was aborted.
de: Die aktive Testermittlung wurde abgebrochen.
fr: La découverte de tests active a été abandonnée.
ja: アクティブなテスト探索が中止されました。
pl: Aktywny proces wykrywania testów został przerwany.
zh_hans: 活动的测试发现已中止。
zh_hant: 已中止使用中的測試探索。

# FailedToReceiveMessage
source: Failed to receive message from vstest.console process
de: Fehler beim Empfangen der Nachricht aus dem vstest.console-Prozess.
fr: Échec de réception du message du processus vstest.console
ja: vstest.console プロセスからメッセージを受信できませんでした
pl: Nie można odebrać komunikatu z procesu vstest.console
zh_hans: 未能从 vstest.console 进程接收消息
zh_hant: 無法接收來自 vstest.console 處理序的訊息

# VsTestProcessExitedAbnormally
source: vstest.console process exited abnormally
de: Der vstest.console-Prozess wurde anormal beendet.
fr: Sortie anormale du processus vstest.console
ja: vstest.console プロセスが異常終了しました
pl: Proces vstest.console zakończył się nieprawidłowo
zh_hans: vstest.console 进程异常退出
zh_hant: vstest.console 處理序異常結束

# InvalidFilePath
source: File {0} does not exists
de: Die Datei "{0}" ist nicht vorhanden.
fr: Le fichier {0} n'existe pas
ja: ファイル {0} が存在しません
pl: Plik {0} nie istnieje
zh_hans: 文件 {0} 不存在
zh_hant: 檔案 {0} 不存在

# AbortedTestRunAttachmentsProcessing
source: The active Test Run Attachments Processing was aborted.
de: Die Verarbeitung aktiver Testlaufanlagen wurde abgebrochen.
fr: Le traitement des pièces jointes de série de tests actif a été abandonné.
ja: アクティブなテストの実行の添付ファイルの処理が中止されました。
pl: Aktywne przetwarzanie załączników przebiegu testu zostało przerwane.
zh_hans: 已中止正在进行的测试运行附件处理操作。
zh_hant: 執行中的測試回合附件處理已中止。

# AbortedStartTestSession
source: The Start Test Session operation was aborted.
de: Der Vorgang zum Starten der Testsitzung wurde abgebrochen.
fr: L'opération de démarrage de la session de test a été abandonnée.
ja: テスト セッションの開始操作が中止されました。
pl: Operacja uruchamiania sesji testowania została przerwana.
zh_hans: 已中止启动测试会话操作。
zh_hant: 開始測試工作階段作業已中止。

# AbortedStopTestSession
source: The Stop Test Session operation was aborted.
de: Der Vorgang zum Beenden der Testsitzung wurde abgebrochen.
fr: L'opération d'arrêt de la session de test a été abandonnée.
ja: テスト セッションの停止操作が中止されました。
pl: Operacja zatrzymywania sesji testowania została przerwana.
zh_hans: 已中止停止测试会话操作。
zh_hant: 停止測試工作階段作業已中止。

# CannotFindConsoleRunner
source: Cannot find the console runner {0}.
de: Der Konsolen-Runner {0} wurde nicht gefunden.
fr: Impossible de trouver l’exécuteur de console {0}.
ja: コンソール ランナー {0}が見つかりません。
pl: Nie można odnaleźć modułu uruchamiającego konsoli {0}.
zh_hans: 无法找到控制台运行其 {0}。
zh_hant: 找不到主控台執行器 {0}。

# ProcessStartWin32Failure
source: An error occurred when opening the file {0} with arguments {1}.
de: Beim Öffnen der Datei {0} mit den Argumenten {1} ist ein Fehler aufgetreten.
fr: Une erreur s’est produite lors de l’ouverture du fichier {0} avec des arguments {1}.
ja: 引数 {1} でファイル {0} を開くときにエラーが発生しました。
pl: Wystąpił błąd podczas otwierania pliku {0} z argumentami {1}.
zh_hans: 使用参数 {1} 打开文件 {0} 时出错。
zh_hant: 開啟具有引數 {1} 的檔案 {0} 時發生錯誤。
