Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.Extensions.TrxLogger/Resources/xlf/TrxResource.*.xlf
Languages: de, fr, ja, ko, tr, zh_hans

# TestOutcomeAborted
source: Aborted
de: Abgebrochen
fr: Abandonné
ja: 中止
ko: 중단됨
tr: İptal edildi
zh_hans: 已中止

# TestOutcomeCompleted
source: Completed
de: Abgeschlossen
fr: Effectué
ja: 完了
ko: 완료됨
tr: Tamamlandı
zh_hans: 完成

# TestOutcomeDisconnected
source: Disconnected
de: Getrennt
fr: Déconnecté
ja: 切断
ko: 연결 끊김
tr: Bağlantı kesildi
zh_hans: 已断开连接

# TestOutcomeError
source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
tr: Hata
zh_hans: 错误

# TestOutcomeFailed
source: Failed
de: Fehler
fr: Échec
ja: 失敗
ko: 실패
tr: Başarısız
zh_hans: 失败

# TestOutcomeInconclusive
source: Inconclusive
de: Nicht eindeutig
fr: Non concluant
ja: 結果不確定
ko: 결과 불충분
tr: Sonuçsuz
zh_hans: 无结论

# TestOutcomeInProgress
source: In Progress
de: In Bearbeitung
fr: En cours
ja: 処理中
ko: 진행 중
tr: Sürüyor
zh_hans: 正在进行

# TestOutcomeNotExecuted
source: Not Executed
de: Nicht ausgeführt
fr: Non exécuté
ja: 実行されませんでした
ko: 실행되지 않음
tr: Yürütülmedi
zh_hans: 未执行

# TestOutcomeNotRunnable
source: Not Runnable
de: Nicht ausführbar
fr: Non exécutable
ja: 実行できませんでした
ko: 실행할 수 없음
tr: Çalıştırılamıyor
zh_hans: 不可运行

# TestOutcomePassed
source: Passed
de: Bestanden
fr: Réussite
ja: 成功
ko: 통과
tr: Başarılı
zh_hans: 已通过

# TestOutcomePassedButRunAborted
source: Passed (run aborted)
de: Bestanden (Ausführung abgebrochen)
fr: Réussi (exécution abandonnée)
ja: 成功 (中止された実行)
ko: 통과(실행이 중단됨)
tr: Başarılı (çalıştırma iptal edildi)
zh_hans: 已通过(运行已中止)

# TestOutcomePending
source: Pending
de: Ausstehend
fr: En attente
ja: 保留中
ko: 보류 중
tr: Bekliyor
zh_hans: 待定

# TestOutcomeTimeout
source: Timeout
fr: Délai d'expiration
ja: タイムアウト
ko: 시간 초과
tr: Zaman aşımı
zh_hans: 超时

# TestOutcomeWarning
source: Warning
de: Warnung
fr: Avertissement
ja: 警告
ko: 경고
tr: Uyarı
zh_hans: 警告

# Common_CannotBeLessThanZero
source: The parameter cannot be less than 0.
de: Der Parameter darf nicht kleiner als 0 sein.
fr: Le paramètre ne peut pas être inférieur à 0.
ja: パラメーターを 0 より小さい値にすることはできません。
ko: 매개 변수는 0보다 작을 수 없습니다.
tr: Parametre 0’dan küçük olamaz.
zh_hans: 参数不能小于 0。

# Common_CannotBeNullOrEmpty
source: The parameter cannot be null or empty.
de: Der Parameter darf nicht NULL oder leer sein.
fr: Le paramètre ne peut pas avoir une valeur null ou être vide.
ja: パラメーターを null または空にすることはできません。
ko: 매개 변수는 null이거나 비워 둘 수 없습니다.
tr: Parametre null veya boş olamaz.
zh_hans: 参数不能为 NULL 或为空。

# Common_CannotGetNextIterationName
source: Cannot get free name for {0}(1),(2),... in directory {1}. Please clean up this directory.
de: Der freie Name für {0}(1),(2),... im Verzeichnis "{1}" kann nicht abgerufen werden. Bereinigen Sie dieses Verzeichnis.
fr: Impossible d'obtenir un nom libre pour {0}(1),(2),... dans le répertoire {1}. Nettoyez ce répertoire.
ja: {0}(1),(2),... に対して、ディレクトリ {1} で使用可能な名前を取得できません。このディレクトリをクリーンアップしてください。
ko: {1} 디렉터리에 {0}(1),(2),..의 형식으로 새 이름을 지정할 수 없습니다. 이 디렉터리를 정리하세요.
tr: {1} dizininde {0}(1),(2),... için boş bir ad alınamıyor. Lütfen bu dizini temizleyin.
zh_hans: 无法为目录 {1} 中的 {0}(1),(2),... 获取可用名称。请清理此目录。

# Common_MissingRunConfigInRun
source: Test Settings are not specified.
de: Es wurden keine Testeinstellungen angegeben.
fr: Les paramètres de test ne sont pas spécifiés.
ja: テストの設定が指定されていません。
ko: 테스트 설정이 지정되지 않았습니다.
tr: Test Ayarları belirtilmedi.
zh_hans: 未指定测试设置。

# Common_MissingRunDeploymentRootInRunConfig
source: The active Test Settings do not define the Run Deployment Directory.
de: Die aktiven Testeinstellungen definieren nicht das Bereitstellungsverzeichnis der Ausführung.
fr: Les paramètres de test ne définissent pas le répertoire de déploiement de la série de tests.
ja: アクティブなテストの設定は実行配置ディレクトリを定義していません。
ko: 활성 테스트 설정에 실행 배포 디렉터리가 정의되어 있지 않습니다.
tr: Etkin Test Ayarları içinde Çalıştırma Dağıtım Dizini tanımlanmıyor.
zh_hans: 活动的测试设置未定义运行部署目录。

# Common_MissingRunInResult
source: The result is not associated with a test run. Use a result that was obtained from an in-progress or completed test run.
de: Das Ergebnis ist keinem Testlauf zugeordnet. Verwenden Sie ein Ergebnis, das aus einem aktuell ausgeführten oder abgeschlossenen Testlauf stammt.
fr: Le résultat n'est pas associé à une série de tests. Utilisez un résultat obtenu à partir d'une série de tests en cours d'exécution ou achevée.
ja: この結果はテストの実行に関連付けられていません。進行中または完了したテストの実行から取得した結果をご使用ください。
ko: 결과가 테스트 실행과 연결되어 있지 않습니다. 진행 중이거나 완료된 테스트 실행에서 가져온 결과를 사용하세요.
tr: Sonuç bir test çalıştırmasıyla ilişkili değil. Devam eden veya tamamlanmış bir test çalıştırmasından alınmış bir sonucu kullanın.
zh_hans: 结果与测试运行不关联。请使用获取自正在进行或已完成的测试运行的结果。

# Common_NothingLeftAfterReplaciingBadCharsInName
source: The specified file/directory name '{0}' is not valid.
de: Der angegebene Datei-/Verzeichnisname "{0}" ist ungültig.
fr: Le nom de fichier/répertoire spécifié '{0}' est non valide.
ja: 指定されたファイルまたはディレクトリ名 '{0}' は有効ではありません。
ko: 지정한 파일/디렉터리 이름 '{0}'이(가) 잘못되었습니다.
tr: Belirtilen '{0}' dosya/dizin adı geçerli değil.
zh_hans: 指定的文件/目录名称“{0}”无效。

# FailureToAttach
source: Failed to attach files from: {0} Error Details: {1}:{2}
de: Fehler beim Anfügen von Dateien: {0} Fehlerdetails: {1}:{2}
fr: Impossible de joindre des fichiers à partir de : {0} Détails de l'erreur : {1}:{2}
ja: 次の場所からのファイルの添付に失敗しました: {0} エラーの詳細: {1}:{2}
ko: {0}의 파일에 연결하지 못했습니다. 오류 정보: {1}:{2}
tr: Dosyalar şuradan eklenemedi: {0} Hata Ayrıntıları: {1}:{2}
zh_hans: 未能从以下位置附加文件: {0} 错误详细信息: {1}:{2}

# MessageForSkippedTests
source: Test '{0}' was skipped in the test run.
de: Der Test "{0}" wurde im Testlauf übersprungen.
fr: Le test '{0}' a été ignoré dans la série de tests.
ja: テストの実行でテスト '{0}' がスキップされました。
ko: 테스트 실행에서 ‘{0}’ 테스트를 건너뛰었습니다.
tr: Test çalıştırmasında '{0}' testi atlandı.
zh_hans: 在测试运行中跳过测试“{0}”。

# TrxLoggerResultsFile
source: Results File: {0}
de: Ergebnisdatei: {0}
fr: Fichier de résultats : {0}
ja: 結果ファイル: {0}
ko: 결과 파일: {0}
tr: Sonuç Dosyası: {0}
zh_hans: 结果文件: {0}

# TS_AllResults
source: All Loaded Results
de: Alle geladenen Ergebnisse
fr: Tous les résultats chargés
ja: 読み込まれたすべての結果
ko: 로드된 모든 결과
tr: Yüklenen Tüm Sonuçlar
zh_hans: 所有已加载的结果

# TS_UncategorizedResults
source: Results Not in a List
de: Ergebnisse nicht in einer Liste
fr: Les résultats ne figurent pas dans une liste
ja: 一覧に存在しない結果
ko: 목록에 없는 결과
tr: Bir Listede Olmayan Sonuçlar
zh_hans: 列表中未列出的结果

# Common_DeploymentItem
source: deployment item '{0}'
de: Bereitstellungselement "{0}"
fr: élément de déploiement '{0}'
ja: 配置項目 '{0}'
ko: 배포 항목 '{0}'
tr: dağıtım öğesi '{0}'
zh_hans: 部署项“{0}”

# Common_DeploymentItemWithOutputDirectory
source: deployment item '{0}' (output directory '{1}')
de: Bereitstellungselement "{0}" (Ausgabeverzeichnis "{1}")
fr: élément de déploiement '{0}' (répertoire de sortie '{1}')
ja: 配置項目 '{0}' (出力ディレクトリ ' {1} ')
ko: 배포 항목 '{0}'(출력 디렉터리 '{1}')
tr: dağıtım öğesi '{0}' (çıktı dizini '{1}')
zh_hans: 部署项“{0}”(输出目录“{1}”)

# TrxLoggerResultsFileOverwriteWarning
source: WARNING: Overwriting results file: {0}
de: WARNUNG: Ergebnisdatei wird überschrieben: {0}
fr: AVERTISSEMENT : Fichier de résultats en cours de remplacement : {0}
ja: 警告: 結果ファイルを上書きしています: {0}
ko: 경고: 결과 파일을 덮어쓰는 중: {0}
tr: UYARI: Sonuç dosyasının üzerine yazılıyor: {0}
zh_hans: 警告: 正在覆盖结果文件: {0}

# PrefixAndNameProvidedError
source: The parameters LogFileName and LogFilePrefix cannot be used together.
de: Die Parameter "LogFileName" und "LogFilePrefix" können nicht zusammen verwendet werden.
fr: Les paramètres LogFileName et LogFilePrefix ne peuvent pas être utilisés ensemble.
ja: パラメーター LogFileName と LogFilePrefix を同時に使用することはできません。
ko: LogFileName 및 LogFilePrefix 매개 변수는 함께 사용할 수 없습니다.
tr: LogFileName ve LogFilePrefix parametreleri birlikte kullanılamaz.
zh_hans: 参数 LogFileName 和 LogFilePrefix 不能一起使用。

# Common_CannotGetNextTimestampFileName
source: Cannot get find an available filename for {0} using timestamp format '{2}' at {1}.
fr: Impossible de trouver un nom de fichier disponible pour {0} avec le format d'horodatage '{2}' à l'emplacement {1}.
tr: {1} konumundaki '{2}' zaman damgası biçimi kullanılarak {0} için kullanılabilir bir dosya adı alınamıyor.
