Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.AdapterUtilities/Resources/xlf/Resources.*.xlf
Languages: cs, de, pt_br, zh_hans, zh_hant

# ErrorIncompleteManagedName
source: ManagedName is incomplete
cs: Název ManagedName není úplný.
de: ManagedName unvollständig
pt_br: O ManagedName está incompleto
zh_hans: ManagedName 不完整
zh_hant: ManagedName 不完整

# ErrorMethodArityMustBeNumeric
source: Method arity must be numeric.
cs: Arita metody musí být číselná.
de: Die Stelligkeit der Methode muss numerisch sein.
pt_br: A aridade do método deve ser numérica.
zh_hans: 方法参数数量必须是数值。
zh_hant: 方法 arity 必須為數值。

# ErrorMethodNotFound
source: Method '{0}' not found on type '{1}'
cs: Metoda {0} nebyla nalezena u typu {1}.
de: Die Methode "{0}" wurde für den Typ "{1}" nicht gefunden.
pt_br: Método '{0}' não encontrado no tipo '{1}'
zh_hans: 类型“{1}”上找不到方法“{0}”
zh_hant: 在類型 '{1}' 上找不到方法 '{0}'

# ErrorTypeNotFound
source: Type '{0}' not found
cs: Typ {0} nebyl nalezen.
de: Der Typ "{0}" wurde nicht gefunden.
pt_br: Tipo '{0}' não encontrado
zh_hans: 找不到类型“{0}”
zh_hant: 找不到類型 '{0}'

# ErrorUnexpectedCharactersAtEnd
source: Unexpected characters after the end of the ManagedName (pos: {0})
cs: Neočekávané znaky na konci položky ManagedName (pozice: {0})
de: Unerwartetes Zeichen nach dem Ende von ManagedName (Position: {0}).
pt_br: Caracteres inesperados após o final de ManagedName (posição: {0})
zh_hans: ManagedName 末尾后面有不需要的字符(位置: {0})
zh_hant: ManagedName 的結尾後出現非預期的字元 (位置: {0})

# ErrorWhitespaceNotValid
source: Whitespace is not valid in a ManagedName (pos: {0})
cs: V ManagedName se nepovoluje mezera (pozice: {0}).
de: Leerzeichen sind in einem ManagedName unzulässig (Position: {0}).
pt_br: O espaço em branco não é válido em um ManagedName (posição: {0})
zh_hans: ManagedName 中空白无效(位置: {0})
zh_hant: 空白字元在 ManagedName 中無效 (位置: {0})

# MethodNotImplementedOnPlatform
source: '{0}.{1}' is not implemented on this platform!
cs: Metoda {0}.{1} není na této platformě implementována.
de: "{0}.{1}" ist auf dieser Plattform nicht implementiert!
pt_br: '{0}.{1}' não está implementado nesta plataforma.
zh_hans: 未在此平台上实现 "{0}.{1}"!
zh_hant: '{0}.{1}' 未在此平台上實作!

# ErrorInvalidSequenceAt
source: Invalid escape sequence! (segment: {0}, pos: {1})
cs: Neplatná řídicí sekvence. (Segment: {0}, pozice: {1})
de: Ungültige Escapesequenz (Segment: {0}, Position: {1}).
pt_br: Sequência de escape inválida. (segmento: {0}, posição: {1})
zh_hans: 无效转义序列! (段: {0}，位置: {1})
zh_hant: 逸出序列無效! (區段: {0}，位置: {1})

# ErrorNoClosingQuote
source: A closing single quote was expected at the end of the segment! (segment: {0})
cs: Na konci segmentu se očekávala ukončovací jednoduchá uvozovka. (Segment: {0})
de: Am Ende des Segments wurde ein schließendes einfaches Anführungszeichen erwartet (Segment: {0}).
pt_br: Uma aspa simples de fechamento era esperada no final do segmento. (segmento: {0})
zh_hans: 该段末尾应使用右单引号! (段: {0})
zh_hant: 區段結尾必須有右單引號! (區段: {0})

# ErrorMethodExpectedAsAnArgument
source: Argument must be a method. (Argument name: {0})
cs: Argument musí být metoda. (Název argumentu: {0})
de: Das Argument muss eine Methode sein. (Argumentname: {0})
pt_br: O argumento deve ser um método. (Nome do argumento: {0})
zh_hans: 参数必须是方法。(参数名称: {0})
zh_hant: 引數必須是方法。(引數名稱: {0})

# ErrorCannotAppendAfterHashCalculation
source: Cannot append to a TestIdProvider, after GetId or GetHash method is called.
cs: Po volání metody GetId nebo GetHash není možné připojit k zprostředkovateli TestIdProvider.
de: Kann nicht an einen TestIdProvider angefügt werden, nachdem die GetId- oder GetHash-Methode aufgerufen wurde.
pt_br: Não é possível anexar a um TestIdProvider depois que o método GetId ou GetHash é chamado.
zh_hans: 调用 GetId 或 GetHash 方法后，无法追加到 TestIdProvider。
zh_hant: 在呼叫 GetId 或 GetHash 方法之，無法附加到 TestIdProvider。
