Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.CommunicationUtilities/Resources/xlf/Resources.*.xlf
Languages: de, es, ja, ko

# AbortedTestRun
source: The active test run was aborted. Reason: {0}
de: Der aktive Testlauf wurde abgebrochen. Grund: {0}
es: Se ha anulado la serie de pruebas activa. Motivo: {0}
ja: アクティブなテストの実行が中止されました。理由: {0}
ko: 활성 테스트 실행이 중단되었습니다. 이유: {0}

# ConnectionClosed
source: An existing connection was forcibly closed by the remote host.
de: Das Schließen einer vorhandenen Verbindung wurde vom Remotehost erzwungen.
es: El host remoto forzó el cierre de una conexión.
ja: 既存の接続はリモート ホストに強制的に切断されました。
ko: 원격 호스트에 의해 기존 연결이 강제로 종료되었습니다.

# AbortedTestDiscovery
source: The active test discovery was aborted.
de: Die aktive Testerkennung wurde abgebrochen.

# AbortedTestDiscoveryWithReason
source: The active test discovery was aborted. Reason: {0}
de: Die aktive Testermittlung wurde abgebrochen. Grund: {0}

# UnableToCommunicateToTestHost
source: Unable to communicate with test host process.
de: Die Kommunikation mit dem Testhostprozess ist nicht möglich.
es: No se puede establecer comunicación con el proceso del host de pruebas.
ja: テスト ホスト プロセスと通信できません。
ko: 테스트 호스트 프로세스와 통신할 수 없습니다.

# UnexpectedMessage
source: Unexpected message received. Expected MessageType : {0} Actual MessageType: {1}
de: Unerwartete Meldung empfangen. Erwarteter MessageType: {0}. Tatsächlicher MessageType: {1}
es: Se ha recibido un mensaje inesperado. Tipo de mensaje esperado: {0} Tipo de mensaje real: {1}
ja: 予期しないメッセージを受信しました。予想されたメッセージの種類: {0} 実際のメッセージの種類: {1}
ko: 예기치 않은 메시지를 수신했습니다. 필요한 MessageType: {0} 실제 MessageType: {1}

# VersionCheckFailed
source: Protocol version check failed. Make sure test runner and host are compatible.
de: Fehler beim Überprüfen der Protokollversion. Der Test Runner und der Host müssen kompatibel sein.
es: Error en la comprobación de la versión del protocolo. Asegúrese de que el ejecutor de pruebas y el host son compatibles.
ja: プロトコルのバージョンを確認できませんでした。テスト ランナーとホストに互換性があることをご確認ください。
ko: 프로토콜 버전을 확인하지 못했습니다. Test Runner와 호스트가 호환되는지 확인하세요.

# VersionCheckTimedout
source: Failed to negotiate protocol, waiting for response timed out after {0} seconds. This may occur due to machine slowness, please set environment variable {1} to increase timeout.
de: Fehler beim Verhandeln des Protokolls. Timeout beim Warten auf Antwort nach {0} Sekunden. Möglicherweise ist der Computer langsam. Legen Sie die Umgebungsvariable "{1}" fest, um den Timeoutwert zu erhöhen.
es: No se pudo negociar el protocolo, se agotó el tiempo de espera para la respuesta después de {0} segundos. Esto puede deberse a la lentitud de la máquina, configure la variable de entorno {1} para aumentar el tiempo de espera.
ja: プロトコルをネゴシエートできませんでした。応答への待機が {0} 秒後にタイムアウトしました。これはマシンの遅さが原因で発生する可能性があるため、環境変数 {1} を設定してタイムアウト時間を増やしてください。
ko: 프로토콜을 협상하지 못했습니다. {0}초 후 응답 시간이 초과될 때까지 기다리는 중입니다. 이런 오류는 컴퓨터가 느려서 발생할 수 있습니다. 환경 변수 {1}을(를) 설정하여 시간 제한을 늘리세요.

# ConnectionTimeoutErrorMessage
source: {0} process failed to connect to {1} process after {2} seconds. This may occur due to machine slowness, please set environment variable {3} to increase timeout.
de: Fehler beim Herstellen einer Verbindung des Prozesses "{0}" mit dem Prozess "{1}" nach {2} Sekunden. Möglicherweise ist der Computer langsam. Legen Sie die Umgebungsvariable "{3}" fest, um den Timeoutwert zu erhöhen.
es: El proceso {0} no pudo conectar con el proceso {1} después de {2} segundos. Esto puede deberse a la lentitud de la máquina, configure la variable de entorno {3} para aumentar el tiempo de espera.
ja: {0} プロセスでは、{2} 秒後に {1} プロセスへ接続できませんでした。これは、マシンの遅さが原因で発生する可能性があるため、環境変数 {3} を設定してタイムアウト時間を増やしてください。
ko: {0} 프로세스가 {2}초 후 {1} 프로세스에 연결하지 못했습니다. 이런 오류는 컴퓨터가 느려서 발생할 수 있습니다. 환경 변수 {3}을(를) 설정하여 시간 제한을 늘리세요.

source: Test host process crashed
de: Der Testhostprozess ist abgestürzt.
es: Proceso de host de pruebas bloqueado
ja: テストのホスト プロセスがクラッシュしました
ko: 테스트 호스트 프로세스 작동이 중단됨

# AttachDebuggerToDefaultTestHostFailure
source: Cannot attach the debugger to the default test host.
de: Der Debugger kann nicht an den Standardtesthost angefügt werden.
es: No se puede asociar el depurador al host de prueba predeterminado.
ja: デバッガーを既定のテスト ホストにアタッチできません。
ko: 기본 테스트 호스트에 디버거를 연결할 수 없습니다.

# AbortedTestDiscovery
source: The active test discovery was aborted. Reason: {0}
es: Se ha anulado la detección de pruebas activa. Motivo: {0}
ja: アクティブなテスト探索が中止されました。理由: {0}
ko: 활성 테스트 검색이 중단되었습니다. 이유: {0}
