Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.CoreUtilities/Resources/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, pl, pt_br, ru, tr, zh_hans, zh_hant

# CannotBeNullOrEmpty
source: The parameter cannot be null or empty.
cs: Parametr nemůže být null nebo prázdný.
de: Der Parameter darf nicht NULL oder leer sein.
es: El parámetro no puede ser nulo ni estar vacío.
fr: Le paramètre ne peut pas avoir une valeur null ou être vide.
it: Il parametro non può essere vuoto o Null.
ja: パラメーターを null または空にすることはできません。
pl: Parametr nie może mieć wartości null ani być pusty.
pt_br: O parâmetro não pode ser nulo ou estar vazio.
ru: Параметр не может быть пустым или иметь значение null.
tr: Parametre null veya boş olamaz.
zh_hans: 参数不能为 NULL 或为空。
zh_hant: 參數不可為 null 或空白。

# CommandLineError
source: Error: {0}
cs: Chyba: {0}
de: Fehler: {0}
fr: Erreur : {0}
it: Errore: {0}
ja: エラー: {0}
pl: Błąd: {0}
pt_br: Erro: {0}
ru: Ошибка: {0}
tr: Hata: {0}
zh_hans: 错误: {0}
zh_hant: 錯誤: {0}

# CommandLineInformational
source: Information: {0}
cs: Informace: {0}
de: Informationen: {0}
es: Información: {0}
fr: Informations : {0}
it: Informazioni: {0}
ja: 情報: {0}
pl: Informacje: {0}
pt_br: Informações: {0}
ru: Сведения: {0}
tr: Bilgi: {0}
zh_hans: 信息: {0}
zh_hant: 資訊: {0}

# CommandLineWarning
source: Warning: {0}
cs: Upozornění: {0}
de: Warnung: {0}
es: Advertencia: {0}
fr: Avertissement : {0}
it: Avviso: {0}
ja: 警告: {0}
pl: Ostrzeżenie: {0}
pt_br: Aviso: {0}
ru: Предупреждение: {0}
tr: Uyarı: {0}
zh_hans: 警告: {0}
zh_hant: 警告: {0}

# Error_ArgumentIsEmpty
source: The specified argument cannot be empty.
cs: Zadaný argument nemůže být prázdný.
de: Das angegebene Argument darf nicht leer sein.
es: El argumento especificado no puede estar vacío.
fr: L'argument spécifié ne peut pas être vide.
it: L'argomento specificato non può essere vuoto.
ja: 指定した引数を空にすることはできません。
pl: Określony argument nie może być pusty.
pt_br: O argumento especificado não pode estar vazio.
ru: Указанный аргумент не может быть пустым.
tr: Belirtilen bağımsız değişken boş olamaz.
zh_hans: 指定的参数不能为空。
zh_hant: 指定的引數不可為空白。

# Error_ArgumentIsNegative
source: The specified argument cannot be negative.
cs: Zadaný argument nemůže být záporný.
de: Das angegebene Argument darf nicht negativ sein.
es: El argumento especificado no puede ser negativo.
fr: L'argument spécifié ne peut pas être négatif.
it: L'argomento specificato non può essere negativo.
ja: 指定した引数を負の値にすることはできません。
pl: Określony argument nie może być ujemny.
pt_br: O argumento especificado não pode ser negativo.
ru: Указанный аргумент не может быть отрицательным.
tr: Belirtilen bağımsız değişken negatif olamaz.
zh_hans: 指定的参数不能为负。
zh_hant: 指定的引數不可為負數。

# Error_ArgumentNotTypeOf
source: The specified argument must have the following type: {0}.
cs: Zadaný argument musí být tohoto typu: {0}
de: Das angegebene Argument muss den folgenden Typ aufweisen: {0}.
es: El argumento especificado debe tener el tipo {0}.
fr: L'argument spécifié doit être du type suivant : {0}.
it: L'argomento specificato deve essere del tipo seguente: {0}.
ja: 指定された引数は次の型でなければなりません: {0}。
pl: Określony argument musi być następującego typu: {0}.
pt_br: O argumento especificado deve ter o seguinte tipo: {0}.
ru: Указанный аргумент должен иметь следующий тип: {0}.
tr: Belirtilen bağımsız değişken şu türde olmalıdır: {0}.
zh_hans: 指定的参数都必须具有以下类型: {0}。
zh_hant: 指定的引數必須具備下列類型: {0}。

# Error_ArgumentPropertyIsEmpty
source: The specified argument has the following property, which cannot be an empty string: {0}.
cs: Zadaný argument má následující vlastnost, která nemůže být prázdný řetězec: {0}
de: Das angegebene Argument weist die folgende Eigenschaft auf, die keine leere Zeichenfolge sein darf: {0}.
es: El argumento especificado tiene la siguiente propiedad, que no puede ser una cadena vacía: {0}.
fr: L'argument spécifié a la propriété suivante, laquelle ne peut pas être une chaîne vide : {0}.
it: L'argomento specificato presenta la proprietà seguente, che non può essere una stringa vuota: {0}.
ja: 指定された引数には次のプロパティがあり、これを空の文字列にすることはできません: {0}。
pl: Określony argument ma następującą właściwość, która nie może być pustym ciągiem: {0}.
pt_br: O argumento especificado tem a seguinte propriedade, que não pode ser uma cadeia de caracteres vazia: {0}.
ru: Указанный аргумент имеет следующее свойство, которое не может быть пустой строкой: {0}.
tr: Belirtilen bağımsız değişken, boş dize olamayacak olan şu özelliğe sahiptir: {0}.
zh_hans: 指定的参数具有以下属性: {0}，且不能为空字符串。
zh_hant: 指定的引數具有下列屬性，且不可為空字串: {0}。

# Error_ArgumentPropertyIsNegative
source: The specified argument has the following property, which cannot be negative: {0}.
cs: Zadaný argument má následující vlastnost, která nemůže být záporná: {0}
de: Das angegebene Argument weist die folgende Eigenschaft auf, die nicht negativ sein darf: {0}.
es: El argumento especificado tiene la siguiente propiedad, que no puede ser negativa: {0}.
fr: L'argument spécifié a la propriété suivante, laquelle ne peut pas être négative : {0}.
it: L'argomento specificato presenta la proprietà seguente, che non può essere negativa: {0}.
ja: 指定した引数には次のプロパティがあります。このプロパティを負の値にすることはできません: {0}。
pl: Określony argument ma następującą właściwość, która nie może być ujemna: {0}.
pt_br: O argumento especificado tem a seguinte propriedade, que não pode ser negativa: {0}.
ru: Указанный аргумент имеет следующее свойство, которое не может быть отрицательным: {0}.
tr: Belirtilen bağımsız değişken, negatif olamayacak olan şu özelliğe sahiptir: {0}.
zh_hans: 指定的参数具有以下属性: {0}，且不能为负。
zh_hant: 指定的引數具有下列屬性，且不可為負數: {0}。

# Error_ArgumentPropertyIsNull
source: The specified argument has the following property, which cannot be null: {0}.
cs: Zadaný argument má následující vlastnost, která nemůže být null: {0}
de: Das angegebene Argument weist die folgende Eigenschaft auf, die nicht NULL sein darf: {0}.
es: El argumento especificado tiene la siguiente propiedad, que no puede ser nula: {0}.
fr: L'argument spécifié a la propriété suivante, laquelle ne peut pas être une valeur null : {0}.
it: L'argomento specificato presenta la proprietà seguente, che non può essere Null: {0}.
ja: 指定した引数には次のプロパティがあります。このプロパティを null にすることはできません: {0}。
pl: Określony argument ma następującą właściwość, która nie może mieć wartości null: {0}.
pt_br: O argumento especificado tem a seguinte propriedade, que não pode ser nula: {0}.
ru: Указанный аргумент имеет следующее свойство, которое не может иметь значение null: {0}.
tr: Belirtilen bağımsız değişken, null olamayacak olan şu özelliğe sahiptir: {0}.
zh_hans: 指定的参数具有以下属性: {0}，且不能为 null。
zh_hant: 指定的引數具有下列屬性，且不可為 null: {0}。

# Error_ArgumentPropertyNotTypeOf
source: The specified argument has the following property: {0}. This property must have the following type: {1}.
cs: Zadaný argument má následující vlastnost: {0}. Tato vlastnost musí být tohoto typu: {1}
de: Das angegebene Argument weist die folgende Eigenschaft auf: {0}. Diese Eigenschaft muss den folgenden Typ aufweisen: {1}.
es: El argumento especificado tiene la siguiente propiedad: {0}. Esta propiedad debe tener el tipo {1}.
fr: L'argument spécifié a la propriété suivante : {0}. Cette propriété doit avoir le type suivant : {1}.
it: L'argomento specificato presenta la proprietà seguente: {0}. Tale proprietà deve essere del tipo seguente: {1}.
ja: 指定された引数には次のプロパティがあります: {0}。このプロパティは次の型でなければなりません: {1}。
pl: Określony argument ma następującą właściwość: {0}. Ta właściwość musi być następującego typu: {1}.
pt_br: O argumento especificado tem a seguinte propriedade: {0}. Esta propriedade deve ter o seguinte tipo: {1}.
ru: Указанный аргумент имеет следующее свойство: {0}. Это свойство должно относиться к следующему типу: {1}.
tr: Belirtilen bağımsız değişken şu özelliğe sahiptir: {0}. Bu özellik şu türde olmalıdır: {1}.
zh_hans: 指定的参数具有以下属性: {0}。此属性必须具有以下类型: {1}。
zh_hant: 指定的引數具有下列屬性: {0}。此屬性必須具有下列類型: {1}。

# ExceptionFromJobProcessor
source: Unhandled exception occurred while processing a job from the '{0}' queue: {1}
cs: Při zpracování úlohy z fronty {0} došlo k neošetřené výjimce: {1}
de: Ausnahmefehler beim Verarbeiten eines Auftrags aus der Warteschlange "{0}": {1}
es: Se produjo una excepción no controlada al procesar un trabajo de la cola '{0}': {1}
fr: Une exception non prise en charge s'est produite durant le traitement d'un travail à partir de la file d'attente '{0}' : {1}
it: Si è verificata un'eccezione non gestita durante l'elaborazione di un processo dalla coda di '{0}': {1}
ja: '{0}' キューからジョブを処理中にハンドルされない例外が発生しました: {1}。
pl: Wystąpił nieobsługiwany wyjątek podczas przetwarzania zadania z kolejki „{0}”: {1}
pt_br: Ocorreu uma exceção sem tratamento ao processar um trabalho da fila '{0}': {1}
ru: При обработке задания из очереди "{0}" возникло необработанное исключение: {1}
tr: '{0}' kuyruğundan bir iş işlenirken, işlenmeyen özel durum oluştu: {1}
zh_hans: 处理“{0}”队列中的作业时发生未处理的异常: {1}
zh_hant: 從 '{0}' 佇列處理工作時，發生未處理的例外狀況: {1}

# QueueAlreadyDisposed
source: The {0} queue has already been disposed.
cs: Fronta {0} se už uvolnila.
de: Die Warteschlange {0} wurde bereits verworfen.
es: La cola {0} ya se ha eliminado.
fr: La file d'attente {0} a déjà été supprimée.
it: La coda {0} è già stata eliminata.
ja: {0} キューは既に破棄されています。
pl: Kolejka {0} została już usunięta.
pt_br: A fila {0} já foi descartada.
ru: Очередь {0} уже удалена.
tr: {0} kuyruğu zaten atıldı.
zh_hans: 已处置 {0} 队列。
zh_hant: 已處置 {0} 佇列。

# QueuePausedDisposeError
source: The {0} queue cannot be disposed while paused.
cs: Frontu {0} nejde uvolnit, když je pozastavená.
de: Die Warteschlange {0} kann nicht verworfen werden, während sie angehalten ist.
es: La cola {0} no se puede eliminar mientras está en pausa.
fr: Impossible de supprimer la file d'attente {0} pendant qu'elle est en pause.
it: Non è possibile eliminare la coda {0} mentre è in sospeso.
ja: {0} キューは一時停止中に破棄できません。
pl: Nie można usunąć kolejki {0} podczas wstrzymania.
pt_br: A fila {0} não pode ser descartada enquanto está em pausa.
ru: Нельзя удалить приостановленную очередь {0}.
tr: {0} kuyruğu duraklatılmış durumdayken atılamaz.
zh_hans: 暂停时无法处置 {0} 队列。
zh_hant: 暫停時無法處置 {0} 佇列。

# Utility_ProcessNameWhenCannotGetIt
source: Error getting process name.
cs: Při získávání názvu procesu se stala chyba.
de: Fehler beim Abrufen des Prozessnamens.
es: Error al obtener el nombre del proceso.
fr: Erreur d'obtention du nom du processus.
it: Si è verificato un errore durante il recupero del nome del processo.
ja: プロセス名の取得エラーです。
pl: Błąd podczas pobierania nazwy procesu.
pt_br: Erro ao obter o nome do processo.
ru: Ошибка при получении имени процесса.
tr: İşlem adı alınırken hata oluştu.
zh_hans: 获取进程名称时出错。
zh_hant: 取得處理序名稱時發生錯誤。

# NoDotnetExeFound
source: Could not find '{0}' host. Make sure that '{0}' is installed on the machine and is available in PATH environment variable.
cs: Hostitele {0} nešlo najít. Ujistěte se, jestli je {0} nainstalovaný na počítači a dostupný v cestě určené proměnnou prostředí PATH.
de: Der Host "{0}" wurde nicht gefunden. Stellen Sie sicher, dass "{0}" auf dem Computer installiert und in der PATH-Umgebungsvariablen verfügbar ist.
es: No se pudo encontrar el host "{0}". Asegúrese de que "{0}" está instalado en el equipo y está disponible en la variable de entorno PATH.
fr: L'hôte '{0}' est introuvable. Vérifiez que '{0}' est installé sur la machine et qu'il est disponible dans la variable d'environnement PATH.
it: L'host '{0}' non è stato trovato. Assicurarsi che '{0}' sia installato nel computer e che sia disponibile nella variabile di ambiente PATH.
ja: '{0}' ホストが見つかりませんでした。'{0}' がコンピューターにインストールされており、PATH 環境変数で使用できることを確認してください。
pl: Nie można znaleźć hosta „{0}”. Upewnij się, że element „{0}” jest zainstalowany na maszynie i jest dostępny w zmiennej środowiskowej PATH.
pt_br: Não foi possível encontrar o host '{0}'. Verifique se o '{0}' está instalado no computador e está disponível na variável de ambiente PATH.
ru: Не удалось найти хост "{0}". Убедитесь, что "{0}" установлен на компьютере и доступен в переменной среды PATH.
tr: '{0}' konağı bulunamadı. '{0}' konağının makinede yüklü olduğundan ve PATH ortam değişkeninde bulunduğundan emin olun.
zh_hans: 找不到“{0}”主机。请确保计算机上已安装“{0}”且位于 PATH 环境变量中。
zh_hant: 找不到 '{0}' 主機。請確認 '{0}' 已安裝在機器上，而且可在 PATH 環境變數中使用。
