Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.CrossPlatEngine/Resources/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# FailedToLaunchTestHost
source: Failed to launch testhost with error: {0}
cs: Nepovedlo se spustit hostitele testu kvůli této chybě: {0}
de: Fehler beim Starten von Testhost: {0}
es: No se pudo iniciar el host de prueba con el error: {0}
fr: Échec du lancement de l'hôte de test. Erreur : {0}
it: Non è stato possibile avviare testhost. Errore: {0}
ja: エラーが発生したため、TestHost を起動できませんでした: {0}
ko: Testhost를 시작하지 못했습니다(오류: {0}).
pl: Nie można uruchomić hosta testów. Błąd: {0}
pt_br: Falha ao iniciar o host de teste com o erro: {0}
ru: Не удалось запустить хост для тестов с ошибкой: {0}
tr: Testhost başlatılamadı. Şu hata alındı: {0}
zh_hans: 未能启动测试主机，错误为 {0}
zh_hant: 無法啟動測試主機。錯誤: {0}

# ExecutionThreadApartmentStateNotSupportedForFramework
source: ExecutionThreadApartmentState option not supported for framework: {0}.
cs: Možnost ExecutionThreadApartmentState se pro rozhraní nepodporuje: {0}.
de: Die ExecutionThreadApartmentState-Option wird für das Framework nicht unterstützt: {0}.
es: Opción ExecutionThreadApartmentState de ejecución no admitida para el marco: {0}.
fr: L'option ExecutionThreadApartmentState n'est pas prise en charge pour le framework : {0}.
it: L'opzione ExecutionThreadApartmentState non è supportata per il framework: {0}.
ja: フレームワークでの ThreadApartmentState オプションの実行はサポートされていません: {0}。
ko: 프레임워크 {0}에 대해 ExecutionThreadApartmentState 옵션이 지원되지 않습니다.
pl: Opcja ExecutionThreadApartmentState nie jest obsługiwana dla platformy: {0}.
pt_br: A opção ExecutionThreadApartmentState não tem suporte para a estrutura: {0}.
ru: Параметр ExecutionThreadApartmentState не поддерживается для платформы: {0}.
tr: ExecutionThreadApartmentState seçeneği {0} çerçevesi için desteklenmiyor.
zh_hans: 框架 {0} 不支持 ExecutionThreadApartmentState 选项。
zh_hant: 架構 {0} 不支援 ExecutionThreadApartmentState 選項。

# OldTestHostIsGettingUsed
source: You are using an older version of Microsoft.NET.Test.Sdk. Kindly move to a version equal or greater than 15.3.0.
cs: Používáte starší verzi sady Microsoft.NET.Test.Sdk. Přejděte prosím na verzi 15.3.0 nebo vyšší.
de: Sie verwenden eine ältere Version von Microsoft.NET.Test.Sdk. Wechseln Sie zu Version 15.3.0 oder höher.
es: Está utilizando una versión anterior de Microsoft.NET.Test.Sdk. Cámbiese a una versión igual o superior a 15.3.0.
fr: Vous utilisez une ancienne version de Microsoft.NET.Test.Sdk. Passez à une version égale ou supérieure à la version 15.3.0.
it: La versione di Microsoft.NET.Test.Sdk è obsoleta. Passare alla versione 15.3.0 o a una versione successiva.
ja: Microsoft.NET.Test.Sdk の古いバージョンを使用しています。15.3.0 以降のバージョンに移行することをお勧めします。
ko: 이전 버전의 Microsoft.NET.Test.Sdk를 사용하고 있습니다. 15.3.0 이상 버전으로 이동하세요.
pl: Używamy starszej wersji zestawu Microsoft.NET.Test.Sdk. Przejdź na wersję 15.3.0 lub nowszą.
pt_br: Você está usando uma versão mais antiga do Microsoft.NET.Test.Sdk. Mude para uma versão igual ou maior que 15.3.0.
ru: Вы используете более старую версию Microsoft.NET.Test.Sdk. Перейдите на версию 15.3.0 или более позднюю.
tr: Eski bir Microsoft.NET.Test.Sdk sürümü kullanıyorsunuz. Lütfen 15.3.0 veya daha yeni bir sürüme geçin.
zh_hans: 你使用的是旧版 Microsoft.NET.Test.Sdk。请迁移到 15.3.0 及更高版本。
zh_hant: 您正使用較舊版的 Microsoft.NET.Test.Sdk。請移到等於或大於 15.3.0 的版本。

# NonExistingExtensions
source: Could not find extensions: {0}
cs: Nepovedlo se najít rozšíření: {0}
de: Erweiterungen nicht gefunden: {0}
es: No se pudieron encontrar las extensiones {0}.
fr: Extensions introuvables : {0}
it: Non è stato possibile trovare le estensioni: {0}
ja: 拡張機能が見つかりませんでした: {0}
ko: 확장을 찾을 수 없음: {0}
pl: Nie można znaleźć rozszerzeń: {0}
pt_br: Não foi possível encontrar as extensões: {0}
ru: Не удалось найти расширения: {0}
tr: Dosya uzantıları bulunamadı: {0}
zh_hans: 找不到扩展名: {0}
zh_hant: 找不到延伸模組: {0}

# DeprecatedAdapterPath
source: Adapter lookup is being changed, please follow https://github.com/Microsoft/vstest/blob/main/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap for more details.
de: Die Adaptersuche wird geändert. Weitere Informationen finden Sie unter „https://github.com/Microsoft/vstest/blob/main/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap“.

# NoTestsAvailableForGivenTestCaseFilter
source: No test matches the given testcase filter `{0}` in {1}
cs: Žádný test neodpovídá danému filtru testovacích případů {0} v: {1}
de: Kein Test entspricht dem angegebenen Testfallfilter "{0}" in "{1}".
es: Ninguna prueba coincide con el filtro de casos de prueba proporcionado "{0}" en {1}
fr: Aucun test ne correspond au filtre testcase donné `{0}` dans {1}
it: Nessun test corrisponde al filtro di test case specificato `{0}` in {1}
ja: 指定のテストケース フィルター `{0}` に一致するテストは {1} にありません
ko: {1}에 지정된 테스트 사례 필터 `{0}`과(와) 일치하는 테스트가 없습니다.
pl: Żaden test nie jest zgodny z podanym filtrem przypadku testowego „{0}” w elemencie {1}
pt_br: Nenhum teste corresponde ao filtro de testcase `{0}` determinado no {1}
ru: Нет тестов, соответствующих указанному фильтру тестовых случаев "{0}" в {1}
tr: {1} içinde sunulan test çalışması filtresi `{0}` ile eşleşen test yok
zh_hans: 没有测试匹配 {1} 中的给定用例测试筛选器“{0}”
zh_hant: 沒有任何測試符合 {1} 中的指定 testcase 篩選 `{0}`

# TestDiscoveryCancelled
source: Discovery of tests cancelled.
cs: Zjišťování testů bylo zrušeno.
de: Die Ermittlung von Tests wurde abgebrochen.
es: Se ha cancelado la detección de las pruebas.
fr: Découverte de tests annulée.
it: Individuazione dei test annullata.
ja: テストの検出が取り消されました。
ko: 테스트 검색이 취소되었습니다.
pl: Odnajdywanie testów zostało anulowane.
pt_br: Descoberta de testes cancelada.
ru: Обнаружение тестов отменено.
tr: Test bulma iptal edildi.
zh_hans: 已取消测试发现。
zh_hant: 已取消測試的探索。

# AttachDebuggerToDefaultTestHostFailure
source: Cannot attach the debugger to the default test host with process ID: {0}.
cs: Ladicí program se nedá připojit k výchozímu hostiteli testů s ID procesu {0}.
de: Der Debugger kann nicht an den Standardtesthost mit der Prozess-ID {0} angefügt werden.
es: No se puede asociar el depurador al host de prueba predeterminado con el id. de proceso: {0}.
fr: Impossible d'attacher le débogueur à l'hôte de test par défaut ayant l'ID de processus : {0}.
it: Non è possibile collegare il debugger all'host di test predefinito con ID processo {0}.
ja: デバッガーをプロセス ID: {0} の既定のテスト ホストにアタッチできません。
ko: 프로세스 ID가 {0}인 기본 테스트 호스트에 디버거를 연결할 수 없습니다.
pl: Nie można dołączyć debugera do domyślnego hosta testowego z identyfikatorem procesu: {0}.
pt_br: Não é possível anexar o depurador ao host de teste padrão com a ID de processo: {0}.
ru: Не удается подключить отладчик к узлу тестирования по умолчанию с идентификатором процесса {0}.
tr: Hata ayıklayıcı, {0} işlem kimliğine sahip varsayılan test ana bilgisayarına eklenemiyor.
zh_hans: 无法将调试程序附加到进程 ID 为“{0}”的默认测试主机。
zh_hant: 無法將偵錯工具連結到處理序識別碼為 {0} 的預設測試主機。

# AccessDenied
source: {0} Access denied while trying to create "TestResults" folder in mentioned location. You are getting this exception because you are running vstest.console.exe from a folder which requires having write access. To solve the issue: please run vstest.console.exe from a folder where you have write privileges.
cs: {0} Při pokusu o vytvoření složky TestResults v uvedeném umístění došlo k odepření přístupu. Tato výjimka se vyvolala, protože spouštíte vstest.console.exe ze složky, která vyžaduje, abyste měli přístup pro zápis. Pokud chcete problém vyřešit, spusťte prosím vstest.console.exe ze složky, ve které máte oprávnění k zápisu.
de: {0} Beim Erstellen des Ordners "TestResults" am angegebenen Speicherort wurde der Zugriff verweigert. Sie erhalten diese Ausnahme, weil Sie "vstest.console.exe" in einem Ordner ausführen, für den Schreibzugriff erforderlich ist. So beheben Sie das Problem: Führen Sie "vstest.console.exe" in einem Ordner aus, für den Sie Schreibberechtigungen besitzen.
es: {0} Se denegó el acceso al intentar crear la carpeta "TestResults" en la ubicación mencionada. Está recibiendo esta excepción porque está ejecutando vstest.console.exe desde una carpeta que requiere acceso de escritura. Para solucionar la incidencia: ejecute vstest.console.exe desde una carpeta en la que tenga privilegios de escritura.
fr: {0} Accès refusé durant la tentative de création du dossier "TestResults" à l'emplacement indiqué. Vous obtenez cette exception, car vous exécutez vstest.console.exe à partir d'un dossier qui nécessite un accès en écriture. Pour résoudre le problème, exécutez vstest.console.exe à partir d'un dossier sur lequel vous disposez de privilèges d'accès en écriture.
it: {0} Accesso negato durante il tentativo di creare la cartella "TestResults" nel percorso indicato. Si riceve questa eccezione perché si esegue vstest.console.exe da una cartella per cui è necessario l'accesso in scrittura. Per risolvere il problema, eseguire vstest.console.exe da una cartella per cui si hanno privilegi di scrittura.
ja: {0} 記載した場所に "TestResults" フォルダーを作成しようとしたときにアクセスが拒否されました。書き込みアクセスを必要とするフォルダーから vstest.console.exe を実行しているため、この例外が発生しています。この問題を解決するには、書き込み特権のあるフォルダーから vstest.console.exe を実行してください。
ko: {0} "TestResults" 폴더를 언급된 위치에 만드는 동안 액세스가 거부되었습니다. 쓰기 권한이 필요한 폴더에서 vstest.console.exe를 실행하고 있으므로 이 예외가 발생했습니다. 이 문제를 해결하려면 쓰기 권한이 있는 폴더에서 vstest.console.exe를 실행하세요.
pl: {0} Odmowa dostępu podczas próby utworzenia folderu „TestResults” w określonej lokalizacji. Widzisz ten wyjątek, ponieważ program vstest.console.exe został uruchomiony z folderu wymagającego dostępu do zapisu. Aby rozwiązać ten problem: uruchom program vstest.console.exe z folderu, w którym masz uprawnienia do zapisu.
pt_br: {0} Acesso negado ao tentar criar a pasta "TestResults" no local mencionado. Você está recebendo esta exceção porque está executando o vstest.console.exe em uma pasta que requer acesso para gravação. Para resolver o problema: execute vstest.console.exe em uma pasta na qual você tenha privilégios de gravação.
ru: {0} Отказано в доступе при попытке создания папки "TestResults" в указанном расположении. Это исключение возникло, так как вы запускаете файл vstest.console.exe из папки, для которой требуется доступ на запись. Чтобы устранить эту проблему, запустите vstest.console.exe из папки, для которой у вас есть разрешения на запись.
tr: {0} Belirtilen konumda "TestResults" klasörü oluşturulmaya çalışılırken erişim engellendi. Yazma erişimi gerektiren bir klasörden vstest.console.exe çalıştırdığınız için bu özel durumu aldınız. Sorunu çözmek için lütfen yazma ayrıcalıklarına sahip olduğunuz bir klasörden vstest.console.exe dosyasını çalıştırın.
zh_hans: {0} 尝试在所述位置创建 "TestResults" 文件夹时，访问被拒。你收到此异常是因为你正在从需要具有写入权限的文件夹运行 vstest.console.exe。若要解决此问题，请从你具有写入权限的文件夹运行 vstest.console.exe。
zh_hant: {0} 當嘗試在提及的位置上建立 "TestResults" 資料夾時存取被拒。因為您正從需要寫入存取權的資料夾執行 vstest.console.exe，所以收到此例外狀況。若要解決此問題: 請從您有權寫入的資料夾執行 vstest.console.exe。

# NoAvailableProxyForDeque
source: Could not find an available proxy to deque.
cs: Nepovedlo se najít dostupný proxy server, který se má odebrat z fronty.
de: Es wurde kein verfügbarer Proxy für die Deque gefunden.
es: No se encontró ningún proxy disponible para quitar de la cola.
fr: Impossible de localiser un proxy disponible à dépiler.
it: Non è stato possibile trovare un proxy disponibile da rimuovere dalla coda.
ja: デキューするために使用できるプロキシが見つかりませんでした。
ko: 큐에서 제거하기 위해 사용할 수 있는 프록시를 찾을 수 없습니다.
pl: Nie można było znaleźć dostępnego serwera proxy do umieszczenia w kolejce dwukierunkowej.
pt_br: Não foi possível encontrar um proxy disponível para deque.
ru: Не удалось найти доступный прокси-сервер для двусторонней очереди.
tr: İki uçtan erişimli kuyruğa yönelik kullanılabilir ara sunucu bulunamadı.
zh_hans: 找不到用于取消排队的可用代理。
zh_hant: 找不到任何要排除於佇列外的 Proxy。

# NoSuchProxyId
source: Proxy with id {0} is not managed by the current session manager.
cs: Aktuální správce relace nespravuje proxy s ID {0}.
de: Der Proxy mit der ID {0} wird nicht vom aktuellen Sitzungs-Manager verwaltet.
es: El administrador de la sesión actual no administra el proxy con el identificador {0}.
fr: Le proxy ayant l'ID {0} n'est pas géré par le gestionnaire de session actuel.
it: Il proxy con ID {0} non è gestito dallo strumento di gestione sessioni corrente.
ja: ID が {0} のプロキシは、現在のセッション マネージャーで管理されません。
ko: ID가 {0}인 프록시가 현재 세션 관리자에서 관리되지 않습니다.
pl: Serwer proxy o identyfikatorze {0} nie jest zarządzany przez bieżącego menedżera sesji.
pt_br: O proxy com a ID {0} não é gerenciado pelo gerenciador de sessão atual.
ru: Прокси-сервер с идентификатором {0} не управляется текущим диспетчером сеансов.
tr: {0} kimliğine sahip ara sunucu, geçerli oturum yöneticisi tarafından yönetilmiyor.
zh_hans: ID 为 {0} 的代理不受当前会话管理器管理。
zh_hant: 識別碼為 {0} 的 Proxy 並非由目前的工作階段管理員所管理。

# ProxyIsAlreadyAvailable
source: Proxy with id {0} is already available and cannot be re-enqueued.
cs: Proxy s ID {0} je už k dispozici a nedá se znovu zařadit do fronty.
de: Der Proxy mit der ID {0} ist bereits verfügbar und kann nicht erneut in die Warteschlange eingereiht werden.
es: El proxy con el identificador {0} ya está disponible y no se puede volver a poner en cola.
fr: Le proxy ayant l'ID {0} est déjà disponible et ne peut pas être empilé à nouveau.
it: Il proxy con ID {0} è già disponibile e non può essere riaccodato.
ja: ID が {0} のプロキシは、既に使用可能になっているため、再度エンキューすることはできません。
ko: ID가 {0}인 프록시를 이미 사용할 수 있으며 큐에 다시 넣을 수 없습니다.
pl: Serwer proxy o identyfikatorze {0} jest już dostępny i nie można go ponownie umieścić w kolejce.
pt_br: O proxy com a ID {0} já está disponível e não pode ser enfileirado novamente.
ru: Прокси-сервер с идентификатором {0} уже доступен и не может быть повторно поставлен в очередь.
tr: {0} kimliğine sahip ara sunucu zaten var ve yeniden kuyruğa alınamaz.
zh_hans: ID 为 {0} 的代理已可用，无法重新排队。
zh_hant: 識別碼為 {0} 的 Proxy 已可供使用，但無法重新加入佇列。

# NoTestHostProviderFound
source: No suitable test runtime provider was found for any source in this run.
de: Für eine Quelle in dieser Ausführung wurde kein geeigneter Testruntimeanbieter gefunden.

# NoProxyMatchesDescription
source: The runsettings changed between the time when the test session was established and the time of the current run/discovery request.
de: Die Ausführungseinstellungen wurden zwischen dem Zeitpunkt, zu dem die Testsitzung eingerichtet wurde, und dem Zeitpunkt der aktuellen Ausführungs-/Ermittlungsanforderung geändert.

# AttachmentsBanner
source: Attachments:
de: Anlagen:

# NoSuitableRuntimeProviderFound
source: No suitable test runtime provider was found:
de: Es wurde kein geeigneter Testruntimeanbieter gefunden:

source: Skipping source:
de: Quelle wird übersprungen:

# TestHostExitedWithError
source: Testhost process exited with error: {0}. Please check the diagnostic logs for more information.
cs: Proces testhost se ukončil s chybou: {0}. Další informace najdete v diagnostických protokolech.
es: El proceso del host de prueba finalizó con el siguiente error: {0}. Consulte los registros de diagnóstico para obtener más información.
fr: Le processus Testhost s'est arrêté. Erreur : {0}. Pour plus d'informations, consultez les journaux de diagnostic.
it: Il processo testhost è terminato con l'errore {0}. Per altre informazioni, vedere i log di diagnostica.
ja: Testhost プロセスがエラーで終了しました: {0}。詳細については、診断ログを確認してください。
ko: Testhost 프로세스가 종료되었습니다(오류: {0}). 자세한 내용은 진단 로그를 확인하세요.
pl: Zakończono proces testhost z powodu błędu: {0}. Sprawdź dzienniki diagnostyczne, aby uzyskać więcej informacji.
pt_br: O processo do testhost foi encerrado com o erro: {0}. Verifique os logs de diagnóstico para obter mais informações.
ru: Процесс testhost завершился с ошибкой: {0}. Дополнительные сведения см. в журналах диагностики.
tr: Testhost işleminden şu hatayla çıkıldı: {0}. Daha fazla bilgi için lütfen tanılama günlüklerine bakın.
zh_hans: Testhost 进程已退出，但出现错误: {0}。请查看诊断日志了解详细信息。
zh_hant: Testhost 處理序已結束。錯誤: {0}。如需詳細資訊，請查看診斷記錄。

# DeprecatedAdapterPath
source: Adapter lookup is being changed, please follow https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap for more details.
cs: Mění se vyhledávání adaptéru. Další informace najdete tady: https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap.
es: Se está cambiando la búsqueda de adaptador. Siga https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap para obtener más detalles.
fr: La fonctionnalité de recherche d’adaptateur fait actuellement l’objet de modifications. Pour plus d’informations, consultez https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap.
it: La ricerca degli adattatori verrà modificata a breve. Per maggiori dettagli, vedere https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap.
ja: アダプター検索は変更中です。詳細については、https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap をご覧ください。
ko: 어댑터 조회가 변경됩니다. 자세한 내용은 https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap을 참조하세요.
pl: Wyszukiwanie adaptera jest zmieniane, zobacz https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap w celu uzyskania dalszych szczegółów.
pt_br: A pesquisa do adaptador está sendo alterada, siga https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap para obter mais detalhes.
ru: Изменяется поиск адаптеров. Дополнительные сведения: https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap.
tr: Bağdaştırıcı arama değiştiriliyor. Ayrıntılar için lütfen https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap sayfasını takip edin.
zh_hans: 适配器查找发生了变化，请转到 https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap，了解详细信息。
zh_hant: 目前正在變更配接器查閱，請遵循 https://github.com/Microsoft/vstest-docs/blob/master/RFCs/0022-User-Specified-TestAdapter-Lookup.md#roadmap，以取得詳細資料。
