Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.CrossPlatEngine/Resources/xlf/Resources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DiscovererInstantiationException
source: Exception occurred while instantiating discoverer : {0}
cs: Při vytváření instance nástroje zjišťování došlo k výjimce: {0}
de: Ausnahme beim Instanziieren des Discoverers: {0}
es: Se produjo una excepción al crear una instancia del programa de detección: {0}
fr: Une exception s'est produite durant l'instanciation du découvreur : {0}
it: Si è verificata un'eccezione durante la creazione dell'istanza dell'agente di individuazione: {0}
ja: 探索プログラムのインスタンス化中に例外が発生しました: {0}
ko: {0} Discoverer를 인스턴스화하는 중 예외가 발생했습니다.
pl: Wystąpił wyjątek podczas tworzenia wystąpienia wykrywacza: {0}
pt_br: Ocorreu uma exceção ao criar uma instância do discoverer: {0}
ru: При создании экземпляра средства обнаружения возникло исключение: {0}
tr: Bulucu örneği oluşturulurken özel durum oluştu: {0}
zh_hans: 实例化发现器时发生异常: {0}
zh_hant: 將探索程式具現化時發生例外狀況: {0}

# DuplicateAdaptersFound
source: Multiple test adapters with the same uri '{0}' were found. Ignoring adapter '{1}'. Please uninstall the conflicting adapter(s) to avoid this warning.
cs: Našlo se více adaptérů testů se stejným identifikátorem URI {0}. Ignoruje se adaptér {1}. Pokud se chcete tomuto upozornění vyhnout, odinstalujte prosím konfliktní adaptéry.
de: Mehrere Testadapter mit dem gleichen URI "{0}" wurden gefunden. Der Adapter "{1}" wird ignoriert. Deinstallieren Sie die in Konflikt stehenden Adapter, um diese Warnung zu vermeiden.
es: Se han encontrado varios adaptadores de prueba con el mismo URI ({0}). Se omitirá el adaptador '{1}'. Desinstale los adaptadores que están en conflicto para evitar esta advertencia.
fr: Plusieurs adaptateurs de tests ayant le même URI '{0}' ont été trouvés. Adaptateur '{1}' ignoré. Désinstallez les adaptateurs en conflit pour éviter cet avertissement.
it: Sono stati trovati più adattatori di test con lo stesso URI '{0}'. L'adattatore '{1}' verrà ignorato. Per evitare che venga visualizzato questo avviso, disinstallare gli adattatori in conflitto.
ja: 同じ URI '{0}' を持つ複数のテスト アダプターが見つかりました。アダプター '{1}' を無視します。この警告が表示されないようにするには、競合するアダプターをアンインストールしてください。
ko: 동일한 URI '{0}'을(를) 가진 테스트 어댑터가 여러 개 있습니다. '{1}' 어댑터를 무시합니다. 이 경고가 발생하지 않게 하려면 충돌하는 어댑터를 제거하세요.
pl: Znaleziono wiele adapterów testowych z takim samym identyfikatorem URI „{0}”. Adapter „{1}” zostanie zignorowany. Aby uniknąć tego ostrzeżenia, odinstaluj adaptery powodujące konflikt.
pt_br: Foram encontrados vários adaptadores de teste com o mesmo URI '{0}'. Ignorando o adaptador '{1}'. Desinstale os adaptadores conflitantes para evitar este aviso.
ru: Найдено несколько адаптеров тестов с одинаковым URI "{0}". Адаптер "{1}" пропускается. Чтобы избежать этого предупреждения, удалите все конфликтующие адаптеры.
tr: Aynı '{0}' URI’sine sahip birden fazla test bağdaştırıcısı bulundu. '{1}' bağdaştırıcısı yoksayılıyor. Bu uyarıyı önlemek için lütfen çakışan bağdaştırıcıları kaldırın.
zh_hans: 找到了多个具有同一 URI“{0}”的测试适配器。忽略适配器“{1}”。请卸载冲突的适配器以避免此警告。
zh_hant: 找到多個具有相同 URI '{0}' 的測試配接器。忽略配接器 '{1}'。請將衝突的配接器解除安裝，以避免這項警告。

# DuplicateSource
source: Ignoring the specified duplicate source '{0}'.
cs: Ignoruje se zadaný duplicitní zdroj {0}.
de: Die angegebene doppelte Quelle "{0}" wird ignoriert.
es: Se omitirá el origen duplicado especificado ({0}).
fr: La source dupliquée spécifiée '{0}' est ignorée.
it: L'origine duplicata specificata verrà ignorata: '{0}'.
ja: 指定された重複データ ソース '{0}' を無視します。
ko: 지정한 중복되는 '{0}' 소스를 무시합니다.
pl: Określone zduplikowane źródło „{0}” zostanie zignorowane.
pt_br: Ignorando a fonte duplicada especificada '{0}'.
ru: Указанный повторяющийся источник "{0}" игнорируется.
tr: Belirtilen '{0}' yinelenen kaynağı yoksayılıyor.
zh_hans: 忽略指定的重复源“{0}”。
zh_hant: 忽略指定的重複來源 '{0}'。

# ExceptionFromLoadTests
source: An exception occurred while test discoverer '{0}' was loading tests. Exception: {1}
cs: V době, kdy nástroj zjišťování testů {0} načítal testy, došlo k výjimce. Výjimka: {1}
de: Ausnahme beim Laden von Tests durch den Testdiscoverer "{0}". Ausnahme: {1}
es: Se produjo una excepción cuando el programa de detección de pruebas '{0}' estaba cargando pruebas. Excepción: {1}
fr: Une exception s'est produite durant le chargement des tests par le découvreur de tests '{0}'. Exception : {1}
it: Si è verificata un'eccezione durante il caricamento dei test da parte dell'agente di individuazione test '{0}'. Eccezione: {1}
ja: テスト探索プログラム '{0}' がテストを読み込んでいるときに例外が発生しました。例外: {1}
ko: 테스트 Discoverer '{0}'에서 테스트를 로드하는 동안 예외가 발생했습니다. 예외: {1}
pl: Wystąpił wyjątek podczas ładowania testów przez wykrywacz testów „{0}”. Wyjątek: {1}
pt_br: Ocorreu uma exceção enquanto o discoverer de testes '{0}' estava carregando testes. Exceção: {1}
ru: При загрузке тестов средством обнаружения тестов "{0}" возникло исключение. Исключение: {1}
tr: '{0}' test bulucusu testleri yüklerken bir özel durum oluştu. Özel durum: {1}
zh_hans: 测试发现器“{0}”加载测试时发生异常。异常: {1}
zh_hant: 測試探索程式 '{0}' 載入測試時發生例外狀況。例外狀況: {1}

# ExceptionFromRunTests
source: An exception occurred while invoking executor '{0}': {1}
cs: Při volání prováděcího modulu {0} došlo k výjimce: {1}
de: Ausnahme beim Aufrufen von Executor "{0}": {1}
es: Se produjo una excepción al invocar al ejecutor '{0}': {1}
fr: Une exception s'est produite durant l'appel de l'exécuteur '{0}' : {1}
it: Si è verificata un'eccezione durante la chiamata dell'executor '{0}': {1}
ja: 実行プログラム '{0}' の呼び出し中に例外が発生しました: {1}
ko: '{0}' Executor를 호출하는 동안 예외가 발생했습니다. {1}
pl: Wystąpił wyjątek podczas wywoływania modułu wykonywania „{0}”: {1}
pt_br: Ocorreu uma exceção ao chamar o executor '{0}': {1}
ru: При вызове исполнителя "{0}" возникло исключение: {1}
tr: '{0}' yürütücüsü çağrılırken bir özel durum oluştu: {1}
zh_hans: 调用的执行器“{0}”时发生异常: {1}
zh_hant: 叫用執行程式 '{0}' 時發生例外狀況: {1}

# FileNotFound
source: Could not find file {0}.
cs: Nepovedlo se najít soubor {0}.
de: Die Datei "{0}" wurde nicht gefunden.
es: No se encuentra el archivo {0}.
fr: Fichier {0} introuvable.
it: Il file {0} non è stato trovato.
ja: ファイル {0} は見つかりませんでした。
ko: {0} 파일을 찾을 수 없습니다.
pl: Nie można odnaleźć pliku {0}.
pt_br: Não foi possível localizar o arquivo {0}.
ru: Не удалось найти файл {0}.
tr: {0} dosyası bulunamadı.
zh_hans: 找不到文件 {0}。
zh_hant: 找不到檔案 {0}。

# HostDebuggerWarning
source: Host debugging is enabled. Please attach debugger to testhost process to continue.
cs: Je povolené ladění hostitele. Pokud chcete pokračovat, připojte prosím ladicí program k procesu testhost.
de: Hostdebuggen ist aktiviert. Fügen Sie den Debugger an den Testhostprozess an, um den Vorgang fortzusetzen.
es: La depuración host está habilitada. Asocie el depurador al proceso de host de prueba para continuar.
fr: Le débogage de l'hôte est activé. Attachez le débogueur au processus testhost pour continuer.
it: Il debug dell'host è abilitato. Per continuare, collegare il debugger al processo testhost.
ja: ホスト デバッグが有効です。続行するにはデバッガーをテスト ホスト プロセスにアタッチしてください。
ko: 호스트 디버깅을 사용하도록 설정했습니다. testhost 프로세스를 계속하려면 디버거를 연결하세요.
pl: Debugowanie hosta zostało włączone. Dołącz debuger do procesu testhost, aby kontynuować.
pt_br: O host de depuração está habilitado. Anexe o depurador ao processo de testhost para continuar.
ru: Включена отладка узла. Для продолжения подключите отладчик к процессу testhost.
tr: Konak hata ayıklaması etkin. Devam etmek için lütfen hata ayıklayıcısını testhost işlemine ekleyin.
zh_hans: 启用主机调试。请将调试器附加到 testhost 进程以继续。
zh_hant: 已啟用主機偵錯。請將偵錯工具附加到 testhost 處理序以繼續進行。

# IgnoringExecutorAsNoDefaultExecutorUriAttribute
source: Ignoring the test executor corresponding to test discoverer {0} because the discoverer does not have the DefaultExecutorUri attribute . You might need to re-install the test adapter add-in.
cs: Ignoruje se prováděcí modul testování, který odpovídá nástroji zjišťování testů {0}, protože nástroj zjišťování nemá atribut DefaultExecutorUri. Možná bude nutné přeinstalovat doplněk adaptéru testu.
de: Der Testexecutor, der dem Testdiscoverer "{0}" entspricht, wird ignoriert, weil der Discoverer nicht das DefaultExecutorUri-Attribut aufweist. Sie müssen ggf. das Testadapter-Add-In erneut installieren.
es: Se omitirá el ejecutor de pruebas correspondiente al programa de detección de pruebas {0}, porque este último no tiene el atributo DefaultExecutorUri. Puede ser necesario reinstalar el complemento del adaptador de prueba.
fr: L'exécuteur de tests correspondant au découvreur de tests {0} est ignoré, car le découvreur n'a pas l'attribut DefaultExecutorUri. Vous devrez peut-être réinstaller le complément d'adaptateur de test.
it: L'executor di test corrispondente all'agente di individuazione del test {0} verrà ignorato perché manca l'attributo DefaultExecutorUri dell'agente di individuazione. Potrebbe essere necessario reinstallare il componente aggiuntivo dell'adattatore di test.
ja: テスト探索プログラム {0} には DefaultExecutorUri 属性が含まれていないため、このテスト探索プログラムに対応するテスト実行プログラムを無視しています。テスト アダプター アドインの再インストールが必要になる場合があります。
ko: Discoverer에 DefaultExecutorUri 특성이 없으므로 테스트 Discoverer {0}에 해당하는 테스트 Executor를 무시합니다. 테스트 어댑터 추가 기능을 다시 설치해야 할 수 있습니다.
pl: Moduł wykonywania testów odpowiadający wykrywaczowi testów {0} zostanie zignorowany, ponieważ wykrywacz nie ma atrybutu DefaultExecutorUri. Konieczna może być ponowna instalacja dodatku adaptera testowego.
pt_br: Ignorando o executor de teste correspondente ao discoverer de teste {0} porque o discoverer não tem o atributo DefaultExecutorUri. Talvez seja necessário instalar novamente o suplemento do adaptador de teste.
ru: Исполнитель теста, соответствующий средству обнаружения тестов {0}, пропускается, так как у средства обнаружения нет атрибута DefaultExecutorUri. Возможно, необходимо переустановить надстройку адаптера теста.
tr: Bulucu DefaultExecutorUri özniteliğine sahip olmadığından {0} test bulucusuna karşılık gelen test yürütücüsü yoksayılıyor. Test bağdaştırıcısı eklentisini yeniden yüklemeniz gerekebilir.
zh_hans: 忽略与测试发现器 {0} 对应的测试执行器，因为该发现器不具有 DefaultExecutorUri 特性。可能需要重新安装测试适配器外接程序。
zh_hant: 忽略對應到測試探索程式 {0} 的測試執行程式，因為探索程式沒有 DefaultExecutorUri 屬性。您可能必須重新安裝測試配接器增益集。

# InitializationFailed
source: Failed to initialize client proxy: could not connect to test process.
cs: Nepovedlo se inicializovat proxy klienta: nešlo se připojit k procesu testu.
de: Fehler beim Initialisieren des Clientproxys: Es konnte keine Verbindung mit dem Testprozess hergestellt werden.
es: No se pudo inicializar el proxy de cliente: no se puede conectar al proceso de prueba.
fr: Échec d'initialisation du proxy client : connexion impossible au processus de test.
it: Inizializzazione del proxy client non riuscita: non è stato possibile connettersi al processo di test.
ja: クライアント プロキシを初期化できませんでした。テスト プロセスに接続できませんでした。
ko: 클라이언트 프록시를 초기화하지 못했습니다. 테스트 프로세스에 연결할 수 없습니다.
pl: Zainicjowanie serwera proxy klienta nie powiodło się: nie można nawiązać połączenia z procesem testowania.
pt_br: Falha ao inicializar o proxy do cliente: não foi possível se conectar ao processo de teste.
ru: Не удалось инициализировать прокси клиента: не удалось подключиться к процессу теста.
tr: İstemci ara sunucusu başlatılamadı: Test işlemine bağlanılamadı.
zh_hans: 未能初始化客户端代理: 无法连接到测试过程。
zh_hant: 無法將用戶端 Proxy 初始化: 無法連接到測試處理序

# LaunchDebugProcessNotAllowedForANonDebugRun
source: This operation is not allowed in the context of a non-debug run.
cs: Tato operace se v kontextu běhu bez ladění nepovoluje.
de: Dieser Vorgang ist im Kontext einer Nichtdebugausführung unzulässig.
es: Esta operación no se permite en el contexto de una ejecución que no sea de depuración.
fr: Cette opération n'est pas autorisée dans le contexte d'une exécution qui ne sert pas au débogage.
it: Questa operazione non è consentita nel contesto di un'esecuzione non di debug.
ja: この操作は、非デバッグ実行のコンテキストでは許可されていません。
ko: 디버그가 아닌 실행의 컨텍스트에서는 이 작업을 수행할 수 없습니다.
pl: Ta operacja jest niedozwolona w kontekście uruchamiania bez debugowania.
pt_br: Esta operação não é permitida no contexto de uma execução sem depuração.
ru: Эта операция запрещена в контексте неотладочного запуска.
tr: Bu işlem hata ayıklama dışındaki bir çalıştırmanın bağlamında yapılamaz.
zh_hans: 非调试运行的上下文中不允许此操作。
zh_hant: 這項作業不能用於非偵錯回合的內容中。

# NoMatchingExecutor
source: Could not find test executor with URI '{0}'. Make sure that the test executor is installed and supports .net runtime version {1}.
cs: Nepovedlo se najít prováděcí modul testování s identifikátorem URI {0}. Ujistěte se, že je prováděcí modul testování nainstalovaný a že podporuje .NET runtime verze {1}.
de: Der Testexecutor mit dem URI "{0}" wurde nicht gefunden. Stellen Sie sicher, dass der Testexecutor installiert ist und .NET Runtime-Version {1} unterstützt.
es: No se encuentra el ejecutor de pruebas con el URI '{0}'. Asegúrese de que el ejecutor de pruebas está instalado y admite el entorno de ejecución .NET, versión {1}.
fr: L'exécuteur de tests ayant l'URI '{0}' est introuvable. Vérifiez que l'exécuteur de tests est installé et qu'il prend en charge le runtime .NET version {1}.
it: Non è stato trovato alcun executor di test con URI '{0}'. Verificare che l'executor di test sia installato e supporti la versione {1} di .NET Runtime.
ja: URI が '{0}' のテスト実行プログラムが見つかりませんでした。テスト実行プログラムがインストールされ、.net ランタイム バージョン {1} をサポートしていることをご確認ください。
ko: URI가 '{0}'인 테스트 Executor를 찾을 수 없습니다. 테스트 Executor가 설치되어 있고 .NET 런타임 버전 {1}을(를) 지원하는지 확인하세요.
pl: Nie można odnaleźć modułu wykonywania testów o identyfikatorze URI „{0}”. Upewnij się, że moduł wykonywania testów został zainstalowany i obsługuje środowisko uruchomieniowe platformy .NET w wersji {1}.
pt_br: Não foi possível localizar o executor de teste com o URI '{0}'. Verifique se o executor de teste está instalado e oferece suporte à versão de runtime do .net {1}.
ru: Не удалось найти исполнитель тестов с URI "{0}". Убедитесь, что исполнитель тестов установлен и поддерживает версию среды выполнения .NET {1}.
tr: URI’si '{0}' olan test yürütücüsü bulunamadı. Test yürütücüsünün yüklendiğinden ve .NET çalışma zamanı {1} sürümünü desteklediğinden emin olun.
zh_hans: 找不到 URI 为“{0}”的测试执行器。请确保安装了测试执行器且该执行器支持.net 运行时版本 {1}。
zh_hant: 找不到具有 URI '{0}' 的測試執行程式。請確定已安裝測試執行程式，且其支援 .NET 執行階段版本 {1}。

# NoValidSourceFoundForDiscovery
source: None of the specified source(s) '{0}' is valid. Fix the above errors/warnings and then try again.
cs: Žádný ze zadaných zdrojů {0} není platný. Opravte chyby/upozornění výše a zkuste to znovu.
de: Keine der angegebenen Quellen "{0}" ist gültig. Beheben Sie die oben aufgeführten Fehler/Warnungen, und versuchen Sie es erneut.
es: Ninguno de los orígenes especificados ({0}) es válido. Corrija los errores o advertencias y vuelva a intentarlo.
fr: Aucune des sources spécifiées '{0}' n'est valide. Corrigez les erreurs/avertissements ci-dessus, puis réessayez.
it: Nessuna delle origini specificate '{0}' è valida. Correggere gli errori/avvisi precedenti e riprovare.
ja: 指定されたソース '{0}' がいずれも有効ではありません。上記のエラーおよび警告を修正してから、もう一度お試しください。
ko: 지정한 '{0}' 소스가 올바르지 않습니다. 위의 오류/경고를 해결한 후 다시 시도하세요.
pl: Wszystkie określone źródła „{0}” są nieprawidłowe. Napraw powyższe błędy/ostrzeżenia i spróbuj ponownie.
pt_br: Nenhuma das fontes especificadas '{0}' é válida. Corrija os erros/avisos acima e tente novamente.
ru: Ни один из указанных источников "{0}" не является допустимым. Исправьте эти ошибки и предупреждения и повторите попытку.
tr: Belirtilen '{0}' kaynaklarının hiçbiri geçerli değil. Yukarıdaki hataları/uyarıları düzeltin ve yeniden deneyin.
zh_hans: 无有效的指定源“{0}”。请修复以上错误/警告，然后重试。
zh_hant: 指定的來源 '{0}' 皆無效。請修正上述錯誤/警告，並再試一次。

# UnsupportedPropertiesInTestCaseFilter
source: No tests matched the filter because it contains one or more properties that are not valid ({0}). Specify filter expression containing valid properties ({1}).
cs: Filtru neodpovídá žádný test, protože obsahuje nejméně jednu vlastnost, která není platná ({0}). Zadejte výraz filtru, který obsahuje platné vlastnosti ({1}).
de: Es stimmten keine Tests mit dem Filter überein, weil er mindestens eine ungültige Eigenschaft enthält ({0}). Geben Sie einen Filterausdruck mit gültigen Eigenschaften an ({1}).
es: Ninguna prueba coincide con el filtro porque contiene una o varias propiedades no válidas ({0}). Especifique una expresión de filtro que contenga propiedades válidas ({1}).
fr: Aucun test ne correspond au filtre, car il contient une ou plusieurs propriétés non valides ({0}). Spécifiez une expression de filtre contenant des propriétés valides ({1}).
it: Nessun test corrisponde al filtro perché contiene una o più proprietà non valide ({0}). Specificare un'espressione di filtro contenente proprietà valide ({1}).
ja: フィルターに一致するテストがありません。フィルターに無効なプロパティが 1 つ以上含まれています ({0})。有効なプロパティを含むフィルター式 ({1}) を指定してください。
ko: 필터에 잘못된 속성({0})이 하나 이상 포함되어 있으므로 해당 필터와 일치하는 테스트가 없습니다. 유효한 속성({1})을 포함하는 필터 식을 지정하세요.
pl: Brak testów zgodnych z filtrem, ponieważ zawiera on co najmniej jedną nieprawidłową właściwość ({0}). Określ wyrażenie filtru zawierające prawidłowe właściwości ({1}).
pt_br: Nenhum teste correspondeu ao filtro porque ele contém uma ou mais propriedades que não são válidas ({0}). Especifique a expressão de filtro contendo as propriedades válidas ({1}).
ru: Соответствующих фильтру тестов нет, так как фильтр содержит одно недопустимое свойство или несколько ({0}). Укажите выражение фильтра, содержащее допустимые свойства ({1}).
tr: Geçerli olmayan bir veya daha fazla özellik içerdiğinden filtre ile eşleşen test yok ({0}). Geçerli değerleri ({1}) içeren bir filtre ifadesi belirtin.
zh_hans: 没有与筛选器匹配的测试，因为该筛选器包含一个或多个无效属性 ({0})。请指定包含有效属性 ({1}) 的筛选器表达式。
zh_hant: 因為篩選包含一或多個無效的屬性 ({0})，所以沒有符合篩選的測試。請指定包含有效屬性 ({1}) 的篩選運算式。

# NoDotnetExeFound
source: Could not find {0}. Make sure that the dotnet is installed on the machine.
cs: Nejde najít {0}. Ujistěte se, že na počítači je nainstalovaný dotnet.
de: {0} wurde nicht gefunden. Stellen Sie sicher, dass das dotnet auf dem Computer installiert ist.
es: No se pudo encontrar {0}. Asegúrese de que dotnet esté instalado en la máquina.
fr: {0} est introuvable. Vérifiez que le dotnet est installé sur la machine.
it: {0} non è stato trovato. Assicurarsi che dotnet sia installato nel computer.
ja: {0} が見つかりませんでした。dotnet がマシンにインストールされていることを確認してください。
ko: {0}을(를) 찾을 수 없습니다. 컴퓨터에 dotnet이 설치되어 있는지 확인하세요.
pl: Nie znaleziono elementu {0}. Upewnij się, że program dotnet jest zainstalowany na maszynie.
pt_br: Não foi possível localizar {0}. Certifique-se de que o dotnet esteja instalado no computador.
ru: Не удалось найти {0}. Убедитесь, что dotnet установлен на компьютере.
tr: {0} bulunamadı. Makinede dotnet’in yüklü olduğundan emin olun.
zh_hans: 找不到 {0}。请确保计算机上安装了 dotnet。
zh_hant: 找不到 {0}。請確定電腦上安裝了 .NET。

# TestHostExitedWithError
source: Testhost process for source(s) '{0}' exited with error: {1}. Please check the diagnostic logs for more information.
de: Der TestHost-Prozess für die Quelle(n) {0} wurde mit folgendem Fehler beendet: {1}. Weitere Informationen finden Sie in den Diagnoseprotokollen.

# DataCollectorDebuggerWarning
source: DataCollector debugging is enabled. Please attach debugger to datacollector process to continue.
cs: Je povolené ladění kolekce dat. Pokud chcete pokračovat, připojte prosím ladicí program k procesu kolekce dat.
de: DataCollector-Debugging ist aktiviert. Fügen Sie den Debugger an den Datensammlerprozess an, um den Vorgang fortzusetzen.
es: La depuración del recopilador de datos está habilitada. Asocie el depurador al proceso del recopilador de datos para continuar.
fr: Le débogage de collecteur de données est activé. Attachez le débogueur au processus datacollector pour continuer.
it: Il debug dell'agente di raccolta dati è abilitato. Per continuare, collegare il debugger al processo dell'agente di raccolta dati.
ja: DataCollector のデバッグが有効です。続行するにはデバッガーを datacollector プロセスにアタッチしてください。
ko: DataCollector 디버깅을 사용하도록 설정했습니다. datacollector 프로세스를 계속하려면 디버거를 연결하세요.
pl: Debugowanie modułu zbierającego dane zostało włączone. Dołącz debuger do procesu datacollector, aby kontynuować.
pt_br: A depuração do DataCollector está habilitada. Anexe o depurador ao processo datacollector para continuar.
ru: Включена отладка datacollector. Для продолжения подключите отладчик к процессу datacollector.
tr: DataCollector hata ayıklaması etkin. Devam etmek için lütfen hata ayıklayıcısını datacollector işlemine ekleyin.
zh_hans: 启用 DataCollector 调试。请将调试器附加到 datacollector 进程以继续。
zh_hant: DataCollector 已啟用。若要繼續，請將偵錯工具連結到 datacollector 處理序。

# TestRunFailed_NoDiscovererFound_NoTestsAreAvailableInTheSources
source: No test is available in {0}. Make sure that test discoverer & executors are registered and platform & framework version settings are appropriate and try again.
cs: V {0} nejsou dostupné žádné testy. Ujistěte se, že nástroje pro zjišťování a provádění testů jsou zaregistrované a že jsou vhodně zvolená nastavení verzí platformy a architektury, a zkuste to znovu.
de: In "{0}" ist kein Test verfügbar. Stellen Sie sicher, dass die Testdiscoverer und -executors registriert und die Versionseinstellungen für Plattform und Framework richtig sind, und wiederholen Sie den Vorgang.
es: No hay ninguna prueba disponible en {0}. Asegúrese de que los detectores y ejecutores de pruebas están registrados y de que la configuración de versión de la plataforma y de Framework es correcta y vuelva a intentarlo.
fr: Aucun test n'est disponible dans {0}. Vérifiez que les découvreurs et exécuteurs de tests sont inscrits. Vérifiez également que les paramètres de version de plateforme et de framework sont appropriés, puis réessayez.
it: Non ci sono test disponibili in {0}. Assicurarsi che l'agente di individuazione test e gli executor di test siano registrati e che le impostazioni delle versioni di piattaforma e framework siano appropriate, quindi riprovare.
ja: {0} で使用できるテストはありません。テスト探索プログラムおよび実行プログラムが登録されており、プラットフォームおよびフレームワークのバージョン設定が適切であることを確認してから、もう一度お試しください。
ko: {0}에서 테스트를 사용할 수 없습니다. 테스트 Discoverer 및 Executor가 등록되고 플랫폼 및 프레임워크 버전 설정이 적절한지 확인하고 다시 시도하세요.
pl: W elemencie {0} nie są dostępne żadne testy. Upewnij się, że wykrywacze i moduły wykonywania testów są zarejestrowane oraz że ustawienia wersji platformy i struktury są odpowiednie, a następnie spróbuj ponownie.
pt_br: Não há nenhum teste disponível em {0}. Verifique se o detector e os executores de teste estão registrados e se as configurações de versão da estrutura da plataforma & são apropriadas e tente novamente.
ru: В {0} нет доступных тестов. Убедитесь, что средства обнаружения и выполнения тестов зарегистрированы, а также проверьте правильность параметров платформы и версии платформы, после чего повторите попытку.
tr: {0} içinde hiç test yok. Test bulucuları ile yürütücülerinin kayıtlı olduğundan ve platform ile çerçeve sürümü ayarlarının uygun olduğundan emin olun ve yeniden deneyin.
zh_hans: {0} 中没有可用测试。请确保已注册测试发现器和执行器且平台和框架版本设置合理，然后重试。
zh_hant: {0} 中未提供任何測試。請確定已登錄了測試探索程式與執行程式，且平台與 Framework 版本設定皆正確，然後再試一次。

# TesthostDiagLogOutputFile
source: Logging TestHost Diagnostics in file: {0}
cs: Protokolování diagnostiky TestHost v souboru: {0}
de: Die TestHost-Diagnose wird in der Datei {0} protokolliert.
es: Registrando diagnóstico de TestHost en el archivo: {0}
fr: Journalisation des diagnostics TestHost dans le fichier : {0}
it: Registrazione della diagnostica di TestHost nel file: {0}
ja: 次のファイルで TestHost 診断をログ記録しています: {0}
ko: {0} 파일에 TestHost Diagnostics 로깅 중
pl: Rejestrowanie diagnostyki TestHost w pliku: {0}
pt_br: Registro em log do diagnóstico TestHost no arquivo: {0}
ru: Ведение журналов диагностики TestHost в файле: {0}
tr: TestHost Tanılamaları şu dosyadaki günlüğe kaydediliyor: {0}
zh_hans: 在文件 {0} 中记录 TestHost 诊断
zh_hant: 在檔案 {0} 中記錄 TestHost 診斷
