Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.ObjectModel/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, ja, pl, ru, tr, zh_hant

# TestOutcomeFailed
source: Failed
de: Fehler
es: Con error
fr: Échec
ja: 失敗
pl: Niepowodzenie
ru: Не пройден
tr: Başarısız
zh_hant: 失敗

# TestOutcomeNone
source: None
de: Keine
es: Ninguna
fr: Aucun
ja: なし
pl: Brak
ru: Нет
tr: Yok
zh_hant: 無

# TestOutcomePassed
source: Passed
de: Bestanden
es: Correctas
fr: Réussite
ja: 成功
pl: Powodzenie
ru: Пройден
tr: Başarılı
zh_hant: 成功

# TestResultTextMessagesFormat
source: Test Messages: {0}
de: Testmeldungen: {0}
es: Mensajes de prueba: {0}
fr: Messages de test : {0}
ja: テスト メッセージ: {0}
pl: Komunikaty testowe: {0}
ru: Тестовые сообщения: {0}
tr: Test İletileri: {0}
zh_hant: 測試訊息: {0}

# TestFailureMessageFormat
source: Message: {0}
de: Meldung: {0}
es: Mensaje: {0}
ja: メッセージ: {0}
pl: Komunikat: {0}
ru: Сообщение: {0}
tr: İleti: {0}
zh_hant: 訊息: {0}

# TestFailureStackTraceFormat
source: StackTrace: {0}
es: Seguimiento de la pila: {0}
ja: スタック トレース: {0}
pl: Ślad stosu: {0}
ru: Трассировка стека: {0}

# Exception_RegisteredTestPropertyHasDifferentValueType
source: Cannot register property '{0}' as value type '{1}' because it was already registered as '{2}'.
de: Die Eigenschaft "{0}" kann nicht als Werttyp "{1}" registriert werden, weil sie bereits als "{2}" registriert wurde.
es: No se puede registrar la propiedad '{0}' como tipo de valor '{1}' porque ya se registró como '{2}'.
fr: Impossible d'inscrire la propriété '{0}' en tant que type valeur '{1}', car elle est déjà inscrite en tant que '{2}'.
ja: プロパティ '{0}' は既に値の型 '{2}' として登録されていたため、'{1}' として登録できません。
pl: Nie można zarejestrować właściwości „{0}” jako typu wartości „{1}”, ponieważ została już ona zarejestrowana jako „{2}”.
ru: Невозможно зарегистрировать свойство "{0}" как тип значения "{1}", так как оно уже зарегистрировано как "{2}".
tr: '{0}' özelliği daha önce '{2}' olarak kaydedildiğinden '{1}' değer türü olarak kaydedilemiyor.
zh_hant: 無法將屬性 '{0}' 登錄為值類型 '{1}'，因為它已登錄為 '{2}'。

# TestCasePropertyColumnNumberLabel
source: Column Number
de: Spaltennummer
es: Número de columna
fr: Numéro de colonne
ja: 列番号
pl: Numer kolumny
ru: Номер столбца
tr: Sütun Numarası
zh_hant: 欄號

# TestCasePropertyExecutorUriLabel
source: Executor Uri
es: URI del ejecutor
fr: URI de l'exécuteur
ja: 実行プログラムの URI
pl: Identyfikator URI modułu wykonywania
ru: URI исполнителя
tr: Yürütücü URI’si
zh_hant: 執行程式 URI

# TestCasePropertySourceLabel
source: Source
de: Quelle
es: Origen
ja: ソース
pl: Źródło
ru: Источник
tr: Kaynak
zh_hant: 來源

# TestCasePropertyLineNumberLabel
source: Line Number
de: Zeilennummer
es: Número de línea
fr: Numéro de ligne
ja: 行番号
pl: Numer wiersza
ru: Номер строки
tr: Satır Numarası
zh_hant: 行號

# TestCasePropertyNameLabel
source: Name
es: Nombre
fr: Nom
ja: 名前
pl: Nazwa
ru: Имя
tr: Ad
zh_hant: 名稱

# TestResultPropertyComputerNameLabel
source: Computer Name
es: Nombre de equipo
fr: Nom de l'ordinateur
ja: コンピューター名
pl: Nazwa komputera
ru: Имя компьютера
tr: Bilgisayar Adı
zh_hant: 電腦名稱

# TestResultPropertyDisplayNameLabel
source: TestResult Display Name
de: TestResult-Anzeigename
es: Nombre para mostrar del resultado de la prueba
fr: Nom d'affichage de TestResult
ja: TestResult 表示名
pl: Nazwa wyświetlana wyniku testu
ru: Отображаемое имя результатов теста
tr: TestResult Görünen Adı
zh_hant: TestResult 顯示名稱

# TestResultPropertyDurationLabel
source: Duration
de: Dauer
es: Duración
fr: Durée
ja: 期間
pl: Czas trwania
ru: Длительность
tr: Süre
zh_hant: 持續時間

# TestResultPropertyEndTimeLabel
source: End Time
de: Endzeit
es: Hora de finalización
fr: Heure de fin
ja: 終了時刻
pl: Czas zakończenia
ru: Время окончания
tr: Bitiş Saati
zh_hant: 結束時間

# TestResultPropertyErrorColumnNumberLabel
source: Error Column Number
de: Spaltennummer des Fehlers
es: Número de columna de error
fr: Numéro de colonne d'erreur
ja: エラー列番号
pl: Numer kolumny błędu
ru: Номер столбца ошибки
tr: Hata Sütun Numarası
zh_hant: 錯誤欄號

# TestResultPropertyErrorMessageLabel
source: Error Message
de: Fehlermeldung
es: Mensaje de error
fr: Message d'erreur
ja: エラー メッセージ
pl: Komunikat o błędzie
ru: Сообщение об ошибке
tr: Hata İletisi
zh_hant: 錯誤訊息

# TestResultPropertyErrorStackTraceLabel
source: Error Stack Trace
de: Fehlerstapelüberwachung
es: Seguimiento de la pila de errores
fr: Arborescence des appels de procédure d'erreur
ja: エラーのスタック トレース
pl: Ślad stosu błędów
ru: Трассировка стека ошибок
tr: Hata Yığın İzlemesi
zh_hant: 錯誤堆疊追蹤

# TestResultPropertyOutcomeLabel
source: Outcome
de: Ergebnis
es: Resultado
fr: Résultat
ja: 結果
pl: Wynik
ru: Результат
tr: Sonuç
zh_hant: 結果

# TestResultPropertyStartTimeLabel
source: Start Time
de: Startzeit
es: Hora de inicio
fr: Heure de début
ja: 開始時刻
pl: Czas rozpoczęcia
ru: Время начала
tr: Başlangıç Saati
zh_hant: 開始時間

# ConverterNotSupported
source: Cannot find TypeConverter for type {0}.
de: TypeConverter für den Typ "{0}" wurde nicht gefunden.
es: No se encuentra TypeConverter para el tipo {0}.
fr: TypeConverter introuvable pour le type {0}.
ja: 型 {0} の TypeConverter が見つかりません。
pl: Nie można odnaleźć elementu TypeConverter dla typu {0}.
ru: Не удается найти преобразователь TypeConverter для типа {0}.
tr: {0} türü için TypeConverter bulunamıyor.
zh_hant: 找不到類型 {0} 的 TypeConverter。

# TestCasePropertyFilePathLabel
source: File Path
de: Dateipfad
es: Ruta de acceso del archivo
fr: Chemin du fichier
ja: ファイル パス
pl: Ścieżka do pliku
ru: Путь к файлу
tr: Dosya Yolu
zh_hant: 檔案路徑

# NotificationFrequencyIsNotPositive
source: Notification frequency need to be a positive value.
de: Die Benachrichtigungshäufigkeit muss ein positiver Wert sein.
es: La frecuencia de notificación debe ser un valor positivo.
fr: La fréquence de notification doit être une valeur positive.
ja: 通知頻度は正の値である必要があります。
pl: Częstotliwość powiadomień musi być wartością dodatnią.
ru: Частота уведомлений должна быть положительным значением.
tr: Bildirim sıklığı pozitif bir değer olmalıdır.
zh_hant: 通知頻率必須為正值。

# TestCasePropertyIdLabel
source: Id
pl: Identyfikator
ru: Идентификатор
tr: Kimlik
zh_hant: 識別碼

# InvalidSettingsXmlAttribute
source: Invalid settings '{0}'. Unexpected XmlAttribute: '{1}'.
de: Ungültige Einstellungen "{0}". Unerwartetes XmlAttribute: "{1}".
es: Configuración no válida: '{0}'. Atributo XML no esperado: '{1}'.
fr: Paramètres non valides '{0}'. XmlAttribute inattendu : '{1}'.
ja: 設定 '{0}' は無効です。予期しない XmlAttribute: '{1}'。
pl: Nieprawidłowe ustawienia „{0}”. Nieoczekiwany atrybut XmlAttribute: „{1}”.
ru: Недопустимые параметры "{0}". Неожиданный атрибут XmlAttribute: "{1}".
tr: '{0}' ayarları geçersiz. Beklenmeyen XmlAttribute: '{1}'.
zh_hant: 設定 '{0}' 無效。未預期的 XmlAttribute: '{1}'。

# InvalidSettingsXmlElement
source: Invalid settings '{0}'. Unexpected XmlElement: '{1}'.
de: Ungültige Einstellungen "{0}". Unerwartetes XmlElement: "{1}".
es: Configuración no válida: '{0}'. Elemento XML no esperado: '{1}'.
fr: Paramètres non valides '{0}'. XmlElement inattendu : '{1}'.
ja: 設定 '{0}' は無効です。予期しない XmlElement: '{1}'。
pl: Nieprawidłowe ustawienia „{0}”. Nieoczekiwany atrybut XmlElement: „{1}”.
ru: Недопустимые параметры "{0}". Неожиданный элемент XmlElement: "{1}".
tr: '{0}' ayarları geçersiz. Beklenmeyen XmlElement: '{1}'.
zh_hant: 設定 '{0}' 無效。未預期的 XmlElement: '{1}'。

# MissingDataCollectorAttributes
source: Invalid data collector settings. Expected attribute '{0}' is missing. A typical data collector setting would look like <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
de: Ungültige Datensammlereinstellungen. Das erwartete Attribut "{0}" fehlt. Eine typische Datensammlereinstellung sieht wie folgt aus: <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
es: Configuración de recopilador de datos no válida. Se esperaba el atributo '{0}', pero no está. Una configuración típica de recopilador de datos sería como la siguiente: <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
fr: Paramètres du collecteur de données non valides. L'attribut '{0}' attendu est manquant. Un paramètre de collecteur de données classique se présente comme suit : <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
ja: データ コレクターの設定が無効です。予期された属性 '{0}' が見つかりません。通常のデータ コレクターの設定は <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector"> のようになります。
pl: Nieprawidłowe ustawienia modułu zbierającego dane. Brak oczekiwanego atrybutu „{0}”. Typowe ustawienie modułu zbierającego dane typowe ma postać <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
ru: Недопустимые параметры сборщика данных. Отсутствует ожидаемый атрибут "{0}". Типичный параметр сборщика данных обычно выглядит следующим образом: <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
tr: Geçersiz veri toplayıcı ayarları. Beklenen '{0}' özniteliği eksik. Normal bir veri toplayıcı ayarı şu şekilde görünür: <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">.
zh_hant: 資料收集器設定無效。遺漏所需的屬性 '{0}'。一般的資料收集器設定會類似於 <DataCollector uri="dataCollector://Samples/SampleCollector/1.0" assemblyQualifiedName="Samples.SampleCollector.SampleDataCollector, SampleCollectors, Version=1.0.0.0, Culture=neutral, PublicKeyToken=1111111111111111" friendlyName="sampleCollector">。

# TestOutcomeNotFound
source: NotFound
es: No se encuentra
pl: Nie znaleziono
ru: Не найден

# TestOutcomeSkipped
source: Skipped
de: Übersprungen
es: Se ha omitido
fr: Ignoré
ja: スキップ
pl: Pominięto
ru: Пропущен
tr: Atlandı
zh_hant: 略過

# NotificationTimeoutIsZero
source: Notification timeout must be greater than zero.
de: Das Benachrichtigungstimeout muss größer als null sein.
es: El tiempo de espera de notificación debe ser mayor que cero.
fr: Le délai d'expiration de notification doit être supérieur à zéro.
ja: 通知タイムアウトは 0 より大きくする必要があります。
pl: Limit czasu powiadomienia musi mieć wartość większą niż zero.
ru: Время ожидания уведомления должно быть больше нуля.
tr: Bildirim zaman aşımı sıfırdan büyük olmalıdır.
zh_hant: 通知逾時必須大於零。

# InvalidSettingsIncorrectValue
source: Invalid settings '{0}'. Invalid value '{1}' specified for '{2}'.
de: Ungültige Einstellung "{0}". Es wurde ein ungültiger Wert "{1}" für "{2}" angegeben.
es: Configuración no válida: '{0}'. Se ha especificado un valor no válido ('{1}') para '{2}'.
fr: Paramètres non valides '{0}'. Valeur non valide '{1}' spécifiée pour '{2}'.
ja: 無効な設定です: '{0}'。'{2}' に対して無効な値 '{1}' が指定されました。
pl: Nieprawidłowe ustawienia „{0}”. Nieprawidłowa wartość „{1}” określona dla elementu „{2}”.
ru: Недопустимые параметры "{0}". Недопустимое значение "{1}", указанное для "{2}".
tr: '{0}' ayarları geçersiz. '{2}' için geçersiz '{1}' değeri belirtildi.
zh_hant: 設定 '{0}' 無效。為 '{2}' 指定的值 '{1}' 無效。

# InvalidRunSettingsRootNode
source: The root node of the run settings must be named 'RunSettings'.
de: Der Stammknoten der Laufzeiteinstellungen muss "RunSettings" heißen.
es: El nodo raíz de los parámetros de ejecución debe denominarse 'RunSettings'.
fr: Le nœud racine des paramètres d'exécution doit être nommé 'RunSettings'.
ja: 実行設定のルート ノードには 'RunSettings' という名前を付ける必要があります。
pl: Węzeł główny ustawień uruchamiania musi mieć nazwę „RunSettings”.
ru: Корневой узел параметров запуска должен иметь имя RunSettings.
tr: Çalıştırma ayarlarının kök düğümü 'RunSettings' olarak adlandırılmalıdır.
zh_hant: 回合設定的根節點必須命名為 'RunSettings'。

# NoTestCaseFilterForSpecificTests
source: Cannot specify TestCaseFilter for specific tests run. FilterCriteria is only for run with sources.
de: TestCaseFilter kann nicht für einen bestimmten Testlauf angegeben werden. FilterCriteria gilt nur für Ausführungen mit Quellen.
es: No se puede especificar TestCaseFilter para series de pruebas específicas. FilterCriteria se usa solo para ejecuciones con orígenes.
fr: Impossible de spécifier TestCaseFilter pour l'exécution de tests spécifiques. FilterCriteria est destiné uniquement à l'exécution avec des sources.
ja: 特定のテストの実行には TestCaseFilter を指定できません。FilterCriteria は、ソースでの実行だけで使用できます。
pl: Nie można określić elementu TestCaseFilter dla określonego przebiegu testów. Element FilterCriteria jest przeznaczony tylko dla przebiegu ze źródłami.
ru: Нельзя указывать фильтр TestCaseFilter для конкретного тестового запуска. Условия фильтра FilterCriteria предназначены только для выполнения с использованием источников.
tr: Belirli bir test çalıştırması için TestCaseFilter belirtilemiyor. FilterCriteria yalnızca kaynakları olan bir çalıştırma içindir.
zh_hant: 無法為特定測試回合指定 TestCaseFilter。FilterCriteria 只適用於以來源執行的狀況。

# UnexpectedTypeOfProperty
source: The test property type '{0}' of property '{1}' is not supported. Use one of the supported property type (primitive types, uri, string, string[]) and try again.
de: Der Testeigenschaftentyp "{0}" der Eigenschaft "{1}" wird nicht unterstützt. Verwenden Sie einen der unterstützten Eigenschaftentypen (primitive Typen, uri, string, string[]), und versuchen Sie es erneut.
es: No se admite el tipo '{0}' de la propiedad de prueba '{1}'. Use un tipo de propiedad admitido (tipos primitivos, URI, string, string[]) y vuelva a intentarlo.
fr: Le type de propriété de test '{0}' de la propriété '{1}' n'est pas pris en charge. Utilisez l'un des types de propriété pris en charge (types primitifs, uri, string, string[]), puis réessayez.
ja: プロパティ '{1}' のテスト プロパティの型 '{0}' はサポートされていません。サポートされているプロパティの型 (プリミティブ型、URI、string、string[]) のいずれかを使用して、もう一度お試しください。
pl: Typ „{0}” właściwości testu „{1}” nie jest obsługiwany. Użyj jednego z obsługiwanych typów właściwości (typy pierwotne, identyfikator URI, ciąg, ciąg[]) i spróbuj ponownie.
ru: Тип свойства теста "{0}" для свойства "{1}" не поддерживается. Используйте один из поддерживаемых типов свойств (типы-примитивы, URI, string, string[]) и повторите попытку.
tr: '{1}' özelliğinin '{0}' test özelliği türü desteklenmiyor. Desteklenen özellik türlerinden birini (temel türler, uri, string, string[]) seçin ve yeniden deneyin.
zh_hant: 不支援屬性 '{1}' 的測試屬性類型 '{0}'。請使用其中一個支援的屬性類型 (基本類型、uri、string、string[])，並再試一次。

# CouldNotFindXmlNode
source: Could not find '{0}' node
de: Der Knoten "{0}" wurde nicht gefunden.
es: No se encuentra el nodo '{0}'
fr: Nœud '{0}' introuvable
ja: '{0}' ノードが見つかりませんでした
pl: Nie można odnaleźć węzła „{0}”
ru: Не удалось найти узел "{0}".
tr: '{0}' düğümü bulunamadı
zh_hant: 找不到 '{0}' 節點

# TestCasePropertyFullyQualifiedNameLabel
source: FullyQualifiedName
es: Nombre completo
pl: W pełni kwalifikowana nazwa

# TestCasePropertyTraitsLabel
source: Traits
de: Merkmale
es: Rasgos
fr: Caractéristiques
ja: 特徴
pl: Cechy
ru: Признаки
tr: Nitelikler
zh_hant: 特性

# SolutionDirectoryNotExists
source: Solution directory '{0}' does not exists. Please make sure solution directory specified in runsettings exists and have read permissions for directory.
de: Das Projektmappenverzeichnis "{0}" ist nicht vorhanden. Stellen Sie sicher, dass das in "runsettings" angegebene Projektmappenverzeichnis vorhanden ist und über Leseberechtigungen für das Verzeichnis verfügt.
es: El directorio de solución '{0}' no existe. Asegúrese de que el directorio de solución especificado en Runsettings existe y de que tiene permisos de lectura para el directorio.
fr: Le répertoire de solution '{0}' n'existe pas. Vérifiez que le répertoire de solution spécifié dans runsettings existe, et que vous disposez d'autorisations d'accès en lecture pour celui-ci.
ja: ソリューション ディレクトリ '{0}' は存在しません。実行設定で指定したソリューション ディレクトリが存在することと、ディレクトリの読み取りアクセス許可があることをご確認ください。
pl: Katalog rozwiązania „{0}” nie istnieje. Upewnij się, że katalog rozwiązania podany w ustawieniach uruchamiania istnieje oraz że masz uprawnienia do odczytu dla tego katalogu.
ru: Каталог решения "{0}" не существует. Убедитесь, что указанный в параметрах запуска каталог решения существует и для него имеются разрешения на чтение.
tr: '{0}' çözüm dizini yok. Lütfen çalıştırma ayarlarında belirtilen çözüm dizininin mevcut olduğundan ve dizin için okuma izinlerine sahip olduğundan emin olun.
zh_hant: 解決方案目錄 '{0}' 不存在。請確認 runsettings 中指定的解決方案目錄存在，並且具有目錄的讀取權限。

# Common_CannotBeNullOrEmpty
source: The parameter cannot be null or empty.
de: Der Parameter darf nicht NULL oder leer sein.
es: El parámetro no puede ser nulo ni estar vacío.
fr: Le paramètre ne peut pas avoir une valeur null ou être vide.
ja: パラメーターを null または空にすることはできません。
pl: Parametr nie może mieć wartości null ani być pusty.
ru: Параметр не может быть пустым или иметь значение null.
tr: Parametre null veya boş olamaz.
zh_hant: 參數不可為 null 或空白。

# Common_FileNotExist
source: File {0} does not exist.
de: Die Datei "{0}" ist nicht vorhanden.
es: El archivo {0} no existe.
fr: Le fichier {0} n'existe pas.
ja: ファイル {0} は存在しません。
pl: Plik {0} nie istnieje.
ru: Файл {0} не существует.
tr: {0} dosyası yok.
zh_hant: 檔案 {0} 不存在。

# Common_ObjectMustBeOfType
source: Object must be of type {0}.
de: Das Objekt muss vom Typ {0} sein.
es: El objeto debe ser de tipo {0}.
fr: L'objet doit être de type {0}.
ja: オブジェクトは {0} 型でなければなりません。
pl: Obiekt musi być typu {0}.
ru: Объект должен принадлежать типу {0}.
tr: Nesne {0} türünde olmalıdır.
zh_hant: 物件必須為 {0} 類型。

# Common_TestOutcomeAborted
source: Aborted
de: Abgebrochen
es: Anuladas
fr: Abandonné
ja: 中止
pl: Przerwano
ru: Прерван
tr: İptal edildi
zh_hant: 已中止

# Common_TestOutcomeCompleted
source: Completed
de: Abgeschlossen
es: Finalizadas
fr: Effectué
ja: 完了
pl: Zakończono
ru: Завершен
tr: Tamamlandı
zh_hant: 已完成

# Common_TestOutcomeDisconnected
source: Disconnected
de: Getrennt
es: Desconectadas
fr: Déconnecté
ja: 切断
pl: Rozłączono
ru: Отключен
tr: Bağlantı kesildi
zh_hant: 已中斷連線

# Common_TestOutcomeError
source: Error
de: Fehler
fr: Erreur
ja: エラー
pl: Błąd
ru: Ошибка
tr: Hata
zh_hant: 錯誤

# Common_TestOutcomeFailed
source: Failed
de: Fehler
es: Con error
fr: Échec
ja: 失敗
pl: Niepowodzenie
ru: Не пройден
tr: Başarısız
zh_hant: 失敗

# Common_TestOutcomeInconclusive
source: Inconclusive
de: Nicht eindeutig
es: No concluyentes
fr: Non concluant
ja: 結果不確定
pl: Niejednoznaczny
ru: С неопределенным результатом
tr: Sonuçsuz
zh_hant: 結果不明

# Common_TestOutcomeInProgress
source: In Progress
de: In Bearbeitung
es: En curso
fr: En cours
ja: 処理中
pl: W toku
ru: Выполняется
tr: Sürüyor
zh_hant: 進行中

# Common_TestOutcomeNotExecuted
source: Not Executed
de: Nicht ausgeführt
es: No ejecutadas
fr: Non exécuté
ja: 実行されませんでした
pl: Niewykonany
ru: Не выполнен
tr: Yürütülmedi
zh_hant: 未執行

# Common_TestOutcomeNotRunnable
source: Not Runnable
de: Nicht ausführbar
es: No ejecutables
fr: Non exécutable
ja: 実行できませんでした
pl: Niemożliwy do uruchomienia
ru: Не готов к запуску
tr: Çalıştırılamıyor
zh_hant: 無法執行

# Common_TestOutcomePassed
source: Passed
de: Bestanden
es: Correctas
fr: Réussite
ja: 成功
pl: Powodzenie
ru: Пройден
tr: Başarılı
zh_hant: 成功

# Common_TestOutcomePassedButRunAborted
source: Passed (run aborted)
de: Bestanden (Ausführung abgebrochen)
es: Correctas (ejecución anulada)
fr: Réussi (exécution abandonnée)
ja: 成功 (中止された実行)
pl: Powodzenie (uruchomienie zostało przerwane)
ru: Пройден (выполнение прервано)
tr: Başarılı (çalıştırma iptal edildi)
zh_hant: 成功 (執行已中止)

# Common_TestOutcomePending
source: Pending
de: Ausstehend
es: Pendientes
fr: En attente
ja: 保留中
pl: Oczekiwanie
ru: Ожидание
tr: Bekliyor
zh_hant: 暫止

# Common_TestOutcomeTimeout
source: Timeout
es: Tiempo de espera agotado
fr: Délai d'expiration
ja: タイムアウト
pl: Limit czasu
ru: Время ожидания
tr: Zaman aşımı
zh_hant: 逾時

# Common_TestOutcomeWarning
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
ja: 警告
pl: Ostrzeżenie
ru: Предупреждение
tr: Uyarı
zh_hant: 警告

# DataCollectionSink_CanNotReadStream
source: Unable to read from the provided stream. Data from a stream cannot be sent unless the stream supports reading.
de: Aus dem bereitgestellten Datenstrom kann nicht gelesen werden. Daten aus einem Datenstrom können nur gesendet werden, wenn der Datenstrom Lesevorgänge unterstützt.
es: No se puede leer el flujo proporcionado. Los datos de un flujo no se pueden enviar si el flujo no admite lectura.
fr: Impossible de lire le flux fourni. Impossible d'envoyer les données d'un flux s'il ne prend pas en charge la lecture.
ja: 指定されたストリームからデータを読み取ることができません。ストリームで読み取りがサポートされていない場合は、ストリームのデータを送信できません。
pl: Nie można przeprowadzić odczytu z podanego strumienia. Nie można wysłać danych ze strumienia, jeśli strumień nie obsługuje odczytu.
ru: Не удается прочитать данные из указанного потока. Данные из потока не могут быть отправлены, если поток поддерживает чтение.
tr: Belirtilen akıştan okunamadı. Bir akış okumayı desteklemiyorsa, akıştaki veriler gönderilemez.
zh_hant: 無法讀取提供的資料流。除非資料流支援讀取，否則無法傳送來自資料流的資料。

# DataCollectionSink_InvalidFileNameCharacters
source: The provided file name '{0}' contains the following invalid characters: '{1}'.
de: Der angegebene Dateiname "{0}" enthält die folgenden ungültigen Zeichen: "{1}".
es: El nombre de archivo proporcionado ({0}) contiene los siguientes caracteres no válidos: '{1}'.
fr: Le nom de fichier '{0}' fourni contient les caractères non valides suivants : '{1}'.
ja: 指定されたファイル名 '{0}' に次の無効な文字が含まれています: '{1}'。
pl: Podana nazwa pliku „{0}” zawiera następujące nieprawidłowe znaki: „{1}”.
ru: Указанное имя файла "{0}" содержит следующие недопустимые символы: "{1}".
tr: Belirtilen '{0}' dosya adı şu geçersiz karakterleri içeriyor: '{1}'.
zh_hant: 提供的檔案名稱 '{0}' 含有下列無效的字元: '{1}'。

# DataCollectionSink_ReservedFilenameUsed
source: The provided file name '{0}' is reserved.
de: Der angegebene Dateiname "{0}" ist reserviert.
es: El nombre de archivo proporcionado ({0}) es un nombre reservado.
fr: Le nom de fichier '{0}' fourni est réservé.
ja: 指定されたファイル名 '{0}' は、予約済みです。
pl: Podana nazwa pliku „{0}” została zarezerwowana.
ru: Указанное имя файла "{0}" зарезервировано.
tr: Belirtilen '{0}' dosya adı ayrılmış.
zh_hant: 已保留提供的檔案名稱 '{0}'。

# FailedToCreateDiaSession
source: Failed to Create msdia Session COM HResult '{0}'.
es: No se pudo crear msdia Session COM HResult "{0}".
fr: Échec de la création du HResult COM de la session msdia : '{0}'.
ja: msdia Session COM HResult '{0}' を作成できませんでした。
pl: Nie można utworzyć modelu COM sesji msdia, wartość HResult: „{0}”.
zh_hant: 無法建立 msdia 工作階段 COM HResult '{0}'。

source: Failed to load msdia
es: No se pudo cargar msdia
fr: Échec du chargement de msdia
ja: msdia を読み込めませんでした
pl: Nie można załadować elementu msdia
zh_hant: 無法載入 msdia
