Repository: microsoft/vstest
Catalog: src/Microsoft.TestPlatform.ObjectModel/Resources/xlf/Resources.*.xlf
Languages: de, es, fr, ja, pl, ru, tr, zh_hant

# InvalidDataCollectorUriInSettings
source: Invalid URI in data collector settings '{0}'.
es: URI no válido en la configuración del recopilador de datos "{0}".
fr: URI non valide dans les paramètres de collecteur de données '{0}'.
pl: Nieprawidłowy identyfikator URI w ustawieniach modułu zbierającego dane „{0}”.
zh_hant: 資料收集器設定 '{0}' 中的 URI 無效。

# NullString
source: (null)
es: (nulo)
